tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* CRYPTOMASTER @Bit 0 : Write '1' to disable interrupt for event CRYPTOMASTER */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Pos (0UL)     /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Msk (0x1UL << CRACEN_INTENCLR_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.    */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Min (0x0UL)   /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Max (0x1UL)   /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Clear (0x1UL) /*!< Disable                                                              */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* RNG @Bit 1 : Write '1' to disable interrupt for event RNG */
  #define CRACEN_INTENCLR_RNG_Pos (1UL)              /*!< Position of RNG field.                                               */
  #define CRACEN_INTENCLR_RNG_Msk (0x1UL << CRACEN_INTENCLR_RNG_Pos) /*!< Bit mask of RNG field.                               */
  #define CRACEN_INTENCLR_RNG_Min (0x0UL)            /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTENCLR_RNG_Max (0x1UL)            /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTENCLR_RNG_Clear (0x1UL)          /*!< Disable                                                              */
  #define CRACEN_INTENCLR_RNG_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CRACEN_INTENCLR_RNG_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* PKEIKG @Bit 2 : Write '1' to disable interrupt for event PKEIKG */
  #define CRACEN_INTENCLR_PKEIKG_Pos (2UL)           /*!< Position of PKEIKG field.                                            */
  #define CRACEN_INTENCLR_PKEIKG_Msk (0x1UL << CRACEN_INTENCLR_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                      */
  #define CRACEN_INTENCLR_PKEIKG_Min (0x0UL)         /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_INTENCLR_PKEIKG_Max (0x1UL)         /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_INTENCLR_PKEIKG_Clear (0x1UL)       /*!< Disable                                                              */
  #define CRACEN_INTENCLR_PKEIKG_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CRACEN_INTENCLR_PKEIKG_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* CRACEN_INTPEND: Pending interrupts */
  #define CRACEN_INTPEND_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND register.                                     */

/* CRYPTOMASTER @Bit 0 : Read pending status of interrupt for event CRYPTOMASTER */
  #define CRACEN_INTPEND_CRYPTOMASTER_Pos (0UL)      /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_INTPEND_CRYPTOMASTER_Msk (0x1UL << CRACEN_INTPEND_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.      */
  #define CRACEN_INTPEND_CRYPTOMASTER_Min (0x0UL)    /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTPEND_CRYPTOMASTER_Max (0x1UL)    /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTPEND_CRYPTOMASTER_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define CRACEN_INTPEND_CRYPTOMASTER_Pending (0x1UL) /*!< Read: Pending                                                       */

/* RNG @Bit 1 : Read pending status of interrupt for event RNG */
  #define CRACEN_INTPEND_RNG_Pos (1UL)               /*!< Position of RNG field.                                               */
  #define CRACEN_INTPEND_RNG_Msk (0x1UL << CRACEN_INTPEND_RNG_Pos) /*!< Bit mask of RNG field.                                 */
  #define CRACEN_INTPEND_RNG_Min (0x0UL)             /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTPEND_RNG_Max (0x1UL)             /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTPEND_RNG_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define CRACEN_INTPEND_RNG_Pending (0x1UL)         /*!< Read: Pending                                                        */

/* PKEIKG @Bit 2 : Read pending status of interrupt for event PKEIKG */
  #define CRACEN_INTPEND_PKEIKG_Pos (2UL)            /*!< Position of PKEIKG field.                                            */
  #define CRACEN_INTPEND_PKEIKG_Msk (0x1UL << CRACEN_INTPEND_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                        */
  #define CRACEN_INTPEND_PKEIKG_Min (0x0UL)          /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_INTPEND_PKEIKG_Max (0x1UL)          /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_INTPEND_PKEIKG_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define CRACEN_INTPEND_PKEIKG_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* CRACEN_ENABLE: Enable CRACEN peripheral modules. */
  #define CRACEN_ENABLE_ResetValue (0x00000000UL)    /*!< Reset value of ENABLE register.                                      */

/* CRYPTOMASTER @Bit 0 : Enable cryptomaster */
  #define CRACEN_ENABLE_CRYPTOMASTER_Pos (0UL)       /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_ENABLE_CRYPTOMASTER_Msk (0x1UL << CRACEN_ENABLE_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.        */
  #define CRACEN_ENABLE_CRYPTOMASTER_Min (0x0UL)     /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_ENABLE_CRYPTOMASTER_Max (0x1UL)     /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_ENABLE_CRYPTOMASTER_Disabled (0x0UL) /*!< Cryptomaster disabled.                                              */
  #define CRACEN_ENABLE_CRYPTOMASTER_Enabled (0x1UL) /*!< Cryptomaster enabled.                                                */

/* RNG @Bit 1 : Enable RNG */
  #define CRACEN_ENABLE_RNG_Pos (1UL)                /*!< Position of RNG field.                                               */
  #define CRACEN_ENABLE_RNG_Msk (0x1UL << CRACEN_ENABLE_RNG_Pos) /*!< Bit mask of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Min (0x0UL)              /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Max (0x1UL)              /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Disabled (0x0UL)         /*!< RNG disabled.                                                        */
  #define CRACEN_ENABLE_RNG_Enabled (0x1UL)          /*!< RNG enabled.                                                         */

/* PKEIKG @Bit 2 : Enable PKE and IKG */
  #define CRACEN_ENABLE_PKEIKG_Pos (2UL)             /*!< Position of PKEIKG field.                                            */
  #define CRACEN_ENABLE_PKEIKG_Msk (0x1UL << CRACEN_ENABLE_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                          */
  #define CRACEN_ENABLE_PKEIKG_Min (0x0UL)           /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_ENABLE_PKEIKG_Max (0x1UL)           /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_ENABLE_PKEIKG_Disabled (0x0UL)      /*!< PKE and IKG disabled.                                                */
  #define CRACEN_ENABLE_PKEIKG_Enabled (0x1UL)       /*!< PKE and IKG enabled.                                                 */


/* CRACEN_PROTECTEDRAMLOCK: Lock the access to the protected RAM. */
  #define CRACEN_PROTECTEDRAMLOCK_ResetValue (0x00000000UL) /*!< Reset value of PROTECTEDRAMLOCK register.                     */

/* ENABLE @Bit 0 : Enable the lock */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Pos (0UL)   /*!< Position of ENABLE field.                                            */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Msk (0x1UL << CRACEN_PROTECTEDRAMLOCK_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Disabled (0x0UL) /*!< Lock disabled.                                                  */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Enabled (0x1UL) /*!< Lock enabled.                                                    */


