tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* TASKS_TRIGGER @Bit 0 : Trigger n for triggering the corresponding TRIGGERED[n] event */
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL)  /*!< Position of TASKS_TRIGGER field.                                     */
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << EGU_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of TASKS_TRIGGER
                                                                            field.*/
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGGER field.                        */
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGGER field.                        */
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL) /*!< Trigger task                                                    */


/* EGU_SUBSCRIBE_TRIGGER: Subscribe configuration for task TRIGGER[n] */
  #define EGU_SUBSCRIBE_TRIGGER_MaxCount (16UL)      /*!< Max size of SUBSCRIBE_TRIGGER[16] array.                             */
  #define EGU_SUBSCRIBE_TRIGGER_MaxIndex (15UL)      /*!< Max index of SUBSCRIBE_TRIGGER[16] array.                            */
  #define EGU_SUBSCRIBE_TRIGGER_MinIndex (0UL)       /*!< Min index of SUBSCRIBE_TRIGGER[16] array.                            */
  #define EGU_SUBSCRIBE_TRIGGER_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_TRIGGER[16] register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that task TRIGGER[n] will subscribe to */
  #define EGU_SUBSCRIBE_TRIGGER_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define EGU_SUBSCRIBE_TRIGGER_CHIDX_Msk (0xFFUL << EGU_SUBSCRIBE_TRIGGER_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define EGU_SUBSCRIBE_TRIGGER_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define EGU_SUBSCRIBE_TRIGGER_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define EGU_SUBSCRIBE_TRIGGER_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define EGU_SUBSCRIBE_TRIGGER_EN_Msk (0x1UL << EGU_SUBSCRIBE_TRIGGER_EN_Pos) /*!< Bit mask of EN field.                      */
  #define EGU_SUBSCRIBE_TRIGGER_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define EGU_SUBSCRIBE_TRIGGER_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define EGU_SUBSCRIBE_TRIGGER_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define EGU_SUBSCRIBE_TRIGGER_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* EGU_EVENTS_TRIGGERED: Event number n generated by triggering the corresponding TRIGGER[n] task */
  #define EGU_EVENTS_TRIGGERED_MaxCount (16UL)       /*!< Max size of EVENTS_TRIGGERED[16] array.                              */
  #define EGU_EVENTS_TRIGGERED_MaxIndex (15UL)       /*!< Max index of EVENTS_TRIGGERED[16] array.                             */
  #define EGU_EVENTS_TRIGGERED_MinIndex (0UL)        /*!< Min index of EVENTS_TRIGGERED[16] array.                             */
  #define EGU_EVENTS_TRIGGERED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIGGERED[16] register.                    */

/* EVENTS_TRIGGERED @Bit 0 : Event number n generated by triggering the corresponding TRIGGER[n] task */
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos (0UL) /*!< Position of EVENTS_TRIGGERED field.                             */
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Msk (0x1UL << EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos) /*!< Bit mask of
                                                                            EVENTS_TRIGGERED field.*/
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIGGERED field.               */
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIGGERED field.               */
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Generated (0x1UL) /*!< Event generated                                         */


/* EGU_PUBLISH_TRIGGERED: Publish configuration for event TRIGGERED[n] */
  #define EGU_PUBLISH_TRIGGERED_MaxCount (16UL)      /*!< Max size of PUBLISH_TRIGGERED[16] array.                             */
  #define EGU_PUBLISH_TRIGGERED_MaxIndex (15UL)      /*!< Max index of PUBLISH_TRIGGERED[16] array.                            */
  #define EGU_PUBLISH_TRIGGERED_MinIndex (0UL)       /*!< Min index of PUBLISH_TRIGGERED[16] array.                            */
  #define EGU_PUBLISH_TRIGGERED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TRIGGERED[16] register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event TRIGGERED[n] will publish to */
  #define EGU_PUBLISH_TRIGGERED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define EGU_PUBLISH_TRIGGERED_CHIDX_Msk (0xFFUL << EGU_PUBLISH_TRIGGERED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define EGU_PUBLISH_TRIGGERED_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define EGU_PUBLISH_TRIGGERED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define EGU_PUBLISH_TRIGGERED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define EGU_PUBLISH_TRIGGERED_EN_Msk (0x1UL << EGU_PUBLISH_TRIGGERED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define EGU_PUBLISH_TRIGGERED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define EGU_PUBLISH_TRIGGERED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define EGU_PUBLISH_TRIGGERED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define EGU_PUBLISH_TRIGGERED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* EGU_INTEN: Enable or disable interrupt */
  #define EGU_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* TRIGGERED0 @Bit 0 : Enable or disable interrupt for event TRIGGERED[0] */
  #define EGU_INTEN_TRIGGERED0_Pos (0UL)             /*!< Position of TRIGGERED0 field.                                        */
  #define EGU_INTEN_TRIGGERED0_Msk (0x1UL << EGU_INTEN_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field.                      */
  #define EGU_INTEN_TRIGGERED0_Min (0x0UL)           /*!< Min enumerator value of TRIGGERED0 field.                            */
  #define EGU_INTEN_TRIGGERED0_Max (0x1UL)           /*!< Max enumerator value of TRIGGERED0 field.                            */
  #define EGU_INTEN_TRIGGERED0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define EGU_INTEN_TRIGGERED0_Enabled (0x1UL)       /*!< Enable                                                               */

