tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct ETM ======================================================== */
/**
  * @brief Embedded Trace Macrocell
  */
  typedef struct {                                   /*!< ETM Structure                                                        */
    __IM uint32_t RESERVED;
    __IOM uint32_t TRCPRGCTLR;                       /*!< (@ 0x00000004) Enables the trace unit.                               */
    __IOM uint32_t TRCPROCSELR;                      /*!< (@ 0x00000008) Controls which PE to trace. Might ignore writes when
                                                                         the trace unit is enabled or not idle. Before writing
                                                                         to this register, ensure that TRCSTATR.IDLE == 1 so
                                                                         that the trace unit can synchronize with the chosen PE.
                                                                         Implemented if TRCIDR3.NUMPROC is greater than zero.*/
    __IOM uint32_t TRCSTATR;                         /*!< (@ 0x0000000C) Idle status bit                                       */
    __IOM uint32_t TRCCONFIGR;                       /*!< (@ 0x00000010) Controls the tracing options This register must always
                                                                         be programmed as part of trace unit initialization.
                                                                         Might ignore writes when the trace unit is enabled or
                                                                         not idle.*/
    __IM uint32_t RESERVED1[3];
    __IOM uint32_t TRCEVENTCTL0R;                    /*!< (@ 0x00000020) Controls the tracing of arbitrary events. If the
                                                                         selected event occurs a trace element is generated in
                                                                         the trace stream according to the settings in
                                                                         TRCEVENTCTL1R.DATAEN and TRCEVENTCTL1R.INSTEN.*/
    __IOM uint32_t TRCEVENTCTL1R;                    /*!< (@ 0x00000024) Controls the behavior of the events that TRCEVENTCTL0R
                                                                         selects. This register must always be programmed as
                                                                         part of trace unit initialization. Might ignore writes
                                                                         when the trace unit is enabled or not idle.*/
    __IM uint32_t RESERVED2;
    __IOM uint32_t TRCSTALLCTLR;                     /*!< (@ 0x0000002C) Enables trace unit functionality that prevents trace
                                                                         unit buffer overflows. Might ignore writes when the
                                                                         trace unit is enabled or not idle. Must be programmed
                                                                         if TRCIDR3.STALLCTL == 1.*/
    __IOM uint32_t TRCTSCTLR;                        /*!< (@ 0x00000030) Controls the insertion of global timestamps in the
                                                                         trace streams. When the selected event is triggered,
                                                                         the trace unit inserts a global timestamp into the
                                                                         trace streams. Might ignore writes when the trace unit
                                                                         is enabled or not idle. Must be programmed if
                                                                         TRCCONFIGR.TS == 1.*/
    __IOM uint32_t TRCSYNCPR;                        /*!< (@ 0x00000034) Controls how often trace synchronization requests
                                                                         occur. Might ignore writes when the trace unit is
                                                                         enabled or not idle. If writes are permitted then the
                                                                         register must be programmed.*/
    __IOM uint32_t TRCCCCTLR;                        /*!< (@ 0x00000038) Sets the threshold value for cycle counting. Might
                                                                         ignore writes when the trace unit is enabled or not
                                                                         idle. Must be programmed if TRCCONFIGR.CCI==1.*/
    __IOM uint32_t TRCBBCTLR;                        /*!< (@ 0x0000003C) Controls which regions in the memory map are enabled to
                                                                         use branch broadcasting. Might ignore writes when the
                                                                         trace unit is enabled or not idle. Must be programmed
                                                                         if TRCCONFIGR.BB == 1.*/
    __IOM uint32_t TRCTRACEIDR;                      /*!< (@ 0x00000040) Sets the trace ID for instruction trace. If data trace
                                                                         is enabled then it also sets the trace ID for data
                                                                         trace, to (trace ID for instruction trace) + 1. This
                                                                         register must always be programmed as part of trace
                                                                         unit initialization. Might ignore writes when the trace
                                                                         unit is enabled or not idle.*/
    __IOM uint32_t TRCQCTLR;                         /*!< (@ 0x00000044) Controls when Q elements are enabled. Might ignore
                                                                         writes when the trace unit is enabled or not idle. This
                                                                         register must be programmed if it is implemented and
                                                                         TRCCONFIGR.QE is set to any value other than 0b00.*/
    __IM uint32_t RESERVED3[14];
    __IOM uint32_t TRCVICTLR;                        /*!< (@ 0x00000080) Controls instruction trace filtering. Might ignore
                                                                         writes when the trace unit is enabled or not idle. Only
                                                                         returns stable data when TRCSTATR.PMSTABLE == 1. Must
                                                                         be programmed, particularly to set the value of the
                                                                         SSSTATUS bit, which sets the state of the start/stop
                                                                         logic.*/
    __IOM uint32_t TRCVIIECTLR;                      /*!< (@ 0x00000084) ViewInst exclude control. Might ignore writes when the
                                                                         trace unit is enabled or not idle. This register must
                                                                         be programmed when one or more address comparators are
                                                                         implemented.*/
    __IOM uint32_t TRCVISSCTLR;                      /*!< (@ 0x00000088) Use this to set, or read, the single address
                                                                         comparators that control the ViewInst start/stop logic.
                                                                         The start/stop logic is active for an instruction which
                                                                         causes a start and remains active up to and including
                                                                         an instruction which causes a stop, and then the
                                                                         start/stop logic becomes inactive. Might ignore writes
                                                                         when the trace unit is enabled or not idle. If
                                                                         implemented then this register must be programmed.*/
    __IOM uint32_t TRCVIPCSSCTLR;                    /*!< (@ 0x0000008C) Use this to set, or read, which PE comparator inputs
                                                                         can control the ViewInst start/stop logic. Might ignore
                                                                         writes when the trace unit is enabled or not idle. If
                                                                         implemented then this register must be programmed.*/
    __IM uint32_t RESERVED4[4];
    __IOM uint32_t TRCVDCTLR;                        /*!< (@ 0x000000A0) Controls data trace filtering. Might ignore writes when
                                                                         the trace unit is enabled or not idle. This register
                                                                         must be programmed when data tracing is enabled, that
                                                                         is, when either TRCCONFIGR.DA == 1 or TRCCONFIGR.DV ==
                                                                         1.*/
    __IOM uint32_t TRCVDSACCTLR;                     /*!< (@ 0x000000A4) ViewData include / exclude control. Might ignore writes
                                                                         when the trace unit is enabled or not idle. This
                                                                         register must be programmed when one or more address
                                                                         comparators are implemented.*/
    __IOM uint32_t TRCVDARCCTLR;                     /*!< (@ 0x000000A8) ViewData include / exclude control. Might ignore writes
                                                                         when the trace unit is enabled or not idle. This
                                                                         register must be programmed when one or more address
                                                                         comparators are implemented.*/
    __IM uint32_t RESERVED5[21];
    __IOM uint32_t TRCSEQEVR[3];                     /*!< (@ 0x00000100) Moves the sequencer state according to programmed
                                                                         events. Might ignore writes when the trace unit is
                                                                         enabled or not idle. When the sequencer is used, all
                                                                         sequencer state transitions must be programmed with a
                                                                         valid event.*/
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t TRCSEQRSTEVR;                     /*!< (@ 0x00000118) Moves the sequencer to state 0 when a programmed event
                                                                         occurs. Might ignore writes when the trace unit is
                                                                         enabled or not idle. When the sequencer is used, all
                                                                         sequencer state transitions must be programmed with a
                                                                         valid event.*/
    __IOM uint32_t TRCSEQSTR;                        /*!< (@ 0x0000011C) Use this to set, or read, the sequencer state. Might
                                                                         ignore writes when the trace unit is enabled or not
                                                                         idle. Only returns stable data when TRCSTATR.PMSTABLE
                                                                         == 1. When the sequencer is used, all sequencer state
                                                                         transitions must be programmed with a valid event.*/
    __IOM uint32_t TRCEXTINSELR;                     /*!< (@ 0x00000120) Use this to set, or read, which external inputs are
                                                                         resources to the trace unit. Might ignore writes when
                                                                         the trace unit is enabled or not idle. Only returns
                                                                         stable data when TRCSTATR.PMSTABLE == 1. When the
                                                                         sequencer is used, all sequencer state transitions must
                                                                         be programmed with a valid event.*/
    __IM uint32_t RESERVED7[7];
    __IOM uint32_t TRCCNTRLDVR[4];                   /*!< (@ 0x00000140) This sets or returns the reload count value for counter
                                                                         n. Might ignore writes when the trace unit is enabled
                                                                         or not idle.*/
    __IOM uint32_t TRCCNTCTLR[4];                    /*!< (@ 0x00000150) Controls the operation of counter n. Might ignore
                                                                         writes when the trace unit is enabled or not idle.*/
    __IOM uint32_t TRCCNTVR[4];                      /*!< (@ 0x00000160) This sets or returns the value of counter n. The count
                                                                         value is only stable when TRCSTATR.PMSTABLE == 1. If
                                                                         software uses counter n then it must write to this
                                                                         register to set the initial counter value. Might ignore
                                                                         writes when the trace unit is enabled or not idle.*/
    __IM uint32_t RESERVED8[36];
    __IOM uint32_t TRCRSCTLR[32];                    /*!< (@ 0x00000200) Controls the selection of the resources in the trace
                                                                         unit. Might ignore writes when the trace unit is
                                                                         enabled or not idle. If software selects a
                                                                         non-implemented resource then CONSTRAINED UNPREDICTABLE
                                                                         behavior of the resource selector occurs, so the
                                                                         resource selector might fire unexpectedly or might not
                                                                         fire. Reads of the TRCRSCTLRn might return UNKNOWN.*/
    __IOM uint32_t TRCSSCCR0;                        /*!< (@ 0x00000280) Controls the single-shot comparator.                  */
    __IM uint32_t RESERVED9[7];
    __IOM uint32_t TRCSSCSR0;                        /*!< (@ 0x000002A0) Indicates the status of the single-shot comparators.
                                                                         TRCSSCSR0 is sensitive toinstruction addresses.*/
    __IM uint32_t RESERVED10[7];
    __IOM uint32_t TRCSSPCICR0;                      /*!< (@ 0x000002C0) Selects the processor comparator inputs for Single-shot
                                                                         control.*/
    __IM uint32_t RESERVED11[19];
    __IOM uint32_t TRCPDCR;                          /*!< (@ 0x00000310) Controls the single-shot comparator.                  */
    __IOM uint32_t TRCPDSR;                          /*!< (@ 0x00000314) Indicates the power down status of the ETM.           */
    __IM uint32_t RESERVED12[755];
    __IOM uint32_t TRCITATBIDR;                      /*!< (@ 0x00000EE4) Sets the state of output pins.                        */
    __IM uint32_t RESERVED13[3];
    __IOM uint32_t TRCITIATBINR;                     /*!< (@ 0x00000EF4) Reads the state of the input pins.                    */
    __IM uint32_t RESERVED14;
    __IOM uint32_t TRCITIATBOUTR;                    /*!< (@ 0x00000EFC) Sets the state of the output pins.                    */
    __IOM uint32_t TRCITCTRL;                        /*!< (@ 0x00000F00) Enables topology detection or integration testing, by
                                                                         putting ETM-M33 into integration mode.*/
    __IM uint32_t RESERVED15[39];
    __IOM uint32_t TRCCLAIMSET;                      /*!< (@ 0x00000FA0) Sets bits in the claim tag and determines the number of
                                                                         claim tag bits implemented.*/
    __IOM uint32_t TRCCLAIMCLR;                      /*!< (@ 0x00000FA4) Clears bits in the claim tag and determines the current
                                                                         value of the claim tag.*/
    __IM uint32_t RESERVED16[4];
    __IOM uint32_t TRCAUTHSTATUS;                    /*!< (@ 0x00000FB8) Indicates the current level of tracing permitted by the
                                                                         system*/
    __IM uint32_t TRCDEVARCH;                        /*!< (@ 0x00000FBC) The TRCDEVARCH identifies ETM-M33 as an ETMv4.2
                                                                         component*/
    __IM uint32_t RESERVED17[3];
    __IM uint32_t TRCDEVTYPE;                        /*!< (@ 0x00000FCC) Controls the single-shot comparator.                  */
    __IOM uint32_t TRCPIDR[8];                       /*!< (@ 0x00000FD0) Coresight peripheral identification registers.        */
    __IOM uint32_t TRCCIDR[4];                       /*!< (@ 0x00000FF0) Coresight component identification registers.         */
  } NRF_ETM_Type;                                    /*!< Size = 4096 (0x1000)                                                 */

