tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* GRTC_EVTENSET: Enable event routing */
  #define GRTC_EVTENSET_ResetValue (0x00000000UL)    /*!< Reset value of EVTENSET register.                                    */

/* PWMPERIODEND @Bit 27 : Write '1' to enable event routing for event PWMPERIODEND */
  #define GRTC_EVTENSET_PWMPERIODEND_Pos (27UL)      /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_EVTENSET_PWMPERIODEND_Msk (0x1UL << GRTC_EVTENSET_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.        */
  #define GRTC_EVTENSET_PWMPERIODEND_Min (0x0UL)     /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENSET_PWMPERIODEND_Max (0x1UL)     /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENSET_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define GRTC_EVTENSET_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                        */
  #define GRTC_EVTENSET_PWMPERIODEND_Set (0x1UL)     /*!< Enable                                                               */


/* GRTC_EVTENCLR: Disable event routing */
  #define GRTC_EVTENCLR_ResetValue (0x00000000UL)    /*!< Reset value of EVTENCLR register.                                    */

/* PWMPERIODEND @Bit 27 : Write '1' to disable event routing for event PWMPERIODEND */
  #define GRTC_EVTENCLR_PWMPERIODEND_Pos (27UL)      /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_EVTENCLR_PWMPERIODEND_Msk (0x1UL << GRTC_EVTENCLR_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.        */
  #define GRTC_EVTENCLR_PWMPERIODEND_Min (0x0UL)     /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENCLR_PWMPERIODEND_Max (0x1UL)     /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_EVTENCLR_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define GRTC_EVTENCLR_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                        */
  #define GRTC_EVTENCLR_PWMPERIODEND_Clear (0x1UL)   /*!< Disable                                                              */


/* GRTC_MODE: Counter mode selection */
  #define GRTC_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* AUTOEN @Bit 0 : Automatic enable to keep the SYSCOUNTER active. */
  #define GRTC_MODE_AUTOEN_Pos (0UL)                 /*!< Position of AUTOEN field.                                            */
  #define GRTC_MODE_AUTOEN_Msk (0x1UL << GRTC_MODE_AUTOEN_Pos) /*!< Bit mask of AUTOEN field.                                  */
  #define GRTC_MODE_AUTOEN_Min (0x0UL)               /*!< Min enumerator value of AUTOEN field.                                */
  #define GRTC_MODE_AUTOEN_Max (0x1UL)               /*!< Max enumerator value of AUTOEN field.                                */
  #define GRTC_MODE_AUTOEN_Default (0x0UL)           /*!< Default configuration to keep the SYSCOUNTER active.                 */
  #define GRTC_MODE_AUTOEN_CpuActive (0x1UL)         /*!< In addition to the above mode, any local CPU that is not sleeping keep
                                                          the SYSCOUNTER active.*/

/* SYSCOUNTEREN @Bit 1 : Enable the SYSCOUNTER */
  #define GRTC_MODE_SYSCOUNTEREN_Pos (1UL)           /*!< Position of SYSCOUNTEREN field.                                      */
  #define GRTC_MODE_SYSCOUNTEREN_Msk (0x1UL << GRTC_MODE_SYSCOUNTEREN_Pos) /*!< Bit mask of SYSCOUNTEREN field.                */
  #define GRTC_MODE_SYSCOUNTEREN_Min (0x0UL)         /*!< Min enumerator value of SYSCOUNTEREN field.                          */
  #define GRTC_MODE_SYSCOUNTEREN_Max (0x1UL)         /*!< Max enumerator value of SYSCOUNTEREN field.                          */
  #define GRTC_MODE_SYSCOUNTEREN_Disabled (0x0UL)    /*!< SYSCOUNTER disabled                                                  */
  #define GRTC_MODE_SYSCOUNTEREN_Enabled (0x1UL)     /*!< SYSCOUNTER enabled                                                   */


/* GRTC_KEEPRUNNING: Request to keep the SYSCOUNTER in the active state and prevent going to sleep */
  #define GRTC_KEEPRUNNING_ResetValue (0x00000000UL) /*!< Reset value of KEEPRUNNING register.                                 */

/* REQUEST0 @Bit 0 : Request from index [0] */
  #define GRTC_KEEPRUNNING_REQUEST0_Pos (0UL)        /*!< Position of REQUEST0 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST0_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST0_Pos) /*!< Bit mask of REQUEST0 field.              */
  #define GRTC_KEEPRUNNING_REQUEST0_Min (0x0UL)      /*!< Min enumerator value of REQUEST0 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST0_Max (0x1UL)      /*!< Max enumerator value of REQUEST0 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST0_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST0_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST1 @Bit 1 : Request from index [1] */
  #define GRTC_KEEPRUNNING_REQUEST1_Pos (1UL)        /*!< Position of REQUEST1 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST1_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST1_Pos) /*!< Bit mask of REQUEST1 field.              */
  #define GRTC_KEEPRUNNING_REQUEST1_Min (0x0UL)      /*!< Min enumerator value of REQUEST1 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST1_Max (0x1UL)      /*!< Max enumerator value of REQUEST1 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST1_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST1_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST2 @Bit 2 : Request from index [2] */
  #define GRTC_KEEPRUNNING_REQUEST2_Pos (2UL)        /*!< Position of REQUEST2 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST2_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST2_Pos) /*!< Bit mask of REQUEST2 field.              */
  #define GRTC_KEEPRUNNING_REQUEST2_Min (0x0UL)      /*!< Min enumerator value of REQUEST2 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST2_Max (0x1UL)      /*!< Max enumerator value of REQUEST2 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST2_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST2_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */

/* REQUEST3 @Bit 3 : Request from index [3] */
  #define GRTC_KEEPRUNNING_REQUEST3_Pos (3UL)        /*!< Position of REQUEST3 field.                                          */
  #define GRTC_KEEPRUNNING_REQUEST3_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST3_Pos) /*!< Bit mask of REQUEST3 field.              */
  #define GRTC_KEEPRUNNING_REQUEST3_Min (0x0UL)      /*!< Min enumerator value of REQUEST3 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST3_Max (0x1UL)      /*!< Max enumerator value of REQUEST3 field.                              */
  #define GRTC_KEEPRUNNING_REQUEST3_NotActive (0x0UL) /*!< Allow SYSCOUNTER to go to sleep                                     */
  #define GRTC_KEEPRUNNING_REQUEST3_Active (0x1UL)   /*!< Keep SYSCOUNTER active                                               */


/* GRTC_TIMEOUT: Timeout after all CPUs gone into sleep state to stop the SYSCOUNTER */
  #define GRTC_TIMEOUT_ResetValue (0x00000000UL)     /*!< Reset value of TIMEOUT register.                                     */

/* VALUE @Bits 0..15 : Number of 32Ki cycles */
  #define GRTC_TIMEOUT_VALUE_Pos (0UL)               /*!< Position of VALUE field.                                             */
  #define GRTC_TIMEOUT_VALUE_Msk (0xFFFFUL << GRTC_TIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE field.                            */


/* GRTC_INTERVAL: Count to add to CC[0] when the event EVENTS_COMPARE[0] triggers. */
  #define GRTC_INTERVAL_ResetValue (0x00000000UL)    /*!< Reset value of INTERVAL register.                                    */

