tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* MODE @Bit 0 : I2S mode */
  #define I2S_CONFIG_MODE_MODE_Pos (0UL)             /*!< Position of MODE field.                                              */
  #define I2S_CONFIG_MODE_MODE_Msk (0x1UL << I2S_CONFIG_MODE_MODE_Pos) /*!< Bit mask of MODE field.                            */
  #define I2S_CONFIG_MODE_MODE_Min (0x0UL)           /*!< Min enumerator value of MODE field.                                  */
  #define I2S_CONFIG_MODE_MODE_Max (0x1UL)           /*!< Max enumerator value of MODE field.                                  */
  #define I2S_CONFIG_MODE_MODE_Master (0x0UL)        /*!< Master mode. SCK and LRCK generated from internal master clcok (MCK)
                                                          and output on pins defined by PSEL.xxx.*/
  #define I2S_CONFIG_MODE_MODE_Slave (0x1UL)         /*!< Slave mode. SCK and LRCK generated by external master and received on
                                                          pins defined by PSEL.xxx*/


/* I2S_CONFIG_RXEN: Reception (RX) enable */
  #define I2S_CONFIG_RXEN_ResetValue (0x00000000UL)  /*!< Reset value of RXEN register.                                        */

/* RXEN @Bit 0 : Reception (RX) enable */
  #define I2S_CONFIG_RXEN_RXEN_Pos (0UL)             /*!< Position of RXEN field.                                              */
  #define I2S_CONFIG_RXEN_RXEN_Msk (0x1UL << I2S_CONFIG_RXEN_RXEN_Pos) /*!< Bit mask of RXEN field.                            */
  #define I2S_CONFIG_RXEN_RXEN_Min (0x0UL)           /*!< Min enumerator value of RXEN field.                                  */
  #define I2S_CONFIG_RXEN_RXEN_Max (0x1UL)           /*!< Max enumerator value of RXEN field.                                  */
  #define I2S_CONFIG_RXEN_RXEN_Disabled (0x0UL)      /*!< Reception disabled and now data will be written to the RXD.PTR
                                                          address.*/
  #define I2S_CONFIG_RXEN_RXEN_Enabled (0x1UL)       /*!< Reception enabled.                                                   */


/* I2S_CONFIG_TXEN: Transmission (TX) enable */
  #define I2S_CONFIG_TXEN_ResetValue (0x00000001UL)  /*!< Reset value of TXEN register.                                        */

/* TXEN @Bit 0 : Transmission (TX) enable */
  #define I2S_CONFIG_TXEN_TXEN_Pos (0UL)             /*!< Position of TXEN field.                                              */
  #define I2S_CONFIG_TXEN_TXEN_Msk (0x1UL << I2S_CONFIG_TXEN_TXEN_Pos) /*!< Bit mask of TXEN field.                            */
  #define I2S_CONFIG_TXEN_TXEN_Min (0x0UL)           /*!< Min enumerator value of TXEN field.                                  */
  #define I2S_CONFIG_TXEN_TXEN_Max (0x1UL)           /*!< Max enumerator value of TXEN field.                                  */
  #define I2S_CONFIG_TXEN_TXEN_Disabled (0x0UL)      /*!< Transmission disabled and now data will be read from the RXD.TXD
                                                          address.*/
  #define I2S_CONFIG_TXEN_TXEN_Enabled (0x1UL)       /*!< Transmission enabled.                                                */


/* I2S_CONFIG_MCKEN: Master clock generator enable */
  #define I2S_CONFIG_MCKEN_ResetValue (0x00000001UL) /*!< Reset value of MCKEN register.                                       */

/* MCKEN @Bit 0 : Master clock generator enable */
  #define I2S_CONFIG_MCKEN_MCKEN_Pos (0UL)           /*!< Position of MCKEN field.                                             */
  #define I2S_CONFIG_MCKEN_MCKEN_Msk (0x1UL << I2S_CONFIG_MCKEN_MCKEN_Pos) /*!< Bit mask of MCKEN field.                       */
  #define I2S_CONFIG_MCKEN_MCKEN_Min (0x0UL)         /*!< Min enumerator value of MCKEN field.                                 */
  #define I2S_CONFIG_MCKEN_MCKEN_Max (0x1UL)         /*!< Max enumerator value of MCKEN field.                                 */
  #define I2S_CONFIG_MCKEN_MCKEN_Disabled (0x0UL)    /*!< Master clock generator disabled and PSEL.MCK not connected(available
                                                          as GPIO).*/
  #define I2S_CONFIG_MCKEN_MCKEN_Enabled (0x1UL)     /*!< Master clock generator running and MCK output on PSEL.MCK.           */


/* I2S_CONFIG_MCKFREQ: I2S clock generator control */
  #define I2S_CONFIG_MCKFREQ_ResetValue (0x20000000UL) /*!< Reset value of MCKFREQ register.                                   */

/* MCKFREQ @Bits 0..31 : I2S MCK frequency configuration NOTE: Enumerations are deprecated, use MCKFREQ equation. NOTE: The 12
                         least significant bits of the register are ignored and shall be set to zero. */

  #define I2S_CONFIG_MCKFREQ_MCKFREQ_Pos (0UL)       /*!< Position of MCKFREQ field.                                           */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_Msk (0xFFFFFFFFUL << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos) /*!< Bit mask of MCKFREQ field.      */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_Min (0x20C0000UL) /*!< Min enumerator value of MCKFREQ field.                             */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_Max (0x80000000UL) /*!< Max enumerator value of MCKFREQ field.                            */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV2 (0x80000000UL) /*!< 32 MHz / 2 = 16.0 MHz Deprecated, use MCKFREQ equation.       */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV3 (0x50000000UL) /*!< 32 MHz / 3 = 10.6666667 MHz Deprecated, use MCKFREQ equation. */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV4 (0x40000000UL) /*!< 32 MHz / 4 = 8.0 MHz Deprecated, use MCKFREQ equation.        */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV5 (0x30000000UL) /*!< 32 MHz / 5 = 6.4 MHz Deprecated, use MCKFREQ equation.        */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV6 (0x28000000UL) /*!< 32 MHz / 6 = 5.3333333 MHz Deprecated, use MCKFREQ equation.  */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV8 (0x20000000UL) /*!< 32 MHz / 8 = 4.0 MHz Deprecated, use MCKFREQ equation.        */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV10 (0x18000000UL) /*!< 32 MHz / 10 = 3.2 MHz Deprecated, use MCKFREQ equation.      */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV11 (0x16000000UL) /*!< 32 MHz / 11 = 2.9090909 MHz Deprecated, use MCKFREQ equation.*/
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV15 (0x11000000UL) /*!< 32 MHz / 15 = 2.1333333 MHz Deprecated, use MCKFREQ equation.*/
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 (0x10000000UL) /*!< 32 MHz / 16 = 2.0 MHz Deprecated, use MCKFREQ equation.      */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV21 (0x0C000000UL) /*!< 32 MHz / 21 = 1.5238095 MHz Deprecated, use MCKFREQ equation.*/
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV23 (0x0B000000UL) /*!< 32 MHz / 23 = 1.3913043 MHz Deprecated, use MCKFREQ equation.*/
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV30 (0x08800000UL) /*!< 32 MHz / 30 = 1.0666667 MHz Deprecated, use MCKFREQ equation.*/
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV31 (0x08400000UL) /*!< 32 MHz / 31 = 1.0322581 MHz Deprecated, use MCKFREQ equation.*/
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV32 (0x08000000UL) /*!< 32 MHz / 32 = 1.0 MHz Deprecated, use MCKFREQ equation.      */
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV42 (0x06000000UL) /*!< 32 MHz / 42 = 0.7619048 MHz Deprecated, use MCKFREQ equation.*/
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV63 (0x04100000UL) /*!< 32 MHz / 63 = 0.5079365 MHz Deprecated, use MCKFREQ equation.*/
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV125 (0x020C0000UL) /*!< 32 MHz / 125 = 0.256 MHz Deprecated, use MCKFREQ equation.  */


