tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* MEM9 @Bit 9 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM9_Pos (9UL)           /*!< Position of MEM9 field.                                              */
  #define MEMCONF_POWER_RET_MEM9_Msk (0x1UL << MEMCONF_POWER_RET_MEM9_Pos) /*!< Bit mask of MEM9 field.                        */
  #define MEMCONF_POWER_RET_MEM9_Min (0x0UL)         /*!< Min enumerator value of MEM9 field.                                  */
  #define MEMCONF_POWER_RET_MEM9_Max (0x1UL)         /*!< Max enumerator value of MEM9 field.                                  */
  #define MEMCONF_POWER_RET_MEM9_Off (0x0UL)         /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM9_On (0x1UL)          /*!< Retention on                                                         */

/* MEM10 @Bit 10 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM10_Pos (10UL)         /*!< Position of MEM10 field.                                             */
  #define MEMCONF_POWER_RET_MEM10_Msk (0x1UL << MEMCONF_POWER_RET_MEM10_Pos) /*!< Bit mask of MEM10 field.                     */
  #define MEMCONF_POWER_RET_MEM10_Min (0x0UL)        /*!< Min enumerator value of MEM10 field.                                 */
  #define MEMCONF_POWER_RET_MEM10_Max (0x1UL)        /*!< Max enumerator value of MEM10 field.                                 */
  #define MEMCONF_POWER_RET_MEM10_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM10_On (0x1UL)         /*!< Retention on                                                         */

/* MEM11 @Bit 11 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM11_Pos (11UL)         /*!< Position of MEM11 field.                                             */
  #define MEMCONF_POWER_RET_MEM11_Msk (0x1UL << MEMCONF_POWER_RET_MEM11_Pos) /*!< Bit mask of MEM11 field.                     */
  #define MEMCONF_POWER_RET_MEM11_Min (0x0UL)        /*!< Min enumerator value of MEM11 field.                                 */
  #define MEMCONF_POWER_RET_MEM11_Max (0x1UL)        /*!< Max enumerator value of MEM11 field.                                 */
  #define MEMCONF_POWER_RET_MEM11_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM11_On (0x1UL)         /*!< Retention on                                                         */

/* MEM12 @Bit 12 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM12_Pos (12UL)         /*!< Position of MEM12 field.                                             */
  #define MEMCONF_POWER_RET_MEM12_Msk (0x1UL << MEMCONF_POWER_RET_MEM12_Pos) /*!< Bit mask of MEM12 field.                     */
  #define MEMCONF_POWER_RET_MEM12_Min (0x0UL)        /*!< Min enumerator value of MEM12 field.                                 */
  #define MEMCONF_POWER_RET_MEM12_Max (0x1UL)        /*!< Max enumerator value of MEM12 field.                                 */
  #define MEMCONF_POWER_RET_MEM12_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM12_On (0x1UL)         /*!< Retention on                                                         */

/* MEM13 @Bit 13 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM13_Pos (13UL)         /*!< Position of MEM13 field.                                             */
  #define MEMCONF_POWER_RET_MEM13_Msk (0x1UL << MEMCONF_POWER_RET_MEM13_Pos) /*!< Bit mask of MEM13 field.                     */
  #define MEMCONF_POWER_RET_MEM13_Min (0x0UL)        /*!< Min enumerator value of MEM13 field.                                 */
  #define MEMCONF_POWER_RET_MEM13_Max (0x1UL)        /*!< Max enumerator value of MEM13 field.                                 */
  #define MEMCONF_POWER_RET_MEM13_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM13_On (0x1UL)         /*!< Retention on                                                         */

/* MEM14 @Bit 14 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM14_Pos (14UL)         /*!< Position of MEM14 field.                                             */
  #define MEMCONF_POWER_RET_MEM14_Msk (0x1UL << MEMCONF_POWER_RET_MEM14_Pos) /*!< Bit mask of MEM14 field.                     */
  #define MEMCONF_POWER_RET_MEM14_Min (0x0UL)        /*!< Min enumerator value of MEM14 field.                                 */
  #define MEMCONF_POWER_RET_MEM14_Max (0x1UL)        /*!< Max enumerator value of MEM14 field.                                 */
  #define MEMCONF_POWER_RET_MEM14_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM14_On (0x1UL)         /*!< Retention on                                                         */

/* MEM15 @Bit 15 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM15_Pos (15UL)         /*!< Position of MEM15 field.                                             */
  #define MEMCONF_POWER_RET_MEM15_Msk (0x1UL << MEMCONF_POWER_RET_MEM15_Pos) /*!< Bit mask of MEM15 field.                     */
  #define MEMCONF_POWER_RET_MEM15_Min (0x0UL)        /*!< Min enumerator value of MEM15 field.                                 */
  #define MEMCONF_POWER_RET_MEM15_Max (0x1UL)        /*!< Max enumerator value of MEM15 field.                                 */
  #define MEMCONF_POWER_RET_MEM15_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM15_On (0x1UL)         /*!< Retention on                                                         */

/* MEM16 @Bit 16 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM16_Pos (16UL)         /*!< Position of MEM16 field.                                             */
  #define MEMCONF_POWER_RET_MEM16_Msk (0x1UL << MEMCONF_POWER_RET_MEM16_Pos) /*!< Bit mask of MEM16 field.                     */
  #define MEMCONF_POWER_RET_MEM16_Min (0x0UL)        /*!< Min enumerator value of MEM16 field.                                 */
  #define MEMCONF_POWER_RET_MEM16_Max (0x1UL)        /*!< Max enumerator value of MEM16 field.                                 */
  #define MEMCONF_POWER_RET_MEM16_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM16_On (0x1UL)         /*!< Retention on                                                         */

/* MEM17 @Bit 17 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM17_Pos (17UL)         /*!< Position of MEM17 field.                                             */
  #define MEMCONF_POWER_RET_MEM17_Msk (0x1UL << MEMCONF_POWER_RET_MEM17_Pos) /*!< Bit mask of MEM17 field.                     */
  #define MEMCONF_POWER_RET_MEM17_Min (0x0UL)        /*!< Min enumerator value of MEM17 field.                                 */
  #define MEMCONF_POWER_RET_MEM17_Max (0x1UL)        /*!< Max enumerator value of MEM17 field.                                 */
  #define MEMCONF_POWER_RET_MEM17_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM17_On (0x1UL)         /*!< Retention on                                                         */

/* MEM18 @Bit 18 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM18_Pos (18UL)         /*!< Position of MEM18 field.                                             */
  #define MEMCONF_POWER_RET_MEM18_Msk (0x1UL << MEMCONF_POWER_RET_MEM18_Pos) /*!< Bit mask of MEM18 field.                     */
  #define MEMCONF_POWER_RET_MEM18_Min (0x0UL)        /*!< Min enumerator value of MEM18 field.                                 */
  #define MEMCONF_POWER_RET_MEM18_Max (0x1UL)        /*!< Max enumerator value of MEM18 field.                                 */
  #define MEMCONF_POWER_RET_MEM18_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM18_On (0x1UL)         /*!< Retention on                                                         */

