tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* MEM19 @Bit 19 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM19_Pos (19UL)         /*!< Position of MEM19 field.                                             */
  #define MEMCONF_POWER_RET_MEM19_Msk (0x1UL << MEMCONF_POWER_RET_MEM19_Pos) /*!< Bit mask of MEM19 field.                     */
  #define MEMCONF_POWER_RET_MEM19_Min (0x0UL)        /*!< Min enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_RET_MEM19_Max (0x1UL)        /*!< Max enumerator value of MEM19 field.                                 */
  #define MEMCONF_POWER_RET_MEM19_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM19_On (0x1UL)         /*!< Retention on                                                         */

/* MEM20 @Bit 20 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM20_Pos (20UL)         /*!< Position of MEM20 field.                                             */
  #define MEMCONF_POWER_RET_MEM20_Msk (0x1UL << MEMCONF_POWER_RET_MEM20_Pos) /*!< Bit mask of MEM20 field.                     */
  #define MEMCONF_POWER_RET_MEM20_Min (0x0UL)        /*!< Min enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_RET_MEM20_Max (0x1UL)        /*!< Max enumerator value of MEM20 field.                                 */
  #define MEMCONF_POWER_RET_MEM20_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM20_On (0x1UL)         /*!< Retention on                                                         */

/* MEM21 @Bit 21 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM21_Pos (21UL)         /*!< Position of MEM21 field.                                             */
  #define MEMCONF_POWER_RET_MEM21_Msk (0x1UL << MEMCONF_POWER_RET_MEM21_Pos) /*!< Bit mask of MEM21 field.                     */
  #define MEMCONF_POWER_RET_MEM21_Min (0x0UL)        /*!< Min enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_RET_MEM21_Max (0x1UL)        /*!< Max enumerator value of MEM21 field.                                 */
  #define MEMCONF_POWER_RET_MEM21_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM21_On (0x1UL)         /*!< Retention on                                                         */

/* MEM22 @Bit 22 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM22_Pos (22UL)         /*!< Position of MEM22 field.                                             */
  #define MEMCONF_POWER_RET_MEM22_Msk (0x1UL << MEMCONF_POWER_RET_MEM22_Pos) /*!< Bit mask of MEM22 field.                     */
  #define MEMCONF_POWER_RET_MEM22_Min (0x0UL)        /*!< Min enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_RET_MEM22_Max (0x1UL)        /*!< Max enumerator value of MEM22 field.                                 */
  #define MEMCONF_POWER_RET_MEM22_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM22_On (0x1UL)         /*!< Retention on                                                         */

/* MEM23 @Bit 23 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM23_Pos (23UL)         /*!< Position of MEM23 field.                                             */
  #define MEMCONF_POWER_RET_MEM23_Msk (0x1UL << MEMCONF_POWER_RET_MEM23_Pos) /*!< Bit mask of MEM23 field.                     */
  #define MEMCONF_POWER_RET_MEM23_Min (0x0UL)        /*!< Min enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_RET_MEM23_Max (0x1UL)        /*!< Max enumerator value of MEM23 field.                                 */
  #define MEMCONF_POWER_RET_MEM23_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM23_On (0x1UL)         /*!< Retention on                                                         */

/* MEM24 @Bit 24 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM24_Pos (24UL)         /*!< Position of MEM24 field.                                             */
  #define MEMCONF_POWER_RET_MEM24_Msk (0x1UL << MEMCONF_POWER_RET_MEM24_Pos) /*!< Bit mask of MEM24 field.                     */
  #define MEMCONF_POWER_RET_MEM24_Min (0x0UL)        /*!< Min enumerator value of MEM24 field.                                 */
  #define MEMCONF_POWER_RET_MEM24_Max (0x1UL)        /*!< Max enumerator value of MEM24 field.                                 */
  #define MEMCONF_POWER_RET_MEM24_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM24_On (0x1UL)         /*!< Retention on                                                         */

/* MEM25 @Bit 25 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM25_Pos (25UL)         /*!< Position of MEM25 field.                                             */
  #define MEMCONF_POWER_RET_MEM25_Msk (0x1UL << MEMCONF_POWER_RET_MEM25_Pos) /*!< Bit mask of MEM25 field.                     */
  #define MEMCONF_POWER_RET_MEM25_Min (0x0UL)        /*!< Min enumerator value of MEM25 field.                                 */
  #define MEMCONF_POWER_RET_MEM25_Max (0x1UL)        /*!< Max enumerator value of MEM25 field.                                 */
  #define MEMCONF_POWER_RET_MEM25_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM25_On (0x1UL)         /*!< Retention on                                                         */

/* MEM26 @Bit 26 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM26_Pos (26UL)         /*!< Position of MEM26 field.                                             */
  #define MEMCONF_POWER_RET_MEM26_Msk (0x1UL << MEMCONF_POWER_RET_MEM26_Pos) /*!< Bit mask of MEM26 field.                     */
  #define MEMCONF_POWER_RET_MEM26_Min (0x0UL)        /*!< Min enumerator value of MEM26 field.                                 */
  #define MEMCONF_POWER_RET_MEM26_Max (0x1UL)        /*!< Max enumerator value of MEM26 field.                                 */
  #define MEMCONF_POWER_RET_MEM26_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM26_On (0x1UL)         /*!< Retention on                                                         */

/* MEM27 @Bit 27 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM27_Pos (27UL)         /*!< Position of MEM27 field.                                             */
  #define MEMCONF_POWER_RET_MEM27_Msk (0x1UL << MEMCONF_POWER_RET_MEM27_Pos) /*!< Bit mask of MEM27 field.                     */
  #define MEMCONF_POWER_RET_MEM27_Min (0x0UL)        /*!< Min enumerator value of MEM27 field.                                 */
  #define MEMCONF_POWER_RET_MEM27_Max (0x1UL)        /*!< Max enumerator value of MEM27 field.                                 */
  #define MEMCONF_POWER_RET_MEM27_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM27_On (0x1UL)         /*!< Retention on                                                         */

