tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* MEM28 @Bit 28 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM28_Pos (28UL)         /*!< Position of MEM28 field.                                             */
  #define MEMCONF_POWER_RET_MEM28_Msk (0x1UL << MEMCONF_POWER_RET_MEM28_Pos) /*!< Bit mask of MEM28 field.                     */
  #define MEMCONF_POWER_RET_MEM28_Min (0x0UL)        /*!< Min enumerator value of MEM28 field.                                 */
  #define MEMCONF_POWER_RET_MEM28_Max (0x1UL)        /*!< Max enumerator value of MEM28 field.                                 */
  #define MEMCONF_POWER_RET_MEM28_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM28_On (0x1UL)         /*!< Retention on                                                         */

/* MEM29 @Bit 29 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM29_Pos (29UL)         /*!< Position of MEM29 field.                                             */
  #define MEMCONF_POWER_RET_MEM29_Msk (0x1UL << MEMCONF_POWER_RET_MEM29_Pos) /*!< Bit mask of MEM29 field.                     */
  #define MEMCONF_POWER_RET_MEM29_Min (0x0UL)        /*!< Min enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_RET_MEM29_Max (0x1UL)        /*!< Max enumerator value of MEM29 field.                                 */
  #define MEMCONF_POWER_RET_MEM29_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM29_On (0x1UL)         /*!< Retention on                                                         */

/* MEM30 @Bit 30 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM30_Pos (30UL)         /*!< Position of MEM30 field.                                             */
  #define MEMCONF_POWER_RET_MEM30_Msk (0x1UL << MEMCONF_POWER_RET_MEM30_Pos) /*!< Bit mask of MEM30 field.                     */
  #define MEMCONF_POWER_RET_MEM30_Min (0x0UL)        /*!< Min enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_RET_MEM30_Max (0x1UL)        /*!< Max enumerator value of MEM30 field.                                 */
  #define MEMCONF_POWER_RET_MEM30_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM30_On (0x1UL)         /*!< Retention on                                                         */

/* MEM31 @Bit 31 : (unspecified) */
  #define MEMCONF_POWER_RET_MEM31_Pos (31UL)         /*!< Position of MEM31 field.                                             */
  #define MEMCONF_POWER_RET_MEM31_Msk (0x1UL << MEMCONF_POWER_RET_MEM31_Pos) /*!< Bit mask of MEM31 field.                     */
  #define MEMCONF_POWER_RET_MEM31_Min (0x0UL)        /*!< Min enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_RET_MEM31_Max (0x1UL)        /*!< Max enumerator value of MEM31 field.                                 */
  #define MEMCONF_POWER_RET_MEM31_Off (0x0UL)        /*!< Retention off                                                        */
  #define MEMCONF_POWER_RET_MEM31_On (0x1UL)         /*!< Retention on                                                         */



/* ================================================ Struct MEMCONF_BLOCKTYPE ================================================= */
/**
  * @brief BLOCKTYPE [MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TRIM;                              /*!< (@ 0x00000000) Trim configuration for the memory block types.        */
} NRF_MEMCONF_BLOCKTYPE_Type;                        /*!< Size = 4 (0x004)                                                     */
  #define MEMCONF_BLOCKTYPE_MaxCount (2UL)           /*!< Size of BLOCKTYPE[2] array.                                          */
  #define MEMCONF_BLOCKTYPE_MaxIndex (1UL)           /*!< Max index of BLOCKTYPE[2] array.                                     */
  #define MEMCONF_BLOCKTYPE_MinIndex (0UL)           /*!< Min index of BLOCKTYPE[2] array.                                     */

/* MEMCONF_BLOCKTYPE_TRIM: Trim configuration for the memory block types. */
  #define MEMCONF_BLOCKTYPE_TRIM_ResetValue (0x00000000UL) /*!< Reset value of TRIM register.                                  */

/* MEMTRIM0 @Bit 0 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Pos (0UL)  /*!< Position of MEMTRIM0 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Pos) /*!< Bit mask of MEMTRIM0 field.  */

/* MEMTRIM1 @Bit 1 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Pos (1UL)  /*!< Position of MEMTRIM1 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Pos) /*!< Bit mask of MEMTRIM1 field.  */

/* MEMTRIM2 @Bit 2 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Pos (2UL)  /*!< Position of MEMTRIM2 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Pos) /*!< Bit mask of MEMTRIM2 field.  */

/* MEMTRIM3 @Bit 3 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Pos (3UL)  /*!< Position of MEMTRIM3 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Pos) /*!< Bit mask of MEMTRIM3 field.  */

/* MEMTRIM4 @Bit 4 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Pos (4UL)  /*!< Position of MEMTRIM4 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Pos) /*!< Bit mask of MEMTRIM4 field.  */

/* MEMTRIM5 @Bit 5 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Pos (5UL)  /*!< Position of MEMTRIM5 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Pos) /*!< Bit mask of MEMTRIM5 field.  */

/* MEMTRIM6 @Bit 6 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Pos (6UL)  /*!< Position of MEMTRIM6 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Pos) /*!< Bit mask of MEMTRIM6 field.  */

