tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* MEMTRIM7 @Bit 7 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Pos (7UL)  /*!< Position of MEMTRIM7 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Pos) /*!< Bit mask of MEMTRIM7 field.  */

/* MEMTRIM8 @Bit 8 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Pos (8UL)  /*!< Position of MEMTRIM8 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Pos) /*!< Bit mask of MEMTRIM8 field.  */

/* MEMTRIM9 @Bit 9 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Pos (9UL)  /*!< Position of MEMTRIM9 field.                                          */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Pos) /*!< Bit mask of MEMTRIM9 field.  */

/* MEMTRIM10 @Bit 10 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Pos (10UL) /*!< Position of MEMTRIM10 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Pos) /*!< Bit mask of MEMTRIM10
                                                                            field.*/

/* MEMTRIM11 @Bit 11 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Pos (11UL) /*!< Position of MEMTRIM11 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Pos) /*!< Bit mask of MEMTRIM11
                                                                            field.*/

/* MEMTRIM12 @Bit 12 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Pos (12UL) /*!< Position of MEMTRIM12 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Pos) /*!< Bit mask of MEMTRIM12
                                                                            field.*/

/* MEMTRIM13 @Bit 13 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Pos (13UL) /*!< Position of MEMTRIM13 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Pos) /*!< Bit mask of MEMTRIM13
                                                                            field.*/

/* MEMTRIM14 @Bit 14 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Pos (14UL) /*!< Position of MEMTRIM14 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Pos) /*!< Bit mask of MEMTRIM14
                                                                            field.*/

/* MEMTRIM15 @Bit 15 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Pos (15UL) /*!< Position of MEMTRIM15 field.                                        */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Pos) /*!< Bit mask of MEMTRIM15
                                                                            field.*/

/* MEMRETTRIM0 @Bit 16 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Pos (16UL) /*!< Position of MEMRETTRIM0 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Pos) /*!< Bit mask of MEMRETTRIM0
                                                                            field.*/

/* MEMRETTRIM1 @Bit 17 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Pos (17UL) /*!< Position of MEMRETTRIM1 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Pos) /*!< Bit mask of MEMRETTRIM1
                                                                            field.*/

/* MEMRETTRIM2 @Bit 18 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Pos (18UL) /*!< Position of MEMRETTRIM2 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Pos) /*!< Bit mask of MEMRETTRIM2
                                                                            field.*/

/* MEMRETTRIM3 @Bit 19 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Pos (19UL) /*!< Position of MEMRETTRIM3 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Pos) /*!< Bit mask of MEMRETTRIM3
                                                                            field.*/

/* MEMRETTRIM4 @Bit 20 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Pos (20UL) /*!< Position of MEMRETTRIM4 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Pos) /*!< Bit mask of MEMRETTRIM4
                                                                            field.*/

/* MEMRETTRIM5 @Bit 21 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Pos (21UL) /*!< Position of MEMRETTRIM5 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Pos) /*!< Bit mask of MEMRETTRIM5
                                                                            field.*/

/* MEMRETTRIM6 @Bit 22 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Pos (22UL) /*!< Position of MEMRETTRIM6 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Pos) /*!< Bit mask of MEMRETTRIM6
                                                                            field.*/

/* MEMRETTRIM7 @Bit 23 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Pos (23UL) /*!< Position of MEMRETTRIM7 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Pos) /*!< Bit mask of MEMRETTRIM7
                                                                            field.*/

/* MEMRETTRIM8 @Bit 24 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Pos (24UL) /*!< Position of MEMRETTRIM8 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Pos) /*!< Bit mask of MEMRETTRIM8
                                                                            field.*/

/* MEMRETTRIM9 @Bit 25 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Pos (25UL) /*!< Position of MEMRETTRIM9 field.                                    */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Pos) /*!< Bit mask of MEMRETTRIM9
                                                                            field.*/

