tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* MEMRETTRIM10 @Bit 26 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Pos (26UL) /*!< Position of MEMRETTRIM10 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM10 field.*/

/* MEMRETTRIM11 @Bit 27 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Pos (27UL) /*!< Position of MEMRETTRIM11 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM11 field.*/

/* MEMRETTRIM12 @Bit 28 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Pos (28UL) /*!< Position of MEMRETTRIM12 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM12 field.*/

/* MEMRETTRIM13 @Bit 29 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Pos (29UL) /*!< Position of MEMRETTRIM13 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM13 field.*/

/* MEMRETTRIM14 @Bit 30 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Pos (30UL) /*!< Position of MEMRETTRIM14 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM14 field.*/

/* MEMRETTRIM15 @Bit 31 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Pos (31UL) /*!< Position of MEMRETTRIM15 field.                                  */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM15 field.*/


/* ===================================================== Struct MEMCONF ====================================================== */
/**
  * @brief Memory configuration
  */
  typedef struct {                                   /*!< MEMCONF Structure                                                    */
    __IM uint32_t RESERVED[320];
    __IOM NRF_MEMCONF_POWER_Type POWER[2];           /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED1[250];
    __IOM NRF_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[2];   /*!< (@ 0x00000900) (unspecified)                                         */
  } NRF_MEMCONF_Type;                                /*!< Size = 2312 (0x908)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            MPC                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct MPC_MEMACCERR =================================================== */
/**
  * @brief MEMACCERR [MPC_MEMACCERR] Memory Access Error status registers
  */
typedef struct {
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Target Address of Memory Access Error. Register content
                                                                         won't be changed as long as MEMACCERR event is active.*/
  __IM  uint32_t  INFO;                              /*!< (@ 0x00000004) Access information for the transaction that triggered a
                                                                         memory access error. Register content won't be changed
                                                                         as long as MEMACCERR event is active.*/
} NRF_MPC_MEMACCERR_Type;                            /*!< Size = 8 (0x008)                                                     */

/* MPC_MEMACCERR_ADDRESS: Target Address of Memory Access Error. Register content won't be changed as long as MEMACCERR event is
                           active. */

  #define MPC_MEMACCERR_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                */

/* ADDRESS @Bits 0..31 : Target address for erroneous access */
  #define MPC_MEMACCERR_ADDRESS_ADDRESS_Pos (0UL)    /*!< Position of ADDRESS field.                                           */
  #define MPC_MEMACCERR_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MPC_MEMACCERR_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.*/


/* MPC_MEMACCERR_INFO: Access information for the transaction that triggered a memory access error. Register content won't be
                        changed as long as MEMACCERR event is active. */

  #define MPC_MEMACCERR_INFO_ResetValue (0x00000000UL) /*!< Reset value of INFO register.                                      */

