tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* CONNECTION2 @Bit 2 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Pos (2UL) /*!< Position of CONNECTION2 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Pos) /*!< Bit mask of
                                                                            CONNECTION2 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Min (0x0UL) /*!< Min enumerator value of CONNECTION2 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Max (0x1UL) /*!< Max enumerator value of CONNECTION2 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Disabled (0x0UL) /*!< Master port 2 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Enabled (0x1UL) /*!< Master port 2 connection to global slave is enabled      */

/* CONNECTION3 @Bit 3 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Pos (3UL) /*!< Position of CONNECTION3 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Pos) /*!< Bit mask of
                                                                            CONNECTION3 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Min (0x0UL) /*!< Min enumerator value of CONNECTION3 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Max (0x1UL) /*!< Max enumerator value of CONNECTION3 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Disabled (0x0UL) /*!< Master port 3 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Enabled (0x1UL) /*!< Master port 3 connection to global slave is enabled      */

/* CONNECTION4 @Bit 4 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Pos (4UL) /*!< Position of CONNECTION4 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Pos) /*!< Bit mask of
                                                                            CONNECTION4 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Min (0x0UL) /*!< Min enumerator value of CONNECTION4 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Max (0x1UL) /*!< Max enumerator value of CONNECTION4 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Disabled (0x0UL) /*!< Master port 4 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Enabled (0x1UL) /*!< Master port 4 connection to global slave is enabled      */

/* CONNECTION5 @Bit 5 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Pos (5UL) /*!< Position of CONNECTION5 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Pos) /*!< Bit mask of
                                                                            CONNECTION5 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Min (0x0UL) /*!< Min enumerator value of CONNECTION5 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Max (0x1UL) /*!< Max enumerator value of CONNECTION5 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Disabled (0x0UL) /*!< Master port 5 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Enabled (0x1UL) /*!< Master port 5 connection to global slave is enabled      */

/* CONNECTION6 @Bit 6 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Pos (6UL) /*!< Position of CONNECTION6 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Pos) /*!< Bit mask of
                                                                            CONNECTION6 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Min (0x0UL) /*!< Min enumerator value of CONNECTION6 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Max (0x1UL) /*!< Max enumerator value of CONNECTION6 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Disabled (0x0UL) /*!< Master port 6 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Enabled (0x1UL) /*!< Master port 6 connection to global slave is enabled      */

/* CONNECTION7 @Bit 7 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Pos (7UL) /*!< Position of CONNECTION7 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Pos) /*!< Bit mask of
                                                                            CONNECTION7 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Min (0x0UL) /*!< Min enumerator value of CONNECTION7 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Max (0x1UL) /*!< Max enumerator value of CONNECTION7 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Disabled (0x0UL) /*!< Master port 7 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Enabled (0x1UL) /*!< Master port 7 connection to global slave is enabled      */

/* CONNECTION8 @Bit 8 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Pos (8UL) /*!< Position of CONNECTION8 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Pos) /*!< Bit mask of
                                                                            CONNECTION8 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Min (0x0UL) /*!< Min enumerator value of CONNECTION8 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Max (0x1UL) /*!< Max enumerator value of CONNECTION8 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Disabled (0x0UL) /*!< Master port 8 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Enabled (0x1UL) /*!< Master port 8 connection to global slave is enabled      */

/* CONNECTION9 @Bit 9 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Pos (9UL) /*!< Position of CONNECTION9 field.                                 */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Pos) /*!< Bit mask of
                                                                            CONNECTION9 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Min (0x0UL) /*!< Min enumerator value of CONNECTION9 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Max (0x1UL) /*!< Max enumerator value of CONNECTION9 field.                   */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Disabled (0x0UL) /*!< Master port 9 connection to global slave is disabled    */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Enabled (0x1UL) /*!< Master port 9 connection to global slave is enabled      */

