tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* MPC_OVERRIDE_MASTERPORT: Override region n local master enable */
  #define MPC_OVERRIDE_MASTERPORT_ResetValue (0x00000000UL) /*!< Reset value of MASTERPORT register.                           */

/* ENABLE0 @Bit 0 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Pos (0UL)  /*!< Position of ENABLE0 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Min (0x0UL) /*!< Min enumerator value of ENABLE0 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Max (0x1UL) /*!< Max enumerator value of ENABLE0 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Disable (0x0UL) /*!< Override region n is disabled for master port 0                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Enable (0x1UL) /*!< Override region n is enabled for master port 0                   */

/* ENABLE1 @Bit 1 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Pos (1UL)  /*!< Position of ENABLE1 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Min (0x0UL) /*!< Min enumerator value of ENABLE1 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Max (0x1UL) /*!< Max enumerator value of ENABLE1 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Disable (0x0UL) /*!< Override region n is disabled for master port 1                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Enable (0x1UL) /*!< Override region n is enabled for master port 1                   */

/* ENABLE2 @Bit 2 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Pos (2UL)  /*!< Position of ENABLE2 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE2_Pos) /*!< Bit mask of ENABLE2 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Min (0x0UL) /*!< Min enumerator value of ENABLE2 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Max (0x1UL) /*!< Max enumerator value of ENABLE2 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Disable (0x0UL) /*!< Override region n is disabled for master port 2                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Enable (0x1UL) /*!< Override region n is enabled for master port 2                   */

/* ENABLE3 @Bit 3 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Pos (3UL)  /*!< Position of ENABLE3 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE3_Pos) /*!< Bit mask of ENABLE3 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Min (0x0UL) /*!< Min enumerator value of ENABLE3 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Max (0x1UL) /*!< Max enumerator value of ENABLE3 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Disable (0x0UL) /*!< Override region n is disabled for master port 3                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Enable (0x1UL) /*!< Override region n is enabled for master port 3                   */

/* ENABLE4 @Bit 4 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Pos (4UL)  /*!< Position of ENABLE4 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE4_Pos) /*!< Bit mask of ENABLE4 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Min (0x0UL) /*!< Min enumerator value of ENABLE4 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Max (0x1UL) /*!< Max enumerator value of ENABLE4 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Disable (0x0UL) /*!< Override region n is disabled for master port 4                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Enable (0x1UL) /*!< Override region n is enabled for master port 4                   */

/* ENABLE5 @Bit 5 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Pos (5UL)  /*!< Position of ENABLE5 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE5_Pos) /*!< Bit mask of ENABLE5 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Min (0x0UL) /*!< Min enumerator value of ENABLE5 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Max (0x1UL) /*!< Max enumerator value of ENABLE5 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Disable (0x0UL) /*!< Override region n is disabled for master port 5                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Enable (0x1UL) /*!< Override region n is enabled for master port 5                   */

/* ENABLE6 @Bit 6 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Pos (6UL)  /*!< Position of ENABLE6 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE6_Pos) /*!< Bit mask of ENABLE6 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Min (0x0UL) /*!< Min enumerator value of ENABLE6 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Max (0x1UL) /*!< Max enumerator value of ENABLE6 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Disable (0x0UL) /*!< Override region n is disabled for master port 6                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Enable (0x1UL) /*!< Override region n is enabled for master port 6                   */

/* ENABLE7 @Bit 7 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Pos (7UL)  /*!< Position of ENABLE7 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE7_Pos) /*!< Bit mask of ENABLE7 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Min (0x0UL) /*!< Min enumerator value of ENABLE7 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Max (0x1UL) /*!< Max enumerator value of ENABLE7 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Disable (0x0UL) /*!< Override region n is disabled for master port 7                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Enable (0x1UL) /*!< Override region n is enabled for master port 7                   */

/* ENABLE8 @Bit 8 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Pos (8UL)  /*!< Position of ENABLE8 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE8_Pos) /*!< Bit mask of ENABLE8 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Min (0x0UL) /*!< Min enumerator value of ENABLE8 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Max (0x1UL) /*!< Max enumerator value of ENABLE8 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Disable (0x0UL) /*!< Override region n is disabled for master port 8                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Enable (0x1UL) /*!< Override region n is enabled for master port 8                   */

/* ENABLE9 @Bit 9 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Pos (9UL)  /*!< Position of ENABLE9 field.                                           */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE9_Pos) /*!< Bit mask of ENABLE9 field.   */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Min (0x0UL) /*!< Min enumerator value of ENABLE9 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Max (0x1UL) /*!< Max enumerator value of ENABLE9 field.                              */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Disable (0x0UL) /*!< Override region n is disabled for master port 9                 */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Enable (0x1UL) /*!< Override region n is enabled for master port 9                   */

/* ENABLE10 @Bit 10 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Pos (10UL) /*!< Position of ENABLE10 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE10_Pos) /*!< Bit mask of ENABLE10 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Min (0x0UL) /*!< Min enumerator value of ENABLE10 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Max (0x1UL) /*!< Max enumerator value of ENABLE10 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Disable (0x0UL) /*!< Override region n is disabled for master port 10               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Enable (0x1UL) /*!< Override region n is enabled for master port 10                 */

/* ENABLE11 @Bit 11 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Pos (11UL) /*!< Position of ENABLE11 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE11_Pos) /*!< Bit mask of ENABLE11 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Min (0x0UL) /*!< Min enumerator value of ENABLE11 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Max (0x1UL) /*!< Max enumerator value of ENABLE11 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Disable (0x0UL) /*!< Override region n is disabled for master port 11               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Enable (0x1UL) /*!< Override region n is enabled for master port 11                 */

/* ENABLE12 @Bit 12 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Pos (12UL) /*!< Position of ENABLE12 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE12_Pos) /*!< Bit mask of ENABLE12 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Min (0x0UL) /*!< Min enumerator value of ENABLE12 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Max (0x1UL) /*!< Max enumerator value of ENABLE12 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Disable (0x0UL) /*!< Override region n is disabled for master port 12               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Enable (0x1UL) /*!< Override region n is enabled for master port 12                 */

/* ENABLE13 @Bit 13 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Pos (13UL) /*!< Position of ENABLE13 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE13_Pos) /*!< Bit mask of ENABLE13 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Min (0x0UL) /*!< Min enumerator value of ENABLE13 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Max (0x1UL) /*!< Max enumerator value of ENABLE13 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Disable (0x0UL) /*!< Override region n is disabled for master port 13               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Enable (0x1UL) /*!< Override region n is enabled for master port 13                 */

/* ENABLE14 @Bit 14 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Pos (14UL) /*!< Position of ENABLE14 field.                                         */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE14_Pos) /*!< Bit mask of ENABLE14 field.*/
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Min (0x0UL) /*!< Min enumerator value of ENABLE14 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Max (0x1UL) /*!< Max enumerator value of ENABLE14 field.                            */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Disable (0x0UL) /*!< Override region n is disabled for master port 14               */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Enable (0x1UL) /*!< Override region n is enabled for master port 14                 */


/* ======================================================= Struct MPC ======================================================== */
/**
  * @brief Memory Privilege Controller
  */
  typedef struct {                                   /*!< MPC Structure                                                        */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_MEMACCERR;                 /*!< (@ 0x00000100) Memory Access Error event                             */
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED2[61];
    __IOM NRF_MPC_MEMACCERR_Type MEMACCERR;          /*!< (@ 0x00000400) Memory Access Error status registers                  */
    __IM uint32_t RESERVED3[2];
    __IOM NRF_MPC_GLOBALSLAVE_Type GLOBALSLAVE;      /*!< (@ 0x00000410) Global slave master port connection information       */
    __IM uint32_t RESERVED4[122];
    __IOM NRF_MPC_REGION_Type REGION[8];             /*!< (@ 0x00000600) Memory region to slave decoding table                 */
    __IM uint32_t RESERVED5[96];
    __IOM NRF_MPC_OVERRIDE_Type OVERRIDE[7];         /*!< (@ 0x00000800) Special privilege tables                              */
  } NRF_MPC_Type;                                    /*!< Size = 2272 (0x8E0)                                                  */

/* MPC_EVENTS_MEMACCERR: Memory Access Error event */
  #define MPC_EVENTS_MEMACCERR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MEMACCERR register.                        */

/* EVENTS_MEMACCERR @Bit 0 : Memory Access Error event */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Pos (0UL) /*!< Position of EVENTS_MEMACCERR field.                             */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Msk (0x1UL << MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Pos) /*!< Bit mask of
                                                                            EVENTS_MEMACCERR field.*/
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Min (0x0UL) /*!< Min enumerator value of EVENTS_MEMACCERR field.               */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Max (0x1UL) /*!< Max enumerator value of EVENTS_MEMACCERR field.               */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Generated (0x1UL) /*!< Event generated                                         */


/* MPC_INTEN: Enable or disable interrupt */
  #define MPC_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* MEMACCERR @Bit 0 : Enable or disable interrupt for event MEMACCERR */
  #define MPC_INTEN_MEMACCERR_Pos (0UL)              /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTEN_MEMACCERR_Msk (0x1UL << MPC_INTEN_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                         */
  #define MPC_INTEN_MEMACCERR_Min (0x0UL)            /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTEN_MEMACCERR_Max (0x1UL)            /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTEN_MEMACCERR_Disabled (0x0UL)       /*!< Disable                                                              */
  #define MPC_INTEN_MEMACCERR_Enabled (0x1UL)        /*!< Enable                                                               */


/* MPC_INTENSET: Enable interrupt */
  #define MPC_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* MEMACCERR @Bit 0 : Write '1' to enable interrupt for event MEMACCERR */
  #define MPC_INTENSET_MEMACCERR_Pos (0UL)           /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTENSET_MEMACCERR_Msk (0x1UL << MPC_INTENSET_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                   */
  #define MPC_INTENSET_MEMACCERR_Min (0x0UL)         /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTENSET_MEMACCERR_Max (0x1UL)         /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTENSET_MEMACCERR_Set (0x1UL)         /*!< Enable                                                               */
  #define MPC_INTENSET_MEMACCERR_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MPC_INTENSET_MEMACCERR_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* MPC_INTENCLR: Disable interrupt */
  #define MPC_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* MEMACCERR @Bit 0 : Write '1' to disable interrupt for event MEMACCERR */
  #define MPC_INTENCLR_MEMACCERR_Pos (0UL)           /*!< Position of MEMACCERR field.                                         */
  #define MPC_INTENCLR_MEMACCERR_Msk (0x1UL << MPC_INTENCLR_MEMACCERR_Pos) /*!< Bit mask of MEMACCERR field.                   */
  #define MPC_INTENCLR_MEMACCERR_Min (0x0UL)         /*!< Min enumerator value of MEMACCERR field.                             */
  #define MPC_INTENCLR_MEMACCERR_Max (0x1UL)         /*!< Max enumerator value of MEMACCERR field.                             */
  #define MPC_INTENCLR_MEMACCERR_Clear (0x1UL)       /*!< Disable                                                              */
  #define MPC_INTENCLR_MEMACCERR_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define MPC_INTENCLR_MEMACCERR_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           NFCT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct NFCT_FRAMESTATUS ================================================= */
/**
  * @brief FRAMESTATUS [NFCT_FRAMESTATUS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RX;                                /*!< (@ 0x00000000) Result of last incoming frame                         */
} NRF_NFCT_FRAMESTATUS_Type;                         /*!< Size = 4 (0x004)                                                     */

/* NFCT_FRAMESTATUS_RX: Result of last incoming frame */
  #define NFCT_FRAMESTATUS_RX_ResetValue (0x00000000UL) /*!< Reset value of RX register.                                       */

/* CRCERROR @Bit 0 : No valid end of frame (EoF) detected */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Pos (0UL)     /*!< Position of CRCERROR field.                                          */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Msk (0x1UL << NFCT_FRAMESTATUS_RX_CRCERROR_Pos) /*!< Bit mask of CRCERROR field.        */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Min (0x0UL)   /*!< Min enumerator value of CRCERROR field.                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_Max (0x1UL)   /*!< Max enumerator value of CRCERROR field.                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_CRCCorrect (0x0UL) /*!< Valid CRC detected                                              */
  #define NFCT_FRAMESTATUS_RX_CRCERROR_CRCError (0x1UL) /*!< CRC received does not match local check                           */

/* PARITYSTATUS @Bit 2 : Parity status of received frame */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Pos (2UL) /*!< Position of PARITYSTATUS field.                                      */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Msk (0x1UL << NFCT_FRAMESTATUS_RX_PARITYSTATUS_Pos) /*!< Bit mask of PARITYSTATUS
                                                                            field.*/
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Min (0x0UL) /*!< Min enumerator value of PARITYSTATUS field.                        */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_Max (0x1UL) /*!< Max enumerator value of PARITYSTATUS field.                        */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_ParityOK (0x0UL) /*!< Frame received with parity OK                                 */
  #define NFCT_FRAMESTATUS_RX_PARITYSTATUS_ParityError (0x1UL) /*!< Frame received with parity error                           */

/* OVERRUN @Bit 3 : Overrun detected */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Pos (3UL)      /*!< Position of OVERRUN field.                                           */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Msk (0x1UL << NFCT_FRAMESTATUS_RX_OVERRUN_Pos) /*!< Bit mask of OVERRUN field.           */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Min (0x0UL)    /*!< Min enumerator value of OVERRUN field.                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Max (0x1UL)    /*!< Max enumerator value of OVERRUN field.                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_NoOverrun (0x0UL) /*!< No overrun detected                                               */
  #define NFCT_FRAMESTATUS_RX_OVERRUN_Overrun (0x1UL) /*!< Overrun error                                                       */



