tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* NFCT_SUBSCRIBE_GOSLEEP: Subscribe configuration for task GOSLEEP */
  #define NFCT_SUBSCRIBE_GOSLEEP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_GOSLEEP register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task GOSLEEP will subscribe to */
  #define NFCT_SUBSCRIBE_GOSLEEP_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define NFCT_SUBSCRIBE_GOSLEEP_CHIDX_Msk (0xFFUL << NFCT_SUBSCRIBE_GOSLEEP_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define NFCT_SUBSCRIBE_GOSLEEP_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define NFCT_SUBSCRIBE_GOSLEEP_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define NFCT_SUBSCRIBE_GOSLEEP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define NFCT_SUBSCRIBE_GOSLEEP_EN_Msk (0x1UL << NFCT_SUBSCRIBE_GOSLEEP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define NFCT_SUBSCRIBE_GOSLEEP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_GOSLEEP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define NFCT_SUBSCRIBE_GOSLEEP_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define NFCT_SUBSCRIBE_GOSLEEP_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* NFCT_EVENTS_READY: The NFCT peripheral is ready to receive and send frames */
  #define NFCT_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                               */

/* EVENTS_READY @Bit 0 : The NFCT peripheral is ready to receive and send frames */
  #define NFCT_EVENTS_READY_EVENTS_READY_Pos (0UL)   /*!< Position of EVENTS_READY field.                                      */
  #define NFCT_EVENTS_READY_EVENTS_READY_Msk (0x1UL << NFCT_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY field.*/
  #define NFCT_EVENTS_READY_EVENTS_READY_Min (0x0UL) /*!< Min enumerator value of EVENTS_READY field.                          */
  #define NFCT_EVENTS_READY_EVENTS_READY_Max (0x1UL) /*!< Max enumerator value of EVENTS_READY field.                          */
  #define NFCT_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define NFCT_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                                */


/* NFCT_EVENTS_FIELDDETECTED: Remote NFC field detected */
  #define NFCT_EVENTS_FIELDDETECTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FIELDDETECTED register.               */

/* EVENTS_FIELDDETECTED @Bit 0 : Remote NFC field detected */
  #define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_Pos (0UL) /*!< Position of EVENTS_FIELDDETECTED field.                */
  #define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_Msk (0x1UL << NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_Pos) /*!<
                                                                            Bit mask of EVENTS_FIELDDETECTED field.*/
  #define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_FIELDDETECTED field.  */
  #define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_FIELDDETECTED field.  */
  #define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_NotGenerated (0x0UL) /*!< Event not generated                         */
  #define NFCT_EVENTS_FIELDDETECTED_EVENTS_FIELDDETECTED_Generated (0x1UL) /*!< Event generated                                */


/* NFCT_EVENTS_FIELDLOST: Remote NFC field lost */
  #define NFCT_EVENTS_FIELDLOST_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FIELDLOST register.                       */

/* EVENTS_FIELDLOST @Bit 0 : Remote NFC field lost */
  #define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_Pos (0UL) /*!< Position of EVENTS_FIELDLOST field.                            */
  #define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_Msk (0x1UL << NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_Pos) /*!< Bit mask of
                                                                            EVENTS_FIELDLOST field.*/
  #define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_Min (0x0UL) /*!< Min enumerator value of EVENTS_FIELDLOST field.              */
  #define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_Max (0x1UL) /*!< Max enumerator value of EVENTS_FIELDLOST field.              */
  #define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_NotGenerated (0x0UL) /*!< Event not generated                                 */
  #define NFCT_EVENTS_FIELDLOST_EVENTS_FIELDLOST_Generated (0x1UL) /*!< Event generated                                        */


/* NFCT_EVENTS_TXFRAMESTART: Marks the start of the first symbol of a transmitted frame */
  #define NFCT_EVENTS_TXFRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXFRAMESTART register.                 */

/* EVENTS_TXFRAMESTART @Bit 0 : Marks the start of the first symbol of a transmitted frame */
  #define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_Pos (0UL) /*!< Position of EVENTS_TXFRAMESTART field.                   */
  #define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_Msk (0x1UL << NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_Pos) /*!< Bit
                                                                            mask of EVENTS_TXFRAMESTART field.*/
  #define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXFRAMESTART field.     */
  #define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXFRAMESTART field.     */
  #define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_NotGenerated (0x0UL) /*!< Event not generated                           */
  #define NFCT_EVENTS_TXFRAMESTART_EVENTS_TXFRAMESTART_Generated (0x1UL) /*!< Event generated                                  */


