tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* ================================================= Struct OSCILLATORS_PLL ================================================== */
/**
  * @brief PLL [OSCILLATORS_PLL] Oscillator control
  */
typedef struct {
  __IOM uint32_t  FREQ;                              /*!< (@ 0x00000000) CPU frequency                                         */
  __IM  uint32_t  CURRENTFREQ;                       /*!< (@ 0x00000004) Current CPU frequency                                 */
  __IM  uint32_t  RESERVED[27];
} NRF_OSCILLATORS_PLL_Type;                          /*!< Size = 116 (0x074)                                                   */

/* OSCILLATORS_PLL_FREQ: CPU frequency */
  #define OSCILLATORS_PLL_FREQ_ResetValue (0x00000003UL) /*!< Reset value of FREQ register.                                    */

/* FREQ @Bits 0..1 : Select CPU speed */
  #define OSCILLATORS_PLL_FREQ_FREQ_Pos (0UL)        /*!< Position of FREQ field.                                              */
  #define OSCILLATORS_PLL_FREQ_FREQ_Msk (0x3UL << OSCILLATORS_PLL_FREQ_FREQ_Pos) /*!< Bit mask of FREQ field.                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_Min (0x1UL)      /*!< Min enumerator value of FREQ field.                                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_Max (0x3UL)      /*!< Max enumerator value of FREQ field.                                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK128M (0x1UL)   /*!< 128 MHz                                                              */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK64M (0x3UL)    /*!< 64 MHz                                                               */


/* OSCILLATORS_PLL_CURRENTFREQ: Current CPU frequency */
  #define OSCILLATORS_PLL_CURRENTFREQ_ResetValue (0x00000003UL) /*!< Reset value of CURRENTFREQ register.                      */

/* CURRENTFREQ @Bits 0..1 : Active CPU speed */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Pos (0UL) /*!< Position of CURRENTFREQ field.                                */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Msk (0x3UL << OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Pos) /*!< Bit mask of
                                                                            CURRENTFREQ field.*/
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Min (0x1UL) /*!< Min enumerator value of CURRENTFREQ field.                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Max (0x3UL) /*!< Max enumerator value of CURRENTFREQ field.                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK128M (0x1UL) /*!< 128 MHz                                                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK64M (0x3UL) /*!< 64 MHz                                                    */



/* =============================================== Struct OSCILLATORS_XOSC32KI =============================================== */
/**
  * @brief XOSC32KI [OSCILLATORS_XOSC32KI] 32 kHz oscillator control
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  INTCAP;                            /*!< (@ 0x00000004) Programmable capacitance of XL1 and XL2               */
  __IM  uint32_t  RESERVED1[8];
} NRF_OSCILLATORS_XOSC32KI_Type;                     /*!< Size = 40 (0x028)                                                    */

/* OSCILLATORS_XOSC32KI_INTCAP: Programmable capacitance of XL1 and XL2 */
  #define OSCILLATORS_XOSC32KI_INTCAP_ResetValue (0x00000000UL) /*!< Reset value of INTCAP register.                           */

/* VAL @Bits 0..5 : Crystal load capacitor as seen by the crystal across its terminals, including pin capacitance but excluding
                    PCB stray capacitance. */

  #define OSCILLATORS_XOSC32KI_INTCAP_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define OSCILLATORS_XOSC32KI_INTCAP_VAL_Msk (0x3FUL << OSCILLATORS_XOSC32KI_INTCAP_VAL_Pos) /*!< Bit mask of VAL field.      */


/* =================================================== Struct OSCILLATORS ==================================================== */
/**
  * @brief Oscillator control
  */
  typedef struct {                                   /*!< OSCILLATORS Structure                                                */
    __IM uint32_t RESERVED[448];
    __IOM NRF_OSCILLATORS_XOSC32M_Type XOSC32M;      /*!< (@ 0x00000700) 32 MHz oscillator control                             */
    __IM uint32_t RESERVED1[33];
    __IOM NRF_OSCILLATORS_PLL_Type PLL;              /*!< (@ 0x00000800) Oscillator control                                    */
    __IM uint32_t RESERVED2[35];
    __IOM NRF_OSCILLATORS_XOSC32KI_Type XOSC32KI;    /*!< (@ 0x00000900) 32 kHz oscillator control                             */
  } NRF_OSCILLATORS_Type;                            /*!< Size = 2344 (0x928)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           POWER                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct POWER ======================================================= */
/**
  * @brief Power control
  */
  typedef struct {                                   /*!< POWER Structure                                                      */
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_CONSTLAT;                    /*!< (@ 0x00000030) Enable Constant Latency mode                          */
    __OM uint32_t TASKS_LOWPWR;                      /*!< (@ 0x00000034) Enable Low-power mode (variable latency)              */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t SUBSCRIBE_CONSTLAT;               /*!< (@ 0x000000B0) Subscribe configuration for task CONSTLAT             */
    __IOM uint32_t SUBSCRIBE_LOWPWR;                 /*!< (@ 0x000000B4) Subscribe configuration for task LOWPWR               */
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t EVENTS_POFWARN;                   /*!< (@ 0x00000130) Power failure warning                                 */
    __IOM uint32_t EVENTS_SLEEPENTER;                /*!< (@ 0x00000134) CPU entered WFI/WFE sleep                             */
    __IOM uint32_t EVENTS_SLEEPEXIT;                 /*!< (@ 0x00000138) CPU exited WFI/WFE sleep                              */
    __IM uint32_t RESERVED3[29];
    __IOM uint32_t PUBLISH_POFWARN;                  /*!< (@ 0x000001B0) Publish configuration for event POFWARN               */
    __IOM uint32_t PUBLISH_SLEEPENTER;               /*!< (@ 0x000001B4) Publish configuration for event SLEEPENTER            */
    __IOM uint32_t PUBLISH_SLEEPEXIT;                /*!< (@ 0x000001B8) Publish configuration for event SLEEPEXIT             */
    __IM uint32_t RESERVED4[81];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED5[125];
    __IOM uint32_t GPREGRET[2];                      /*!< (@ 0x00000500) General purpose retention register                    */
  } NRF_POWER_Type;                                  /*!< Size = 1288 (0x508)                                                  */

/* POWER_TASKS_CONSTLAT: Enable Constant Latency mode */
  #define POWER_TASKS_CONSTLAT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CONSTLAT register.                          */

/* TASKS_CONSTLAT @Bit 0 : Enable Constant Latency mode */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos (0UL) /*!< Position of TASKS_CONSTLAT field.                                 */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk (0x1UL << POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos) /*!< Bit mask of
                                                                            TASKS_CONSTLAT field.*/
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Min (0x1UL) /*!< Min enumerator value of TASKS_CONSTLAT field.                   */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Max (0x1UL) /*!< Max enumerator value of TASKS_CONSTLAT field.                   */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger (0x1UL) /*!< Trigger task                                                */


