tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* PWM_SHORTS: Shortcuts between local events and tasks */
  #define PWM_SHORTS_ResetValue (0x00000000UL)       /*!< Reset value of SHORTS register.                                      */

/* SEQEND0_STOP @Bit 0 : Shortcut between event SEQEND[n] and task STOP */
  #define PWM_SHORTS_SEQEND0_STOP_Pos (0UL)          /*!< Position of SEQEND0_STOP field.                                      */
  #define PWM_SHORTS_SEQEND0_STOP_Msk (0x1UL << PWM_SHORTS_SEQEND0_STOP_Pos) /*!< Bit mask of SEQEND0_STOP field.              */
  #define PWM_SHORTS_SEQEND0_STOP_Min (0x0UL)        /*!< Min enumerator value of SEQEND0_STOP field.                          */
  #define PWM_SHORTS_SEQEND0_STOP_Max (0x1UL)        /*!< Max enumerator value of SEQEND0_STOP field.                          */
  #define PWM_SHORTS_SEQEND0_STOP_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define PWM_SHORTS_SEQEND0_STOP_Enabled (0x1UL)    /*!< Enable shortcut                                                      */

/* SEQEND1_STOP @Bit 1 : Shortcut between event SEQEND[n] and task STOP */
  #define PWM_SHORTS_SEQEND1_STOP_Pos (1UL)          /*!< Position of SEQEND1_STOP field.                                      */
  #define PWM_SHORTS_SEQEND1_STOP_Msk (0x1UL << PWM_SHORTS_SEQEND1_STOP_Pos) /*!< Bit mask of SEQEND1_STOP field.              */
  #define PWM_SHORTS_SEQEND1_STOP_Min (0x0UL)        /*!< Min enumerator value of SEQEND1_STOP field.                          */
  #define PWM_SHORTS_SEQEND1_STOP_Max (0x1UL)        /*!< Max enumerator value of SEQEND1_STOP field.                          */
  #define PWM_SHORTS_SEQEND1_STOP_Disabled (0x0UL)   /*!< Disable shortcut                                                     */
  #define PWM_SHORTS_SEQEND1_STOP_Enabled (0x1UL)    /*!< Enable shortcut                                                      */

/* LOOPSDONE_STOP @Bit 4 : Shortcut between event LOOPSDONE and task STOP */
  #define PWM_SHORTS_LOOPSDONE_STOP_Pos (4UL)        /*!< Position of LOOPSDONE_STOP field.                                    */
  #define PWM_SHORTS_LOOPSDONE_STOP_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_STOP_Pos) /*!< Bit mask of LOOPSDONE_STOP field.        */
  #define PWM_SHORTS_LOOPSDONE_STOP_Min (0x0UL)      /*!< Min enumerator value of LOOPSDONE_STOP field.                        */
  #define PWM_SHORTS_LOOPSDONE_STOP_Max (0x1UL)      /*!< Max enumerator value of LOOPSDONE_STOP field.                        */
  #define PWM_SHORTS_LOOPSDONE_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define PWM_SHORTS_LOOPSDONE_STOP_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* RAMUNDERFLOW_STOP @Bit 5 : Shortcut between event RAMUNDERFLOW and task STOP */
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Pos (5UL)     /*!< Position of RAMUNDERFLOW_STOP field.                                 */
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Msk (0x1UL << PWM_SHORTS_RAMUNDERFLOW_STOP_Pos) /*!< Bit mask of RAMUNDERFLOW_STOP
                                                                            field.*/
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Min (0x0UL)   /*!< Min enumerator value of RAMUNDERFLOW_STOP field.                     */
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Max (0x1UL)   /*!< Max enumerator value of RAMUNDERFLOW_STOP field.                     */
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Disabled (0x0UL) /*!< Disable shortcut                                                  */
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Enabled (0x1UL) /*!< Enable shortcut                                                    */

/* DMA_SEQ0_BUSERROR_STOP @Bit 6 : Shortcut between event DMA.SEQ[n].BUSERROR and task STOP */
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Pos (6UL) /*!< Position of DMA_SEQ0_BUSERROR_STOP field.                           */
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Msk (0x1UL << PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Pos) /*!< Bit mask of
                                                                            DMA_SEQ0_BUSERROR_STOP field.*/
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_SEQ0_BUSERROR_STOP field.             */
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_SEQ0_BUSERROR_STOP field.             */
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Disabled (0x0UL) /*!< Disable shortcut                                             */
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Enabled (0x1UL) /*!< Enable shortcut                                               */

/* DMA_SEQ1_BUSERROR_STOP @Bit 7 : Shortcut between event DMA.SEQ[n].BUSERROR and task STOP */
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Pos (7UL) /*!< Position of DMA_SEQ1_BUSERROR_STOP field.                           */
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Msk (0x1UL << PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Pos) /*!< Bit mask of
                                                                            DMA_SEQ1_BUSERROR_STOP field.*/
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Min (0x0UL) /*!< Min enumerator value of DMA_SEQ1_BUSERROR_STOP field.             */
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Max (0x1UL) /*!< Max enumerator value of DMA_SEQ1_BUSERROR_STOP field.             */
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Disabled (0x0UL) /*!< Disable shortcut                                             */
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Enabled (0x1UL) /*!< Enable shortcut                                               */


/* PWM_INTEN: Enable or disable interrupt */
  #define PWM_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define PWM_INTEN_STOPPED_Pos (1UL)                /*!< Position of STOPPED field.                                           */
  #define PWM_INTEN_STOPPED_Msk (0x1UL << PWM_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                               */
  #define PWM_INTEN_STOPPED_Min (0x0UL)              /*!< Min enumerator value of STOPPED field.                               */
  #define PWM_INTEN_STOPPED_Max (0x1UL)              /*!< Max enumerator value of STOPPED field.                               */
  #define PWM_INTEN_STOPPED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PWM_INTEN_STOPPED_Enabled (0x1UL)          /*!< Enable                                                               */

/* SEQSTARTED0 @Bit 2 : Enable or disable interrupt for event SEQSTARTED[0] */
  #define PWM_INTEN_SEQSTARTED0_Pos (2UL)            /*!< Position of SEQSTARTED0 field.                                       */
  #define PWM_INTEN_SEQSTARTED0_Msk (0x1UL << PWM_INTEN_SEQSTARTED0_Pos) /*!< Bit mask of SEQSTARTED0 field.                   */
  #define PWM_INTEN_SEQSTARTED0_Min (0x0UL)          /*!< Min enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTEN_SEQSTARTED0_Max (0x1UL)          /*!< Max enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTEN_SEQSTARTED0_Disabled (0x0UL)     /*!< Disable                                                              */
  #define PWM_INTEN_SEQSTARTED0_Enabled (0x1UL)      /*!< Enable                                                               */

/* SEQSTARTED1 @Bit 3 : Enable or disable interrupt for event SEQSTARTED[1] */
  #define PWM_INTEN_SEQSTARTED1_Pos (3UL)            /*!< Position of SEQSTARTED1 field.                                       */
  #define PWM_INTEN_SEQSTARTED1_Msk (0x1UL << PWM_INTEN_SEQSTARTED1_Pos) /*!< Bit mask of SEQSTARTED1 field.                   */
  #define PWM_INTEN_SEQSTARTED1_Min (0x0UL)          /*!< Min enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTEN_SEQSTARTED1_Max (0x1UL)          /*!< Max enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTEN_SEQSTARTED1_Disabled (0x0UL)     /*!< Disable                                                              */
  #define PWM_INTEN_SEQSTARTED1_Enabled (0x1UL)      /*!< Enable                                                               */

/* SEQEND0 @Bit 4 : Enable or disable interrupt for event SEQEND[0] */
  #define PWM_INTEN_SEQEND0_Pos (4UL)                /*!< Position of SEQEND0 field.                                           */
  #define PWM_INTEN_SEQEND0_Msk (0x1UL << PWM_INTEN_SEQEND0_Pos) /*!< Bit mask of SEQEND0 field.                               */
  #define PWM_INTEN_SEQEND0_Min (0x0UL)              /*!< Min enumerator value of SEQEND0 field.                               */
  #define PWM_INTEN_SEQEND0_Max (0x1UL)              /*!< Max enumerator value of SEQEND0 field.                               */
  #define PWM_INTEN_SEQEND0_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PWM_INTEN_SEQEND0_Enabled (0x1UL)          /*!< Enable                                                               */

