tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* SEQEND1 @Bit 5 : Enable or disable interrupt for event SEQEND[1] */
  #define PWM_INTEN_SEQEND1_Pos (5UL)                /*!< Position of SEQEND1 field.                                           */
  #define PWM_INTEN_SEQEND1_Msk (0x1UL << PWM_INTEN_SEQEND1_Pos) /*!< Bit mask of SEQEND1 field.                               */
  #define PWM_INTEN_SEQEND1_Min (0x0UL)              /*!< Min enumerator value of SEQEND1 field.                               */
  #define PWM_INTEN_SEQEND1_Max (0x1UL)              /*!< Max enumerator value of SEQEND1 field.                               */
  #define PWM_INTEN_SEQEND1_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PWM_INTEN_SEQEND1_Enabled (0x1UL)          /*!< Enable                                                               */

/* PWMPERIODEND @Bit 6 : Enable or disable interrupt for event PWMPERIODEND */
  #define PWM_INTEN_PWMPERIODEND_Pos (6UL)           /*!< Position of PWMPERIODEND field.                                      */
  #define PWM_INTEN_PWMPERIODEND_Msk (0x1UL << PWM_INTEN_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.                */
  #define PWM_INTEN_PWMPERIODEND_Min (0x0UL)         /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTEN_PWMPERIODEND_Max (0x1UL)         /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTEN_PWMPERIODEND_Disabled (0x0UL)    /*!< Disable                                                              */
  #define PWM_INTEN_PWMPERIODEND_Enabled (0x1UL)     /*!< Enable                                                               */

/* LOOPSDONE @Bit 7 : Enable or disable interrupt for event LOOPSDONE */
  #define PWM_INTEN_LOOPSDONE_Pos (7UL)              /*!< Position of LOOPSDONE field.                                         */
  #define PWM_INTEN_LOOPSDONE_Msk (0x1UL << PWM_INTEN_LOOPSDONE_Pos) /*!< Bit mask of LOOPSDONE field.                         */
  #define PWM_INTEN_LOOPSDONE_Min (0x0UL)            /*!< Min enumerator value of LOOPSDONE field.                             */
  #define PWM_INTEN_LOOPSDONE_Max (0x1UL)            /*!< Max enumerator value of LOOPSDONE field.                             */
  #define PWM_INTEN_LOOPSDONE_Disabled (0x0UL)       /*!< Disable                                                              */
  #define PWM_INTEN_LOOPSDONE_Enabled (0x1UL)        /*!< Enable                                                               */

/* RAMUNDERFLOW @Bit 8 : Enable or disable interrupt for event RAMUNDERFLOW */
  #define PWM_INTEN_RAMUNDERFLOW_Pos (8UL)           /*!< Position of RAMUNDERFLOW field.                                      */
  #define PWM_INTEN_RAMUNDERFLOW_Msk (0x1UL << PWM_INTEN_RAMUNDERFLOW_Pos) /*!< Bit mask of RAMUNDERFLOW field.                */
  #define PWM_INTEN_RAMUNDERFLOW_Min (0x0UL)         /*!< Min enumerator value of RAMUNDERFLOW field.                          */
  #define PWM_INTEN_RAMUNDERFLOW_Max (0x1UL)         /*!< Max enumerator value of RAMUNDERFLOW field.                          */
  #define PWM_INTEN_RAMUNDERFLOW_Disabled (0x0UL)    /*!< Disable                                                              */
  #define PWM_INTEN_RAMUNDERFLOW_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMASEQ0END @Bit 9 : Enable or disable interrupt for event DMASEQ0END */
  #define PWM_INTEN_DMASEQ0END_Pos (9UL)             /*!< Position of DMASEQ0END field.                                        */
  #define PWM_INTEN_DMASEQ0END_Msk (0x1UL << PWM_INTEN_DMASEQ0END_Pos) /*!< Bit mask of DMASEQ0END field.                      */
  #define PWM_INTEN_DMASEQ0END_Min (0x0UL)           /*!< Min enumerator value of DMASEQ0END field.                            */
  #define PWM_INTEN_DMASEQ0END_Max (0x1UL)           /*!< Max enumerator value of DMASEQ0END field.                            */
  #define PWM_INTEN_DMASEQ0END_Disabled (0x0UL)      /*!< Disable                                                              */
  #define PWM_INTEN_DMASEQ0END_Enabled (0x1UL)       /*!< Enable                                                               */

/* DMASEQ0READY @Bit 10 : Enable or disable interrupt for event DMASEQ0READY */
  #define PWM_INTEN_DMASEQ0READY_Pos (10UL)          /*!< Position of DMASEQ0READY field.                                      */
  #define PWM_INTEN_DMASEQ0READY_Msk (0x1UL << PWM_INTEN_DMASEQ0READY_Pos) /*!< Bit mask of DMASEQ0READY field.                */
  #define PWM_INTEN_DMASEQ0READY_Min (0x0UL)         /*!< Min enumerator value of DMASEQ0READY field.                          */
  #define PWM_INTEN_DMASEQ0READY_Max (0x1UL)         /*!< Max enumerator value of DMASEQ0READY field.                          */
  #define PWM_INTEN_DMASEQ0READY_Disabled (0x0UL)    /*!< Disable                                                              */
  #define PWM_INTEN_DMASEQ0READY_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMASEQ0BUSERROR @Bit 11 : Enable or disable interrupt for event DMASEQ0BUSERROR */
  #define PWM_INTEN_DMASEQ0BUSERROR_Pos (11UL)       /*!< Position of DMASEQ0BUSERROR field.                                   */
  #define PWM_INTEN_DMASEQ0BUSERROR_Msk (0x1UL << PWM_INTEN_DMASEQ0BUSERROR_Pos) /*!< Bit mask of DMASEQ0BUSERROR field.       */
  #define PWM_INTEN_DMASEQ0BUSERROR_Min (0x0UL)      /*!< Min enumerator value of DMASEQ0BUSERROR field.                       */
  #define PWM_INTEN_DMASEQ0BUSERROR_Max (0x1UL)      /*!< Max enumerator value of DMASEQ0BUSERROR field.                       */
  #define PWM_INTEN_DMASEQ0BUSERROR_Disabled (0x0UL) /*!< Disable                                                              */
  #define PWM_INTEN_DMASEQ0BUSERROR_Enabled (0x1UL)  /*!< Enable                                                               */

/* DMASEQ1END @Bit 12 : Enable or disable interrupt for event DMASEQ1END */
  #define PWM_INTEN_DMASEQ1END_Pos (12UL)            /*!< Position of DMASEQ1END field.                                        */
  #define PWM_INTEN_DMASEQ1END_Msk (0x1UL << PWM_INTEN_DMASEQ1END_Pos) /*!< Bit mask of DMASEQ1END field.                      */
  #define PWM_INTEN_DMASEQ1END_Min (0x0UL)           /*!< Min enumerator value of DMASEQ1END field.                            */
  #define PWM_INTEN_DMASEQ1END_Max (0x1UL)           /*!< Max enumerator value of DMASEQ1END field.                            */
  #define PWM_INTEN_DMASEQ1END_Disabled (0x0UL)      /*!< Disable                                                              */
  #define PWM_INTEN_DMASEQ1END_Enabled (0x1UL)       /*!< Enable                                                               */

/* DMASEQ1READY @Bit 13 : Enable or disable interrupt for event DMASEQ1READY */
  #define PWM_INTEN_DMASEQ1READY_Pos (13UL)          /*!< Position of DMASEQ1READY field.                                      */
  #define PWM_INTEN_DMASEQ1READY_Msk (0x1UL << PWM_INTEN_DMASEQ1READY_Pos) /*!< Bit mask of DMASEQ1READY field.                */
  #define PWM_INTEN_DMASEQ1READY_Min (0x0UL)         /*!< Min enumerator value of DMASEQ1READY field.                          */
  #define PWM_INTEN_DMASEQ1READY_Max (0x1UL)         /*!< Max enumerator value of DMASEQ1READY field.                          */
  #define PWM_INTEN_DMASEQ1READY_Disabled (0x0UL)    /*!< Disable                                                              */
  #define PWM_INTEN_DMASEQ1READY_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMASEQ1BUSERROR @Bit 14 : Enable or disable interrupt for event DMASEQ1BUSERROR */
  #define PWM_INTEN_DMASEQ1BUSERROR_Pos (14UL)       /*!< Position of DMASEQ1BUSERROR field.                                   */
  #define PWM_INTEN_DMASEQ1BUSERROR_Msk (0x1UL << PWM_INTEN_DMASEQ1BUSERROR_Pos) /*!< Bit mask of DMASEQ1BUSERROR field.       */
  #define PWM_INTEN_DMASEQ1BUSERROR_Min (0x0UL)      /*!< Min enumerator value of DMASEQ1BUSERROR field.                       */
  #define PWM_INTEN_DMASEQ1BUSERROR_Max (0x1UL)      /*!< Max enumerator value of DMASEQ1BUSERROR field.                       */
  #define PWM_INTEN_DMASEQ1BUSERROR_Disabled (0x0UL) /*!< Disable                                                              */
  #define PWM_INTEN_DMASEQ1BUSERROR_Enabled (0x1UL)  /*!< Enable                                                               */

