tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* DMASEQ1BUSERROR @Bit 14 : Write '1' to disable interrupt for event DMASEQ1BUSERROR */
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Pos (14UL)    /*!< Position of DMASEQ1BUSERROR field.                                   */
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Msk (0x1UL << PWM_INTENCLR_DMASEQ1BUSERROR_Pos) /*!< Bit mask of DMASEQ1BUSERROR field. */
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Min (0x0UL)   /*!< Min enumerator value of DMASEQ1BUSERROR field.                       */
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Max (0x1UL)   /*!< Max enumerator value of DMASEQ1BUSERROR field.                       */
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Clear (0x1UL) /*!< Disable                                                              */
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* COMPAREMATCH0 @Bit 15 : Write '1' to disable interrupt for event COMPAREMATCH[0] */
  #define PWM_INTENCLR_COMPAREMATCH0_Pos (15UL)      /*!< Position of COMPAREMATCH0 field.                                     */
  #define PWM_INTENCLR_COMPAREMATCH0_Msk (0x1UL << PWM_INTENCLR_COMPAREMATCH0_Pos) /*!< Bit mask of COMPAREMATCH0 field.       */
  #define PWM_INTENCLR_COMPAREMATCH0_Min (0x0UL)     /*!< Min enumerator value of COMPAREMATCH0 field.                         */
  #define PWM_INTENCLR_COMPAREMATCH0_Max (0x1UL)     /*!< Max enumerator value of COMPAREMATCH0 field.                         */
  #define PWM_INTENCLR_COMPAREMATCH0_Clear (0x1UL)   /*!< Disable                                                              */
  #define PWM_INTENCLR_COMPAREMATCH0_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define PWM_INTENCLR_COMPAREMATCH0_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* COMPAREMATCH1 @Bit 16 : Write '1' to disable interrupt for event COMPAREMATCH[1] */
  #define PWM_INTENCLR_COMPAREMATCH1_Pos (16UL)      /*!< Position of COMPAREMATCH1 field.                                     */
  #define PWM_INTENCLR_COMPAREMATCH1_Msk (0x1UL << PWM_INTENCLR_COMPAREMATCH1_Pos) /*!< Bit mask of COMPAREMATCH1 field.       */
  #define PWM_INTENCLR_COMPAREMATCH1_Min (0x0UL)     /*!< Min enumerator value of COMPAREMATCH1 field.                         */
  #define PWM_INTENCLR_COMPAREMATCH1_Max (0x1UL)     /*!< Max enumerator value of COMPAREMATCH1 field.                         */
  #define PWM_INTENCLR_COMPAREMATCH1_Clear (0x1UL)   /*!< Disable                                                              */
  #define PWM_INTENCLR_COMPAREMATCH1_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define PWM_INTENCLR_COMPAREMATCH1_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* COMPAREMATCH2 @Bit 17 : Write '1' to disable interrupt for event COMPAREMATCH[2] */
  #define PWM_INTENCLR_COMPAREMATCH2_Pos (17UL)      /*!< Position of COMPAREMATCH2 field.                                     */
  #define PWM_INTENCLR_COMPAREMATCH2_Msk (0x1UL << PWM_INTENCLR_COMPAREMATCH2_Pos) /*!< Bit mask of COMPAREMATCH2 field.       */
  #define PWM_INTENCLR_COMPAREMATCH2_Min (0x0UL)     /*!< Min enumerator value of COMPAREMATCH2 field.                         */
  #define PWM_INTENCLR_COMPAREMATCH2_Max (0x1UL)     /*!< Max enumerator value of COMPAREMATCH2 field.                         */
  #define PWM_INTENCLR_COMPAREMATCH2_Clear (0x1UL)   /*!< Disable                                                              */
  #define PWM_INTENCLR_COMPAREMATCH2_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define PWM_INTENCLR_COMPAREMATCH2_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* COMPAREMATCH3 @Bit 18 : Write '1' to disable interrupt for event COMPAREMATCH[3] */
  #define PWM_INTENCLR_COMPAREMATCH3_Pos (18UL)      /*!< Position of COMPAREMATCH3 field.                                     */
  #define PWM_INTENCLR_COMPAREMATCH3_Msk (0x1UL << PWM_INTENCLR_COMPAREMATCH3_Pos) /*!< Bit mask of COMPAREMATCH3 field.       */
  #define PWM_INTENCLR_COMPAREMATCH3_Min (0x0UL)     /*!< Min enumerator value of COMPAREMATCH3 field.                         */
  #define PWM_INTENCLR_COMPAREMATCH3_Max (0x1UL)     /*!< Max enumerator value of COMPAREMATCH3 field.                         */
  #define PWM_INTENCLR_COMPAREMATCH3_Clear (0x1UL)   /*!< Disable                                                              */
  #define PWM_INTENCLR_COMPAREMATCH3_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define PWM_INTENCLR_COMPAREMATCH3_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* PWM_INTPEND: Pending interrupts */
  #define PWM_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* STOPPED @Bit 1 : Read pending status of interrupt for event STOPPED */
  #define PWM_INTPEND_STOPPED_Pos (1UL)              /*!< Position of STOPPED field.                                           */
  #define PWM_INTPEND_STOPPED_Msk (0x1UL << PWM_INTPEND_STOPPED_Pos) /*!< Bit mask of STOPPED field.                           */
  #define PWM_INTPEND_STOPPED_Min (0x0UL)            /*!< Min enumerator value of STOPPED field.                               */
  #define PWM_INTPEND_STOPPED_Max (0x1UL)            /*!< Max enumerator value of STOPPED field.                               */
  #define PWM_INTPEND_STOPPED_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define PWM_INTPEND_STOPPED_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* SEQSTARTED0 @Bit 2 : Read pending status of interrupt for event SEQSTARTED[0] */
  #define PWM_INTPEND_SEQSTARTED0_Pos (2UL)          /*!< Position of SEQSTARTED0 field.                                       */
  #define PWM_INTPEND_SEQSTARTED0_Msk (0x1UL << PWM_INTPEND_SEQSTARTED0_Pos) /*!< Bit mask of SEQSTARTED0 field.               */
  #define PWM_INTPEND_SEQSTARTED0_Min (0x0UL)        /*!< Min enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTPEND_SEQSTARTED0_Max (0x1UL)        /*!< Max enumerator value of SEQSTARTED0 field.                           */
  #define PWM_INTPEND_SEQSTARTED0_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define PWM_INTPEND_SEQSTARTED0_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SEQSTARTED1 @Bit 3 : Read pending status of interrupt for event SEQSTARTED[1] */
  #define PWM_INTPEND_SEQSTARTED1_Pos (3UL)          /*!< Position of SEQSTARTED1 field.                                       */
  #define PWM_INTPEND_SEQSTARTED1_Msk (0x1UL << PWM_INTPEND_SEQSTARTED1_Pos) /*!< Bit mask of SEQSTARTED1 field.               */
  #define PWM_INTPEND_SEQSTARTED1_Min (0x0UL)        /*!< Min enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTPEND_SEQSTARTED1_Max (0x1UL)        /*!< Max enumerator value of SEQSTARTED1 field.                           */
  #define PWM_INTPEND_SEQSTARTED1_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define PWM_INTPEND_SEQSTARTED1_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* SEQEND0 @Bit 4 : Read pending status of interrupt for event SEQEND[0] */
  #define PWM_INTPEND_SEQEND0_Pos (4UL)              /*!< Position of SEQEND0 field.                                           */
  #define PWM_INTPEND_SEQEND0_Msk (0x1UL << PWM_INTPEND_SEQEND0_Pos) /*!< Bit mask of SEQEND0 field.                           */
  #define PWM_INTPEND_SEQEND0_Min (0x0UL)            /*!< Min enumerator value of SEQEND0 field.                               */
  #define PWM_INTPEND_SEQEND0_Max (0x1UL)            /*!< Max enumerator value of SEQEND0 field.                               */
  #define PWM_INTPEND_SEQEND0_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define PWM_INTPEND_SEQEND0_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* SEQEND1 @Bit 5 : Read pending status of interrupt for event SEQEND[1] */
  #define PWM_INTPEND_SEQEND1_Pos (5UL)              /*!< Position of SEQEND1 field.                                           */
  #define PWM_INTPEND_SEQEND1_Msk (0x1UL << PWM_INTPEND_SEQEND1_Pos) /*!< Bit mask of SEQEND1 field.                           */
  #define PWM_INTPEND_SEQEND1_Min (0x0UL)            /*!< Min enumerator value of SEQEND1 field.                               */
  #define PWM_INTPEND_SEQEND1_Max (0x1UL)            /*!< Max enumerator value of SEQEND1 field.                               */
  #define PWM_INTPEND_SEQEND1_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define PWM_INTPEND_SEQEND1_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* PWMPERIODEND @Bit 6 : Read pending status of interrupt for event PWMPERIODEND */
  #define PWM_INTPEND_PWMPERIODEND_Pos (6UL)         /*!< Position of PWMPERIODEND field.                                      */
  #define PWM_INTPEND_PWMPERIODEND_Msk (0x1UL << PWM_INTPEND_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.            */
  #define PWM_INTPEND_PWMPERIODEND_Min (0x0UL)       /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTPEND_PWMPERIODEND_Max (0x1UL)       /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define PWM_INTPEND_PWMPERIODEND_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define PWM_INTPEND_PWMPERIODEND_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* LOOPSDONE @Bit 7 : Read pending status of interrupt for event LOOPSDONE */
  #define PWM_INTPEND_LOOPSDONE_Pos (7UL)            /*!< Position of LOOPSDONE field.                                         */
  #define PWM_INTPEND_LOOPSDONE_Msk (0x1UL << PWM_INTPEND_LOOPSDONE_Pos) /*!< Bit mask of LOOPSDONE field.                     */
  #define PWM_INTPEND_LOOPSDONE_Min (0x0UL)          /*!< Min enumerator value of LOOPSDONE field.                             */
  #define PWM_INTPEND_LOOPSDONE_Max (0x1UL)          /*!< Max enumerator value of LOOPSDONE field.                             */
  #define PWM_INTPEND_LOOPSDONE_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define PWM_INTPEND_LOOPSDONE_Pending (0x1UL)      /*!< Read: Pending                                                        */

