tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* COMPAREMATCH1 @Bit 16 : Read pending status of interrupt for event COMPAREMATCH[1] */
  #define PWM_INTPEND_COMPAREMATCH1_Pos (16UL)       /*!< Position of COMPAREMATCH1 field.                                     */
  #define PWM_INTPEND_COMPAREMATCH1_Msk (0x1UL << PWM_INTPEND_COMPAREMATCH1_Pos) /*!< Bit mask of COMPAREMATCH1 field.         */
  #define PWM_INTPEND_COMPAREMATCH1_Min (0x0UL)      /*!< Min enumerator value of COMPAREMATCH1 field.                         */
  #define PWM_INTPEND_COMPAREMATCH1_Max (0x1UL)      /*!< Max enumerator value of COMPAREMATCH1 field.                         */
  #define PWM_INTPEND_COMPAREMATCH1_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define PWM_INTPEND_COMPAREMATCH1_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* COMPAREMATCH2 @Bit 17 : Read pending status of interrupt for event COMPAREMATCH[2] */
  #define PWM_INTPEND_COMPAREMATCH2_Pos (17UL)       /*!< Position of COMPAREMATCH2 field.                                     */
  #define PWM_INTPEND_COMPAREMATCH2_Msk (0x1UL << PWM_INTPEND_COMPAREMATCH2_Pos) /*!< Bit mask of COMPAREMATCH2 field.         */
  #define PWM_INTPEND_COMPAREMATCH2_Min (0x0UL)      /*!< Min enumerator value of COMPAREMATCH2 field.                         */
  #define PWM_INTPEND_COMPAREMATCH2_Max (0x1UL)      /*!< Max enumerator value of COMPAREMATCH2 field.                         */
  #define PWM_INTPEND_COMPAREMATCH2_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define PWM_INTPEND_COMPAREMATCH2_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* COMPAREMATCH3 @Bit 18 : Read pending status of interrupt for event COMPAREMATCH[3] */
  #define PWM_INTPEND_COMPAREMATCH3_Pos (18UL)       /*!< Position of COMPAREMATCH3 field.                                     */
  #define PWM_INTPEND_COMPAREMATCH3_Msk (0x1UL << PWM_INTPEND_COMPAREMATCH3_Pos) /*!< Bit mask of COMPAREMATCH3 field.         */
  #define PWM_INTPEND_COMPAREMATCH3_Min (0x0UL)      /*!< Min enumerator value of COMPAREMATCH3 field.                         */
  #define PWM_INTPEND_COMPAREMATCH3_Max (0x1UL)      /*!< Max enumerator value of COMPAREMATCH3 field.                         */
  #define PWM_INTPEND_COMPAREMATCH3_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define PWM_INTPEND_COMPAREMATCH3_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* PWM_ENABLE: PWM module enable register */
  #define PWM_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : Enable or disable PWM module */
  #define PWM_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define PWM_ENABLE_ENABLE_Msk (0x1UL << PWM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define PWM_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define PWM_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define PWM_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disabled                                                             */
  #define PWM_ENABLE_ENABLE_Enabled (0x1UL)          /*!< Enable                                                               */


/* PWM_MODE: Selects operating mode of the wave counter */
  #define PWM_MODE_ResetValue (0x00000000UL)         /*!< Reset value of MODE register.                                        */

/* UPDOWN @Bit 0 : Selects up mode or up-and-down mode for the counter */
  #define PWM_MODE_UPDOWN_Pos (0UL)                  /*!< Position of UPDOWN field.                                            */
  #define PWM_MODE_UPDOWN_Msk (0x1UL << PWM_MODE_UPDOWN_Pos) /*!< Bit mask of UPDOWN field.                                    */
  #define PWM_MODE_UPDOWN_Min (0x0UL)                /*!< Min enumerator value of UPDOWN field.                                */
  #define PWM_MODE_UPDOWN_Max (0x1UL)                /*!< Max enumerator value of UPDOWN field.                                */
  #define PWM_MODE_UPDOWN_Up (0x0UL)                 /*!< Up counter, edge-aligned PWM duty cycle                              */
  #define PWM_MODE_UPDOWN_UpAndDown (0x1UL)          /*!< Up and down counter, center-aligned PWM duty cycle                   */


/* PWM_COUNTERTOP: Value up to which the pulse generator counter counts */
  #define PWM_COUNTERTOP_ResetValue (0x000003FFUL)   /*!< Reset value of COUNTERTOP register.                                  */

/* COUNTERTOP @Bits 0..14 : Value up to which the pulse generator counter counts. This register is ignored when
                            DECODER.MODE=WaveForm and only values from RAM are used. */

  #define PWM_COUNTERTOP_COUNTERTOP_Pos (0UL)        /*!< Position of COUNTERTOP field.                                        */
  #define PWM_COUNTERTOP_COUNTERTOP_Msk (0x7FFFUL << PWM_COUNTERTOP_COUNTERTOP_Pos) /*!< Bit mask of COUNTERTOP field.         */
  #define PWM_COUNTERTOP_COUNTERTOP_Min (0x0003UL)   /*!< Min value of COUNTERTOP field.                                       */
  #define PWM_COUNTERTOP_COUNTERTOP_Max (0x7FFFUL)   /*!< Max size of COUNTERTOP field.                                        */


/* PWM_PRESCALER: Configuration for PWM_CLK */
  #define PWM_PRESCALER_ResetValue (0x00000000UL)    /*!< Reset value of PRESCALER register.                                   */

/* PRESCALER @Bits 0..2 : Prescaler of PWM_CLK */
  #define PWM_PRESCALER_PRESCALER_Pos (0UL)          /*!< Position of PRESCALER field.                                         */
  #define PWM_PRESCALER_PRESCALER_Msk (0x7UL << PWM_PRESCALER_PRESCALER_Pos) /*!< Bit mask of PRESCALER field.                 */
  #define PWM_PRESCALER_PRESCALER_Min (0x0UL)        /*!< Min enumerator value of PRESCALER field.                             */
  #define PWM_PRESCALER_PRESCALER_Max (0x7UL)        /*!< Max enumerator value of PRESCALER field.                             */
  #define PWM_PRESCALER_PRESCALER_DIV_1 (0x0UL)      /*!< Divide by 1 (16 MHz)                                                 */
  #define PWM_PRESCALER_PRESCALER_DIV_2 (0x1UL)      /*!< Divide by 2 (8 MHz)                                                  */
  #define PWM_PRESCALER_PRESCALER_DIV_4 (0x2UL)      /*!< Divide by 4 (4 MHz)                                                  */
  #define PWM_PRESCALER_PRESCALER_DIV_8 (0x3UL)      /*!< Divide by 8 (2 MHz)                                                  */
  #define PWM_PRESCALER_PRESCALER_DIV_16 (0x4UL)     /*!< Divide by 16 (1 MHz)                                                 */
  #define PWM_PRESCALER_PRESCALER_DIV_32 (0x5UL)     /*!< Divide by 32 (500 kHz)                                               */
  #define PWM_PRESCALER_PRESCALER_DIV_64 (0x6UL)     /*!< Divide by 64 (250 kHz)                                               */
  #define PWM_PRESCALER_PRESCALER_DIV_128 (0x7UL)    /*!< Divide by 128 (125 kHz)                                              */


