tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* WHITEEN @Bit 25 : Enable or disable packet whitening */
  #define RADIO_PCNF1_WHITEEN_Pos (25UL)             /*!< Position of WHITEEN field.                                           */
  #define RADIO_PCNF1_WHITEEN_Msk (0x1UL << RADIO_PCNF1_WHITEEN_Pos) /*!< Bit mask of WHITEEN field.                           */
  #define RADIO_PCNF1_WHITEEN_Min (0x0UL)            /*!< Min enumerator value of WHITEEN field.                               */
  #define RADIO_PCNF1_WHITEEN_Max (0x1UL)            /*!< Max enumerator value of WHITEEN field.                               */
  #define RADIO_PCNF1_WHITEEN_Disabled (0x0UL)       /*!< Disable                                                              */
  #define RADIO_PCNF1_WHITEEN_Enabled (0x1UL)        /*!< Enable                                                               */


/* RADIO_BASE0: Base address 0 */
  #define RADIO_BASE0_ResetValue (0x00000000UL)      /*!< Reset value of BASE0 register.                                       */

/* BASE0 @Bits 0..31 : Base address 0 */
  #define RADIO_BASE0_BASE0_Pos (0UL)                /*!< Position of BASE0 field.                                             */
  #define RADIO_BASE0_BASE0_Msk (0xFFFFFFFFUL << RADIO_BASE0_BASE0_Pos) /*!< Bit mask of BASE0 field.                          */


/* RADIO_BASE1: Base address 1 */
  #define RADIO_BASE1_ResetValue (0x00000000UL)      /*!< Reset value of BASE1 register.                                       */

/* BASE1 @Bits 0..31 : Base address 1 */
  #define RADIO_BASE1_BASE1_Pos (0UL)                /*!< Position of BASE1 field.                                             */
  #define RADIO_BASE1_BASE1_Msk (0xFFFFFFFFUL << RADIO_BASE1_BASE1_Pos) /*!< Bit mask of BASE1 field.                          */


/* RADIO_PREFIX0: Prefixes bytes for logical addresses 0-3 */
  #define RADIO_PREFIX0_ResetValue (0x00000000UL)    /*!< Reset value of PREFIX0 register.                                     */

/* AP0 @Bits 0..7 : Address prefix 0 */
  #define RADIO_PREFIX0_AP0_Pos (0UL)                /*!< Position of AP0 field.                                               */
  #define RADIO_PREFIX0_AP0_Msk (0xFFUL << RADIO_PREFIX0_AP0_Pos) /*!< Bit mask of AP0 field.                                  */

/* AP1 @Bits 8..15 : Address prefix 1 */
  #define RADIO_PREFIX0_AP1_Pos (8UL)                /*!< Position of AP1 field.                                               */
  #define RADIO_PREFIX0_AP1_Msk (0xFFUL << RADIO_PREFIX0_AP1_Pos) /*!< Bit mask of AP1 field.                                  */

/* AP2 @Bits 16..23 : Address prefix 2 */
  #define RADIO_PREFIX0_AP2_Pos (16UL)               /*!< Position of AP2 field.                                               */
  #define RADIO_PREFIX0_AP2_Msk (0xFFUL << RADIO_PREFIX0_AP2_Pos) /*!< Bit mask of AP2 field.                                  */

/* AP3 @Bits 24..31 : Address prefix 3 */
  #define RADIO_PREFIX0_AP3_Pos (24UL)               /*!< Position of AP3 field.                                               */
  #define RADIO_PREFIX0_AP3_Msk (0xFFUL << RADIO_PREFIX0_AP3_Pos) /*!< Bit mask of AP3 field.                                  */


/* RADIO_PREFIX1: Prefixes bytes for logical addresses 4-7 */
  #define RADIO_PREFIX1_ResetValue (0x00000000UL)    /*!< Reset value of PREFIX1 register.                                     */

/* AP4 @Bits 0..7 : Address prefix 4 */
  #define RADIO_PREFIX1_AP4_Pos (0UL)                /*!< Position of AP4 field.                                               */
  #define RADIO_PREFIX1_AP4_Msk (0xFFUL << RADIO_PREFIX1_AP4_Pos) /*!< Bit mask of AP4 field.                                  */

/* AP5 @Bits 8..15 : Address prefix 5 */
  #define RADIO_PREFIX1_AP5_Pos (8UL)                /*!< Position of AP5 field.                                               */
  #define RADIO_PREFIX1_AP5_Msk (0xFFUL << RADIO_PREFIX1_AP5_Pos) /*!< Bit mask of AP5 field.                                  */

/* AP6 @Bits 16..23 : Address prefix 6 */
  #define RADIO_PREFIX1_AP6_Pos (16UL)               /*!< Position of AP6 field.                                               */
  #define RADIO_PREFIX1_AP6_Msk (0xFFUL << RADIO_PREFIX1_AP6_Pos) /*!< Bit mask of AP6 field.                                  */

/* AP7 @Bits 24..31 : Address prefix 7 */
  #define RADIO_PREFIX1_AP7_Pos (24UL)               /*!< Position of AP7 field.                                               */
  #define RADIO_PREFIX1_AP7_Msk (0xFFUL << RADIO_PREFIX1_AP7_Pos) /*!< Bit mask of AP7 field.                                  */


/* RADIO_TXADDRESS: Transmit address select */
  #define RADIO_TXADDRESS_ResetValue (0x00000000UL)  /*!< Reset value of TXADDRESS register.                                   */

/* TXADDRESS @Bits 0..2 : Transmit address select */
  #define RADIO_TXADDRESS_TXADDRESS_Pos (0UL)        /*!< Position of TXADDRESS field.                                         */
  #define RADIO_TXADDRESS_TXADDRESS_Msk (0x7UL << RADIO_TXADDRESS_TXADDRESS_Pos) /*!< Bit mask of TXADDRESS field.             */


/* RADIO_RXADDRESSES: Receive address select */
  #define RADIO_RXADDRESSES_ResetValue (0x00000000UL) /*!< Reset value of RXADDRESSES register.                                */

/* ADDR0 @Bit 0 : Enable or disable reception on logical address 0 */
  #define RADIO_RXADDRESSES_ADDR0_Pos (0UL)          /*!< Position of ADDR0 field.                                             */
  #define RADIO_RXADDRESSES_ADDR0_Msk (0x1UL << RADIO_RXADDRESSES_ADDR0_Pos) /*!< Bit mask of ADDR0 field.                     */
  #define RADIO_RXADDRESSES_ADDR0_Min (0x0UL)        /*!< Min enumerator value of ADDR0 field.                                 */
  #define RADIO_RXADDRESSES_ADDR0_Max (0x1UL)        /*!< Max enumerator value of ADDR0 field.                                 */
  #define RADIO_RXADDRESSES_ADDR0_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_RXADDRESSES_ADDR0_Enabled (0x1UL)    /*!< Enable                                                               */

/* ADDR1 @Bit 1 : Enable or disable reception on logical address 1 */
  #define RADIO_RXADDRESSES_ADDR1_Pos (1UL)          /*!< Position of ADDR1 field.                                             */
  #define RADIO_RXADDRESSES_ADDR1_Msk (0x1UL << RADIO_RXADDRESSES_ADDR1_Pos) /*!< Bit mask of ADDR1 field.                     */
  #define RADIO_RXADDRESSES_ADDR1_Min (0x0UL)        /*!< Min enumerator value of ADDR1 field.                                 */
  #define RADIO_RXADDRESSES_ADDR1_Max (0x1UL)        /*!< Max enumerator value of ADDR1 field.                                 */
  #define RADIO_RXADDRESSES_ADDR1_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_RXADDRESSES_ADDR1_Enabled (0x1UL)    /*!< Enable                                                               */

/* ADDR2 @Bit 2 : Enable or disable reception on logical address 2 */
  #define RADIO_RXADDRESSES_ADDR2_Pos (2UL)          /*!< Position of ADDR2 field.                                             */
  #define RADIO_RXADDRESSES_ADDR2_Msk (0x1UL << RADIO_RXADDRESSES_ADDR2_Pos) /*!< Bit mask of ADDR2 field.                     */
  #define RADIO_RXADDRESSES_ADDR2_Min (0x0UL)        /*!< Min enumerator value of ADDR2 field.                                 */
  #define RADIO_RXADDRESSES_ADDR2_Max (0x1UL)        /*!< Max enumerator value of ADDR2 field.                                 */
  #define RADIO_RXADDRESSES_ADDR2_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_RXADDRESSES_ADDR2_Enabled (0x1UL)    /*!< Enable                                                               */

/* ADDR3 @Bit 3 : Enable or disable reception on logical address 3 */
  #define RADIO_RXADDRESSES_ADDR3_Pos (3UL)          /*!< Position of ADDR3 field.                                             */
  #define RADIO_RXADDRESSES_ADDR3_Msk (0x1UL << RADIO_RXADDRESSES_ADDR3_Pos) /*!< Bit mask of ADDR3 field.                     */
  #define RADIO_RXADDRESSES_ADDR3_Min (0x0UL)        /*!< Min enumerator value of ADDR3 field.                                 */
  #define RADIO_RXADDRESSES_ADDR3_Max (0x1UL)        /*!< Max enumerator value of ADDR3 field.                                 */
  #define RADIO_RXADDRESSES_ADDR3_Disabled (0x0UL)   /*!< Disable                                                              */
  #define RADIO_RXADDRESSES_ADDR3_Enabled (0x1UL)    /*!< Enable                                                               */

