tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* CTEINLINERXMODE2US @Bits 13..15 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos (13UL) /*!< Position of CTEINLINERXMODE2US field.                         */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Msk (0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos) /*!< Bit mask of
                                                                            CTEINLINERXMODE2US field.*/
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Min (0x1UL) /*!< Min enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Max (0x6UL) /*!< Max enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_4us (0x1UL) /*!< 4us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_2us (0x2UL) /*!< 2us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_1us (0x3UL) /*!< 1us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_500ns (0x4UL) /*!< 0.5us                                                      */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_250ns (0x5UL) /*!< 0.25us                                                     */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_125ns (0x6UL) /*!< 0.125us                                                    */

/* S0CONF @Bits 16..23 : S0 bit pattern to match */
  #define RADIO_CTEINLINECONF_S0CONF_Pos (16UL)      /*!< Position of S0CONF field.                                            */
  #define RADIO_CTEINLINECONF_S0CONF_Msk (0xFFUL << RADIO_CTEINLINECONF_S0CONF_Pos) /*!< Bit mask of S0CONF field.             */

/* S0MASK @Bits 24..31 : S0 bit mask to set which bit to match */
  #define RADIO_CTEINLINECONF_S0MASK_Pos (24UL)      /*!< Position of S0MASK field.                                            */
  #define RADIO_CTEINLINECONF_S0MASK_Msk (0xFFUL << RADIO_CTEINLINECONF_S0MASK_Pos) /*!< Bit mask of S0MASK field.             */


/* RADIO_PACKETPTR: (unspecified) */
  #define RADIO_PACKETPTR_ResetValue (0x00000000UL)  /*!< Reset value of PACKETPTR register.                                   */

/* OFFSET @Bits 0..15 : (unspecified) */
  #define RADIO_PACKETPTR_OFFSET_Pos (0UL)           /*!< Position of OFFSET field.                                            */
  #define RADIO_PACKETPTR_OFFSET_Msk (0xFFFFUL << RADIO_PACKETPTR_OFFSET_Pos) /*!< Bit mask of OFFSET field.                   */

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_PACKETPTR_BASE_Pos (29UL)            /*!< Position of BASE field.                                              */
  #define RADIO_PACKETPTR_BASE_Msk (0x1UL << RADIO_PACKETPTR_BASE_Pos) /*!< Bit mask of BASE field.                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        REGULATORS                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct REGULATORS_VREGM ================================================= */
/**
  * @brief VREGM [REGULATORS_VREGM] Medium Voltage Regulator
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Enable register for VREGM                             */
  __IM  uint32_t  RESERVED[16];
} NRF_REGULATORS_VREGM_Type;                         /*!< Size = 68 (0x044)                                                    */

/* REGULATORS_VREGM_ENABLE: Enable register for VREGM */
  #define REGULATORS_VREGM_ENABLE_ResetValue (0x00000001UL) /*!< Reset value of ENABLE register.                               */

/* ENABLE @Bit 0 : Enable the regulator */
  #define REGULATORS_VREGM_ENABLE_ENABLE_Pos (0UL)   /*!< Position of ENABLE field.                                            */
  #define REGULATORS_VREGM_ENABLE_ENABLE_Msk (0x1UL << REGULATORS_VREGM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define REGULATORS_VREGM_ENABLE_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define REGULATORS_VREGM_ENABLE_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define REGULATORS_VREGM_ENABLE_ENABLE_Disabled (0x0UL) /*!< Disable the regulator                                           */
  #define REGULATORS_VREGM_ENABLE_ENABLE_Enabled (0x1UL) /*!< Enable the regulator                                             */



/* =============================================== Struct REGULATORS_VREGMAIN ================================================ */
/**
  * @brief VREGMAIN [REGULATORS_VREGMAIN] Main voltage regulator
  */
typedef struct {
  __IOM uint32_t  DCDCEN;                            /*!< (@ 0x00000000) Enable DC/DC converter for better power efficiency    */
  __IM  uint32_t  INDUCTORDET;                       /*!< (@ 0x00000004) VREGMAIN inductor detection                           */
  __IM  uint32_t  RESERVED[27];
} NRF_REGULATORS_VREGMAIN_Type;                      /*!< Size = 116 (0x074)                                                   */

/* REGULATORS_VREGMAIN_DCDCEN: Enable DC/DC converter for better power efficiency */
  #define REGULATORS_VREGMAIN_DCDCEN_ResetValue (0x00000000UL) /*!< Reset value of DCDCEN register.                            */

/* VAL @Bit 0 : Enable DC/DC converter */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Msk (0x1UL << REGULATORS_VREGMAIN_DCDCEN_VAL_Pos) /*!< Bit mask of VAL field.         */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Min (0x0UL) /*!< Min enumerator value of VAL field.                                   */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Max (0x1UL) /*!< Max enumerator value of VAL field.                                   */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Disabled (0x0UL) /*!< Disable DC/DC converter and use LDO                             */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Enabled (0x1UL) /*!< Enable DC/DC converter                                           */


/* REGULATORS_VREGMAIN_INDUCTORDET: VREGMAIN inductor detection */
  #define REGULATORS_VREGMAIN_INDUCTORDET_ResetValue (0x00000000UL) /*!< Reset value of INDUCTORDET register.                  */

/* DETECTED @Bit 0 : (unspecified) */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Pos (0UL) /*!< Position of DETECTED field.                                  */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Msk (0x1UL << REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Pos) /*!< Bit mask of
                                                                            DETECTED field.*/
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Min (0x0UL) /*!< Min enumerator value of DETECTED field.                    */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Max (0x1UL) /*!< Max enumerator value of DETECTED field.                    */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_InductorNotDetected (0x0UL) /*!< VREGMAIN inductor not detected             */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_InductorDetected (0x1UL) /*!< VREGMAIN inductor detected                    */


/* ==================================================== Struct REGULATORS ==================================================== */
/**
  * @brief Voltage regulators
  */
  typedef struct {                                   /*!< REGULATORS Structure                                                 */
    __IM uint32_t RESERVED[256];
    __IOM NRF_REGULATORS_VREGM_Type VREGM;           /*!< (@ 0x00000400) Medium Voltage Regulator                              */
    __IM uint32_t RESERVED1[47];
    __OM uint32_t SYSTEMOFF;                         /*!< (@ 0x00000500) System OFF register                                   */
    __IM uint32_t RESERVED2[11];
    __IOM uint32_t POFCON;                           /*!< (@ 0x00000530) Power-fail comparator configuration                   */
    __IM uint32_t POFSTAT;                           /*!< (@ 0x00000534) Power-fail comparator status register                 */
    __IM uint32_t RESERVED3[50];
    __IOM NRF_REGULATORS_VREGMAIN_Type VREGMAIN;     /*!< (@ 0x00000600) Main voltage regulator                                */
  } NRF_REGULATORS_Type;                             /*!< Size = 1652 (0x674)                                                  */

/* REGULATORS_SYSTEMOFF: System OFF register */
  #define REGULATORS_SYSTEMOFF_ResetValue (0x00000000UL) /*!< Reset value of SYSTEMOFF register.                               */

/* SYSTEMOFF @Bit 0 : Enable System OFF mode */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos (0UL)   /*!< Position of SYSTEMOFF field.                                         */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Msk (0x1UL << REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos) /*!< Bit mask of SYSTEMOFF field.   */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Min (0x1UL) /*!< Min enumerator value of SYSTEMOFF field.                             */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFF field.                             */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter (0x1UL) /*!< Enable System OFF mode                                             */


/* REGULATORS_POFCON: Power-fail comparator configuration */
  #define REGULATORS_POFCON_ResetValue (0x00000000UL) /*!< Reset value of POFCON register.                                     */

