tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* GRTC @Bit 11 : Reset due to wakeup from GRTC */
  #define RESET_RESETREAS_GRTC_Pos (11UL)            /*!< Position of GRTC field.                                              */
  #define RESET_RESETREAS_GRTC_Msk (0x1UL << RESET_RESETREAS_GRTC_Pos) /*!< Bit mask of GRTC field.                            */
  #define RESET_RESETREAS_GRTC_Min (0x0UL)           /*!< Min enumerator value of GRTC field.                                  */
  #define RESET_RESETREAS_GRTC_Max (0x1UL)           /*!< Max enumerator value of GRTC field.                                  */
  #define RESET_RESETREAS_GRTC_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_GRTC_Detected (0x1UL)      /*!< Detected                                                             */

/* NFC @Bit 12 : Reset after wakeup from System OFF mode due to NFC field being detected */
  #define RESET_RESETREAS_NFC_Pos (12UL)             /*!< Position of NFC field.                                               */
  #define RESET_RESETREAS_NFC_Msk (0x1UL << RESET_RESETREAS_NFC_Pos) /*!< Bit mask of NFC field.                               */
  #define RESET_RESETREAS_NFC_Min (0x0UL)            /*!< Min enumerator value of NFC field.                                   */
  #define RESET_RESETREAS_NFC_Max (0x1UL)            /*!< Max enumerator value of NFC field.                                   */
  #define RESET_RESETREAS_NFC_NotDetected (0x0UL)    /*!< Not detected                                                         */
  #define RESET_RESETREAS_NFC_Detected (0x1UL)       /*!< Detected                                                             */

/* SECTAMPER @Bit 13 : Reset due to illegal tampering of the device */
  #define RESET_RESETREAS_SECTAMPER_Pos (13UL)       /*!< Position of SECTAMPER field.                                         */
  #define RESET_RESETREAS_SECTAMPER_Msk (0x1UL << RESET_RESETREAS_SECTAMPER_Pos) /*!< Bit mask of SECTAMPER field.             */
  #define RESET_RESETREAS_SECTAMPER_Min (0x0UL)      /*!< Min enumerator value of SECTAMPER field.                             */
  #define RESET_RESETREAS_SECTAMPER_Max (0x1UL)      /*!< Max enumerator value of SECTAMPER field.                             */
  #define RESET_RESETREAS_SECTAMPER_NotDetected (0x0UL) /*!< Not detected                                                      */
  #define RESET_RESETREAS_SECTAMPER_Detected (0x1UL) /*!< Detected                                                             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RRAMC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct RRAMC_BUFSTATUS ================================================== */
/**
  * @brief BUFSTATUS [RRAMC_BUFSTATUS] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[2];
  __IM  uint32_t  WRITEBUFEMPTY;                     /*!< (@ 0x00000008) Internal write-buffer is empty                        */
} NRF_RRAMC_BUFSTATUS_Type;                          /*!< Size = 12 (0x00C)                                                    */

/* RRAMC_BUFSTATUS_WRITEBUFEMPTY: Internal write-buffer is empty */
  #define RRAMC_BUFSTATUS_WRITEBUFEMPTY_ResetValue (0x00000000UL) /*!< Reset value of WRITEBUFEMPTY register.                  */

/* EMPTY @Bit 0 : (unspecified) */
  #define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Pos (0UL) /*!< Position of EMPTY field.                                          */
  #define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Msk (0x1UL << RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Pos) /*!< Bit mask of EMPTY
                                                                            field.*/
  #define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Min (0x0UL) /*!< Min enumerator value of EMPTY field.                            */
  #define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Max (0x1UL) /*!< Max enumerator value of EMPTY field.                            */
  #define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_NotEmpty (0x0UL) /*!< The internal write-buffer has data that needs committing   */
  #define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Empty (0x1UL) /*!< The internal write-buffer is empty and has no content that
                                                                 needs to be committed*/



/* =================================================== Struct RRAMC_POWER ==================================================== */
/**
  * @brief POWER [RRAMC_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Power configuration                                   */
  __IM  uint32_t  RESERVED[8];
} NRF_RRAMC_POWER_Type;                              /*!< Size = 36 (0x024)                                                    */

/* RRAMC_POWER_CONFIG: Power configuration */
  #define RRAMC_POWER_CONFIG_ResetValue (0x00000100UL) /*!< Reset value of CONFIG register.                                    */

/* ACCESSTIMEOUT @Bits 0..15 : Access timeout, in 31.25 ns units, used for going into standby power mode or remain active on
                               wake up */

  #define RRAMC_POWER_CONFIG_ACCESSTIMEOUT_Pos (0UL) /*!< Position of ACCESSTIMEOUT field.                                     */
  #define RRAMC_POWER_CONFIG_ACCESSTIMEOUT_Msk (0xFFFFUL << RRAMC_POWER_CONFIG_ACCESSTIMEOUT_Pos) /*!< Bit mask of ACCESSTIMEOUT
                                                                            field.*/

/* POF @Bit 16 : Power on failure warning handling configuration */
  #define RRAMC_POWER_CONFIG_POF_Pos (16UL)          /*!< Position of POF field.                                               */
  #define RRAMC_POWER_CONFIG_POF_Msk (0x1UL << RRAMC_POWER_CONFIG_POF_Pos) /*!< Bit mask of POF field.                         */
  #define RRAMC_POWER_CONFIG_POF_Min (0x0UL)         /*!< Min enumerator value of POF field.                                   */
  #define RRAMC_POWER_CONFIG_POF_Max (0x1UL)         /*!< Max enumerator value of POF field.                                   */
  #define RRAMC_POWER_CONFIG_POF_Wait (0x0UL)        /*!< Wait until the current RRAM write finishes                           */
  #define RRAMC_POWER_CONFIG_POF_Abort (0x1UL)       /*!< Abort the current RRAM write                                         */



/* =================================================== Struct RRAMC_ERASE ==================================================== */
/**
  * @brief ERASE [RRAMC_ERASE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ERASEALL;                          /*!< (@ 0x00000000) Register for erasing whole RRAM main block, that
                                                                         includes the SICR and the UICR*/
  __IM  uint32_t  RESERVED;
} NRF_RRAMC_ERASE_Type;                              /*!< Size = 8 (0x008)                                                     */

/* RRAMC_ERASE_ERASEALL: Register for erasing whole RRAM main block, that includes the SICR and the UICR */
  #define RRAMC_ERASE_ERASEALL_ResetValue (0x00000000UL) /*!< Reset value of ERASEALL register.                                */

/* ERASE @Bit 0 : Erase whole RRAM main block */
  #define RRAMC_ERASE_ERASEALL_ERASE_Pos (0UL)       /*!< Position of ERASE field.                                             */
  #define RRAMC_ERASE_ERASEALL_ERASE_Msk (0x1UL << RRAMC_ERASE_ERASEALL_ERASE_Pos) /*!< Bit mask of ERASE field.               */
  #define RRAMC_ERASE_ERASEALL_ERASE_Min (0x0UL)     /*!< Min enumerator value of ERASE field.                                 */
  #define RRAMC_ERASE_ERASEALL_ERASE_Max (0x1UL)     /*!< Max enumerator value of ERASE field.                                 */
  #define RRAMC_ERASE_ERASEALL_ERASE_NoOperation (0x0UL) /*!< No operation                                                     */
  #define RRAMC_ERASE_ERASEALL_ERASE_Erase (0x1UL)   /*!< Start erase of chip                                                  */



/* =================================================== Struct RRAMC_REGION =================================================== */
/**
  * @brief REGION [RRAMC_REGION] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Region address                                        */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Region configuration                                  */
} NRF_RRAMC_REGION_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define RRAMC_REGION_MaxCount (5UL)                /*!< Size of REGION[5] array.                                             */
  #define RRAMC_REGION_MaxIndex (4UL)                /*!< Max index of REGION[5] array.                                        */
  #define RRAMC_REGION_MinIndex (0UL)                /*!< Min index of REGION[5] array.                                        */

/* RRAMC_REGION_ADDRESS: Region address */
  #define RRAMC_REGION_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                 */

