tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* RRAMC_ACCESSERRORADDR: Address of the first access error */
  #define RRAMC_ACCESSERRORADDR_ResetValue (0x00FFFFFFUL) /*!< Reset value of ACCESSERRORADDR register.                        */

/* ADDRESS @Bits 0..31 : Access error address */
  #define RRAMC_ACCESSERRORADDR_ADDRESS_Pos (0UL)    /*!< Position of ADDRESS field.                                           */
  #define RRAMC_ACCESSERRORADDR_ADDRESS_Msk (0xFFFFFFFFUL << RRAMC_ACCESSERRORADDR_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.*/


/* RRAMC_CONFIG: Configuration register */
  #define RRAMC_CONFIG_ResetValue (0x00000000UL)     /*!< Reset value of CONFIG register.                                      */

/* WEN @Bit 0 : Write enable */
  #define RRAMC_CONFIG_WEN_Pos (0UL)                 /*!< Position of WEN field.                                               */
  #define RRAMC_CONFIG_WEN_Msk (0x1UL << RRAMC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field.                                     */
  #define RRAMC_CONFIG_WEN_Min (0x0UL)               /*!< Min enumerator value of WEN field.                                   */
  #define RRAMC_CONFIG_WEN_Max (0x1UL)               /*!< Max enumerator value of WEN field.                                   */
  #define RRAMC_CONFIG_WEN_Disabled (0x0UL)          /*!< Write is disabled                                                    */
  #define RRAMC_CONFIG_WEN_Enabled (0x1UL)           /*!< Write is enabled                                                     */

/* WRITEBUFSIZE @Bits 8..13 : write-buffer size in number of 128-bit words */
  #define RRAMC_CONFIG_WRITEBUFSIZE_Pos (8UL)        /*!< Position of WRITEBUFSIZE field.                                      */
  #define RRAMC_CONFIG_WRITEBUFSIZE_Msk (0x3FUL << RRAMC_CONFIG_WRITEBUFSIZE_Pos) /*!< Bit mask of WRITEBUFSIZE field.         */
  #define RRAMC_CONFIG_WRITEBUFSIZE_Min (0x00UL)     /*!< Min value of WRITEBUFSIZE field.                                     */
  #define RRAMC_CONFIG_WRITEBUFSIZE_Max (0x20UL)     /*!< Max size of WRITEBUFSIZE field.                                      */
  #define RRAMC_CONFIG_WRITEBUFSIZE_Unbuffered (0x00UL) /*!< Disable buffering                                                 */


/* RRAMC_READYNEXTTIMEOUT: Configuration for ready next timeout counter, in units of AXI clock frequency */
  #define RRAMC_READYNEXTTIMEOUT_ResetValue (0x00000080UL) /*!< Reset value of READYNEXTTIMEOUT register.                      */

/* VALUE @Bits 0..11 : Preload value for waiting for a next write */
  #define RRAMC_READYNEXTTIMEOUT_VALUE_Pos (0UL)     /*!< Position of VALUE field.                                             */
  #define RRAMC_READYNEXTTIMEOUT_VALUE_Msk (0xFFFUL << RRAMC_READYNEXTTIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE field.         */
  #define RRAMC_READYNEXTTIMEOUT_VALUE_Min (0x000UL) /*!< Min value of VALUE field.                                            */
  #define RRAMC_READYNEXTTIMEOUT_VALUE_Max (0xFFFUL) /*!< Max size of VALUE field.                                             */

/* EN @Bit 31 : Enable ready next timeout */
  #define RRAMC_READYNEXTTIMEOUT_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define RRAMC_READYNEXTTIMEOUT_EN_Msk (0x1UL << RRAMC_READYNEXTTIMEOUT_EN_Pos) /*!< Bit mask of EN field.                    */
  #define RRAMC_READYNEXTTIMEOUT_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define RRAMC_READYNEXTTIMEOUT_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define RRAMC_READYNEXTTIMEOUT_EN_Disable (0x0UL)  /*!< Disable ready next timeout                                           */
  #define RRAMC_READYNEXTTIMEOUT_EN_Enable (0x1UL)   /*!< Enable ready next timeout                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct RTC ======================================================== */
/**
  * @brief Real-time counter
  */
  typedef struct {                                   /*!< RTC Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start RTC counter                                     */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop RTC counter                                      */
    __OM uint32_t TASKS_CLEAR;                       /*!< (@ 0x00000008) Clear RTC counter                                     */
    __OM uint32_t TASKS_TRIGOVRFLW;                  /*!< (@ 0x0000000C) Set counter to 0xFFFFF0                               */
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_CAPTURE[4];                  /*!< (@ 0x00000040) Capture RTC counter to CC[n] register                 */
    __IM uint32_t RESERVED1[12];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_CLEAR;                  /*!< (@ 0x00000088) Subscribe configuration for task CLEAR                */
    __IOM uint32_t SUBSCRIBE_TRIGOVRFLW;             /*!< (@ 0x0000008C) Subscribe configuration for task TRIGOVRFLW           */
    __IM uint32_t RESERVED2[12];
    __IOM uint32_t SUBSCRIBE_CAPTURE[4];             /*!< (@ 0x000000C0) Subscribe configuration for task CAPTURE[n]           */
    __IM uint32_t RESERVED3[12];
    __IOM uint32_t EVENTS_TICK;                      /*!< (@ 0x00000100) Event on counter increment                            */
    __IOM uint32_t EVENTS_OVRFLW;                    /*!< (@ 0x00000104) Event on counter overflow                             */
    __IM uint32_t RESERVED4[14];
    __IOM uint32_t EVENTS_COMPARE[4];                /*!< (@ 0x00000140) Compare event on CC[n] match                          */
    __IM uint32_t RESERVED5[12];
    __IOM uint32_t PUBLISH_TICK;                     /*!< (@ 0x00000180) Publish configuration for event TICK                  */
    __IOM uint32_t PUBLISH_OVRFLW;                   /*!< (@ 0x00000184) Publish configuration for event OVRFLW                */
    __IM uint32_t RESERVED6[14];
    __IOM uint32_t PUBLISH_COMPARE[4];               /*!< (@ 0x000001C0) Publish configuration for event COMPARE[n]            */
    __IM uint32_t RESERVED7[12];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED8[64];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED9[13];
    __IOM uint32_t EVTEN;                            /*!< (@ 0x00000340) Enable or disable event routing                       */
    __IOM uint32_t EVTENSET;                         /*!< (@ 0x00000344) Enable event routing                                  */
    __IOM uint32_t EVTENCLR;                         /*!< (@ 0x00000348) Disable event routing                                 */
    __IM uint32_t RESERVED10[110];
    __IM uint32_t COUNTER;                           /*!< (@ 0x00000504) Current counter value                                 */
    __IOM uint32_t PRESCALER;                        /*!< (@ 0x00000508) 12-bit prescaler for counter frequency (32768 /
                                                                         (PRESCALER + 1)). Must be written when RTC is stopped.*/
    __IM uint32_t RESERVED11[13];
    __IOM uint32_t CC[4];                            /*!< (@ 0x00000540) Compare register n                                    */
  } NRF_RTC_Type;                                    /*!< Size = 1360 (0x550)                                                  */

/* RTC_TASKS_START: Start RTC counter */
  #define RTC_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Start RTC counter */
  #define RTC_TASKS_START_TASKS_START_Pos (0UL)      /*!< Position of TASKS_START field.                                       */
  #define RTC_TASKS_START_TASKS_START_Msk (0x1UL << RTC_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.       */
  #define RTC_TASKS_START_TASKS_START_Min (0x1UL)    /*!< Min enumerator value of TASKS_START field.                           */
  #define RTC_TASKS_START_TASKS_START_Max (0x1UL)    /*!< Max enumerator value of TASKS_START field.                           */
  #define RTC_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RTC_TASKS_STOP: Stop RTC counter */
  #define RTC_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop RTC counter */
  #define RTC_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define RTC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << RTC_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define RTC_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define RTC_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define RTC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* RTC_TASKS_CLEAR: Clear RTC counter */
  #define RTC_TASKS_CLEAR_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_CLEAR register.                                 */

/* TASKS_CLEAR @Bit 0 : Clear RTC counter */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Pos (0UL)      /*!< Position of TASKS_CLEAR field.                                       */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Msk (0x1UL << RTC_TASKS_CLEAR_TASKS_CLEAR_Pos) /*!< Bit mask of TASKS_CLEAR field.       */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Min (0x1UL)    /*!< Min enumerator value of TASKS_CLEAR field.                           */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Max (0x1UL)    /*!< Max enumerator value of TASKS_CLEAR field.                           */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Trigger (0x1UL) /*!< Trigger task                                                        */


/* RTC_TASKS_TRIGOVRFLW: Set counter to 0xFFFFF0 */
  #define RTC_TASKS_TRIGOVRFLW_ResetValue (0x00000000UL) /*!< Reset value of TASKS_TRIGOVRFLW register.                        */

