tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* TASKS_TRIGOVRFLW @Bit 0 : Set counter to 0xFFFFF0 */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos (0UL) /*!< Position of TASKS_TRIGOVRFLW field.                             */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Msk (0x1UL << RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGOVRFLW field.*/
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Min (0x1UL) /*!< Min enumerator value of TASKS_TRIGOVRFLW field.               */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Max (0x1UL) /*!< Max enumerator value of TASKS_TRIGOVRFLW field.               */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Trigger (0x1UL) /*!< Trigger task                                              */


/* RTC_TASKS_CAPTURE: Capture RTC counter to CC[n] register */
  #define RTC_TASKS_CAPTURE_MaxCount (4UL)           /*!< Max size of TASKS_CAPTURE[4] array.                                  */
  #define RTC_TASKS_CAPTURE_MaxIndex (3UL)           /*!< Max index of TASKS_CAPTURE[4] array.                                 */
  #define RTC_TASKS_CAPTURE_MinIndex (0UL)           /*!< Min index of TASKS_CAPTURE[4] array.                                 */
  #define RTC_TASKS_CAPTURE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CAPTURE[4] register.                           */

/* TASKS_CAPTURE @Bit 0 : Capture RTC counter to CC[n] register */
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos (0UL)  /*!< Position of TASKS_CAPTURE field.                                     */
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Msk (0x1UL << RTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos) /*!< Bit mask of TASKS_CAPTURE
                                                                            field.*/
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Min (0x1UL) /*!< Min enumerator value of TASKS_CAPTURE field.                        */
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Max (0x1UL) /*!< Max enumerator value of TASKS_CAPTURE field.                        */
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Trigger (0x1UL) /*!< Trigger task                                                    */


/* RTC_SUBSCRIBE_START: Subscribe configuration for task START */
  #define RTC_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define RTC_SUBSCRIBE_START_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define RTC_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define RTC_SUBSCRIBE_START_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define RTC_SUBSCRIBE_START_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_START_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define RTC_SUBSCRIBE_START_EN_Msk (0x1UL << RTC_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                          */
  #define RTC_SUBSCRIBE_START_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_START_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_START_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define RTC_SUBSCRIBE_START_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* RTC_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define RTC_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define RTC_SUBSCRIBE_STOP_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define RTC_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define RTC_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define RTC_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_STOP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define RTC_SUBSCRIBE_STOP_EN_Msk (0x1UL << RTC_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define RTC_SUBSCRIBE_STOP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_STOP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_STOP_EN_Disabled (0x0UL)     /*!< Disable subscription                                                 */
  #define RTC_SUBSCRIBE_STOP_EN_Enabled (0x1UL)      /*!< Enable subscription                                                  */


/* RTC_SUBSCRIBE_CLEAR: Subscribe configuration for task CLEAR */
  #define RTC_SUBSCRIBE_CLEAR_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CLEAR register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task CLEAR will subscribe to */
  #define RTC_SUBSCRIBE_CLEAR_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define RTC_SUBSCRIBE_CLEAR_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_CLEAR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define RTC_SUBSCRIBE_CLEAR_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define RTC_SUBSCRIBE_CLEAR_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_CLEAR_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define RTC_SUBSCRIBE_CLEAR_EN_Msk (0x1UL << RTC_SUBSCRIBE_CLEAR_EN_Pos) /*!< Bit mask of EN field.                          */
  #define RTC_SUBSCRIBE_CLEAR_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_CLEAR_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_CLEAR_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define RTC_SUBSCRIBE_CLEAR_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* RTC_SUBSCRIBE_TRIGOVRFLW: Subscribe configuration for task TRIGOVRFLW */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_TRIGOVRFLW register.                */

