tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task TRIGOVRFLW will subscribe to */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Msk (0x1UL << RTC_SUBSCRIBE_TRIGOVRFLW_EN_Pos) /*!< Bit mask of EN field.                */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* RTC_SUBSCRIBE_CAPTURE: Subscribe configuration for task CAPTURE[n] */
  #define RTC_SUBSCRIBE_CAPTURE_MaxCount (4UL)       /*!< Max size of SUBSCRIBE_CAPTURE[4] array.                              */
  #define RTC_SUBSCRIBE_CAPTURE_MaxIndex (3UL)       /*!< Max index of SUBSCRIBE_CAPTURE[4] array.                             */
  #define RTC_SUBSCRIBE_CAPTURE_MinIndex (0UL)       /*!< Min index of SUBSCRIBE_CAPTURE[4] array.                             */
  #define RTC_SUBSCRIBE_CAPTURE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CAPTURE[4] register.                   */

/* CHIDX @Bits 0..7 : DPPI channel that task CAPTURE[n] will subscribe to */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_CAPTURE_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Msk (0x1UL << RTC_SUBSCRIBE_CAPTURE_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* RTC_EVENTS_TICK: Event on counter increment */
  #define RTC_EVENTS_TICK_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_TICK register.                                 */

/* EVENTS_TICK @Bit 0 : Event on counter increment */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Pos (0UL)      /*!< Position of EVENTS_TICK field.                                       */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Msk (0x1UL << RTC_EVENTS_TICK_EVENTS_TICK_Pos) /*!< Bit mask of EVENTS_TICK field.       */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Min (0x0UL)    /*!< Min enumerator value of EVENTS_TICK field.                           */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Max (0x1UL)    /*!< Max enumerator value of EVENTS_TICK field.                           */
  #define RTC_EVENTS_TICK_EVENTS_TICK_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Generated (0x1UL) /*!< Event generated                                                   */


/* RTC_EVENTS_OVRFLW: Event on counter overflow */
  #define RTC_EVENTS_OVRFLW_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_OVRFLW register.                              */

/* EVENTS_OVRFLW @Bit 0 : Event on counter overflow */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos (0UL)  /*!< Position of EVENTS_OVRFLW field.                                     */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Msk (0x1UL << RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos) /*!< Bit mask of EVENTS_OVRFLW
                                                                            field.*/
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Min (0x0UL) /*!< Min enumerator value of EVENTS_OVRFLW field.                        */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Max (0x1UL) /*!< Max enumerator value of EVENTS_OVRFLW field.                        */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Generated (0x1UL) /*!< Event generated                                               */


/* RTC_EVENTS_COMPARE: Compare event on CC[n] match */
  #define RTC_EVENTS_COMPARE_MaxCount (4UL)          /*!< Max size of EVENTS_COMPARE[4] array.                                 */
  #define RTC_EVENTS_COMPARE_MaxIndex (3UL)          /*!< Max index of EVENTS_COMPARE[4] array.                                */
  #define RTC_EVENTS_COMPARE_MinIndex (0UL)          /*!< Min index of EVENTS_COMPARE[4] array.                                */
  #define RTC_EVENTS_COMPARE_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_COMPARE[4] register.                         */

