tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* EVENTS_COMPARE @Bit 0 : Compare event on CC[n] match */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL) /*!< Position of EVENTS_COMPARE field.                                   */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of EVENTS_COMPARE
                                                                            field.*/
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Min (0x0UL) /*!< Min enumerator value of EVENTS_COMPARE field.                     */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Max (0x1UL) /*!< Max enumerator value of EVENTS_COMPARE field.                     */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Generated (0x1UL) /*!< Event generated                                             */


/* RTC_PUBLISH_TICK: Publish configuration for event TICK */
  #define RTC_PUBLISH_TICK_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TICK register.                                */

/* CHIDX @Bits 0..7 : DPPI channel that event TICK will publish to */
  #define RTC_PUBLISH_TICK_CHIDX_Pos (0UL)           /*!< Position of CHIDX field.                                             */
  #define RTC_PUBLISH_TICK_CHIDX_Msk (0xFFUL << RTC_PUBLISH_TICK_CHIDX_Pos) /*!< Bit mask of CHIDX field.                      */
  #define RTC_PUBLISH_TICK_CHIDX_Min (0x00UL)        /*!< Min value of CHIDX field.                                            */
  #define RTC_PUBLISH_TICK_CHIDX_Max (0xFFUL)        /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_TICK_EN_Pos (31UL)             /*!< Position of EN field.                                                */
  #define RTC_PUBLISH_TICK_EN_Msk (0x1UL << RTC_PUBLISH_TICK_EN_Pos) /*!< Bit mask of EN field.                                */
  #define RTC_PUBLISH_TICK_EN_Min (0x0UL)            /*!< Min enumerator value of EN field.                                    */
  #define RTC_PUBLISH_TICK_EN_Max (0x1UL)            /*!< Max enumerator value of EN field.                                    */
  #define RTC_PUBLISH_TICK_EN_Disabled (0x0UL)       /*!< Disable publishing                                                   */
  #define RTC_PUBLISH_TICK_EN_Enabled (0x1UL)        /*!< Enable publishing                                                    */


/* RTC_PUBLISH_OVRFLW: Publish configuration for event OVRFLW */
  #define RTC_PUBLISH_OVRFLW_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_OVRFLW register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event OVRFLW will publish to */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Msk (0xFFUL << RTC_PUBLISH_OVRFLW_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_OVRFLW_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define RTC_PUBLISH_OVRFLW_EN_Msk (0x1UL << RTC_PUBLISH_OVRFLW_EN_Pos) /*!< Bit mask of EN field.                            */
  #define RTC_PUBLISH_OVRFLW_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define RTC_PUBLISH_OVRFLW_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define RTC_PUBLISH_OVRFLW_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define RTC_PUBLISH_OVRFLW_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* RTC_PUBLISH_COMPARE: Publish configuration for event COMPARE[n] */
  #define RTC_PUBLISH_COMPARE_MaxCount (4UL)         /*!< Max size of PUBLISH_COMPARE[4] array.                                */
  #define RTC_PUBLISH_COMPARE_MaxIndex (3UL)         /*!< Max index of PUBLISH_COMPARE[4] array.                               */
  #define RTC_PUBLISH_COMPARE_MinIndex (0UL)         /*!< Min index of PUBLISH_COMPARE[4] array.                               */
  #define RTC_PUBLISH_COMPARE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_COMPARE[4] register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that event COMPARE[n] will publish to */
  #define RTC_PUBLISH_COMPARE_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define RTC_PUBLISH_COMPARE_CHIDX_Msk (0xFFUL << RTC_PUBLISH_COMPARE_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define RTC_PUBLISH_COMPARE_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define RTC_PUBLISH_COMPARE_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_COMPARE_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define RTC_PUBLISH_COMPARE_EN_Msk (0x1UL << RTC_PUBLISH_COMPARE_EN_Pos) /*!< Bit mask of EN field.                          */
  #define RTC_PUBLISH_COMPARE_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define RTC_PUBLISH_COMPARE_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define RTC_PUBLISH_COMPARE_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define RTC_PUBLISH_COMPARE_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* RTC_SHORTS: Shortcuts between local events and tasks */
  #define RTC_SHORTS_ResetValue (0x00000000UL)       /*!< Reset value of SHORTS register.                                      */

/* COMPARE0_CLEAR @Bit 0 : Shortcut between event COMPARE[0] and task CLEAR */
  #define RTC_SHORTS_COMPARE0_CLEAR_Pos (0UL)        /*!< Position of COMPARE0_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE0_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE0_CLEAR_Pos) /*!< Bit mask of COMPARE0_CLEAR field.        */
  #define RTC_SHORTS_COMPARE0_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE0_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE0_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE0_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE0_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE0_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE1_CLEAR @Bit 1 : Shortcut between event COMPARE[1] and task CLEAR */
  #define RTC_SHORTS_COMPARE1_CLEAR_Pos (1UL)        /*!< Position of COMPARE1_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE1_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE1_CLEAR_Pos) /*!< Bit mask of COMPARE1_CLEAR field.        */
  #define RTC_SHORTS_COMPARE1_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE1_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE1_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE1_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE1_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE1_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE2_CLEAR @Bit 2 : Shortcut between event COMPARE[2] and task CLEAR */
  #define RTC_SHORTS_COMPARE2_CLEAR_Pos (2UL)        /*!< Position of COMPARE2_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE2_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE2_CLEAR_Pos) /*!< Bit mask of COMPARE2_CLEAR field.        */
  #define RTC_SHORTS_COMPARE2_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE2_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE2_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE2_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE2_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE2_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* COMPARE3_CLEAR @Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
  #define RTC_SHORTS_COMPARE3_CLEAR_Pos (3UL)        /*!< Position of COMPARE3_CLEAR field.                                    */
  #define RTC_SHORTS_COMPARE3_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE3_CLEAR_Pos) /*!< Bit mask of COMPARE3_CLEAR field.        */
  #define RTC_SHORTS_COMPARE3_CLEAR_Min (0x0UL)      /*!< Min enumerator value of COMPARE3_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE3_CLEAR_Max (0x1UL)      /*!< Max enumerator value of COMPARE3_CLEAR field.                        */
  #define RTC_SHORTS_COMPARE3_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RTC_SHORTS_COMPARE3_CLEAR_Enabled (0x1UL)  /*!< Enable shortcut                                                      */


/* RTC_INTENSET: Enable interrupt */
  #define RTC_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* TICK @Bit 0 : Write '1' to enable interrupt for event TICK */
  #define RTC_INTENSET_TICK_Pos (0UL)                /*!< Position of TICK field.                                              */
  #define RTC_INTENSET_TICK_Msk (0x1UL << RTC_INTENSET_TICK_Pos) /*!< Bit mask of TICK field.                                  */
  #define RTC_INTENSET_TICK_Min (0x0UL)              /*!< Min enumerator value of TICK field.                                  */
  #define RTC_INTENSET_TICK_Max (0x1UL)              /*!< Max enumerator value of TICK field.                                  */
  #define RTC_INTENSET_TICK_Set (0x1UL)              /*!< Enable                                                               */
  #define RTC_INTENSET_TICK_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define RTC_INTENSET_TICK_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

