tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* OVRFLW @Bit 1 : Write '1' to enable interrupt for event OVRFLW */
  #define RTC_INTENSET_OVRFLW_Pos (1UL)              /*!< Position of OVRFLW field.                                            */
  #define RTC_INTENSET_OVRFLW_Msk (0x1UL << RTC_INTENSET_OVRFLW_Pos) /*!< Bit mask of OVRFLW field.                            */
  #define RTC_INTENSET_OVRFLW_Min (0x0UL)            /*!< Min enumerator value of OVRFLW field.                                */
  #define RTC_INTENSET_OVRFLW_Max (0x1UL)            /*!< Max enumerator value of OVRFLW field.                                */
  #define RTC_INTENSET_OVRFLW_Set (0x1UL)            /*!< Enable                                                               */
  #define RTC_INTENSET_OVRFLW_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define RTC_INTENSET_OVRFLW_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* COMPARE0 @Bit 16 : Write '1' to enable interrupt for event COMPARE[0] */
  #define RTC_INTENSET_COMPARE0_Pos (16UL)           /*!< Position of COMPARE0 field.                                          */
  #define RTC_INTENSET_COMPARE0_Msk (0x1UL << RTC_INTENSET_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                      */
  #define RTC_INTENSET_COMPARE0_Min (0x0UL)          /*!< Min enumerator value of COMPARE0 field.                              */
  #define RTC_INTENSET_COMPARE0_Max (0x1UL)          /*!< Max enumerator value of COMPARE0 field.                              */
  #define RTC_INTENSET_COMPARE0_Set (0x1UL)          /*!< Enable                                                               */
  #define RTC_INTENSET_COMPARE0_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENSET_COMPARE0_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE1 @Bit 17 : Write '1' to enable interrupt for event COMPARE[1] */
  #define RTC_INTENSET_COMPARE1_Pos (17UL)           /*!< Position of COMPARE1 field.                                          */
  #define RTC_INTENSET_COMPARE1_Msk (0x1UL << RTC_INTENSET_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                      */
  #define RTC_INTENSET_COMPARE1_Min (0x0UL)          /*!< Min enumerator value of COMPARE1 field.                              */
  #define RTC_INTENSET_COMPARE1_Max (0x1UL)          /*!< Max enumerator value of COMPARE1 field.                              */
  #define RTC_INTENSET_COMPARE1_Set (0x1UL)          /*!< Enable                                                               */
  #define RTC_INTENSET_COMPARE1_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENSET_COMPARE1_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE2 @Bit 18 : Write '1' to enable interrupt for event COMPARE[2] */
  #define RTC_INTENSET_COMPARE2_Pos (18UL)           /*!< Position of COMPARE2 field.                                          */
  #define RTC_INTENSET_COMPARE2_Msk (0x1UL << RTC_INTENSET_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                      */
  #define RTC_INTENSET_COMPARE2_Min (0x0UL)          /*!< Min enumerator value of COMPARE2 field.                              */
  #define RTC_INTENSET_COMPARE2_Max (0x1UL)          /*!< Max enumerator value of COMPARE2 field.                              */
  #define RTC_INTENSET_COMPARE2_Set (0x1UL)          /*!< Enable                                                               */
  #define RTC_INTENSET_COMPARE2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENSET_COMPARE2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE3 @Bit 19 : Write '1' to enable interrupt for event COMPARE[3] */
  #define RTC_INTENSET_COMPARE3_Pos (19UL)           /*!< Position of COMPARE3 field.                                          */
  #define RTC_INTENSET_COMPARE3_Msk (0x1UL << RTC_INTENSET_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                      */
  #define RTC_INTENSET_COMPARE3_Min (0x0UL)          /*!< Min enumerator value of COMPARE3 field.                              */
  #define RTC_INTENSET_COMPARE3_Max (0x1UL)          /*!< Max enumerator value of COMPARE3 field.                              */
  #define RTC_INTENSET_COMPARE3_Set (0x1UL)          /*!< Enable                                                               */
  #define RTC_INTENSET_COMPARE3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENSET_COMPARE3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* RTC_INTENCLR: Disable interrupt */
  #define RTC_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* TICK @Bit 0 : Write '1' to disable interrupt for event TICK */
  #define RTC_INTENCLR_TICK_Pos (0UL)                /*!< Position of TICK field.                                              */
  #define RTC_INTENCLR_TICK_Msk (0x1UL << RTC_INTENCLR_TICK_Pos) /*!< Bit mask of TICK field.                                  */
  #define RTC_INTENCLR_TICK_Min (0x0UL)              /*!< Min enumerator value of TICK field.                                  */
  #define RTC_INTENCLR_TICK_Max (0x1UL)              /*!< Max enumerator value of TICK field.                                  */
  #define RTC_INTENCLR_TICK_Clear (0x1UL)            /*!< Disable                                                              */
  #define RTC_INTENCLR_TICK_Disabled (0x0UL)         /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_TICK_Enabled (0x1UL)          /*!< Read: Enabled                                                        */

/* OVRFLW @Bit 1 : Write '1' to disable interrupt for event OVRFLW */
  #define RTC_INTENCLR_OVRFLW_Pos (1UL)              /*!< Position of OVRFLW field.                                            */
  #define RTC_INTENCLR_OVRFLW_Msk (0x1UL << RTC_INTENCLR_OVRFLW_Pos) /*!< Bit mask of OVRFLW field.                            */
  #define RTC_INTENCLR_OVRFLW_Min (0x0UL)            /*!< Min enumerator value of OVRFLW field.                                */
  #define RTC_INTENCLR_OVRFLW_Max (0x1UL)            /*!< Max enumerator value of OVRFLW field.                                */
  #define RTC_INTENCLR_OVRFLW_Clear (0x1UL)          /*!< Disable                                                              */
  #define RTC_INTENCLR_OVRFLW_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_OVRFLW_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* COMPARE0 @Bit 16 : Write '1' to disable interrupt for event COMPARE[0] */
  #define RTC_INTENCLR_COMPARE0_Pos (16UL)           /*!< Position of COMPARE0 field.                                          */
  #define RTC_INTENCLR_COMPARE0_Msk (0x1UL << RTC_INTENCLR_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                      */
  #define RTC_INTENCLR_COMPARE0_Min (0x0UL)          /*!< Min enumerator value of COMPARE0 field.                              */
  #define RTC_INTENCLR_COMPARE0_Max (0x1UL)          /*!< Max enumerator value of COMPARE0 field.                              */
  #define RTC_INTENCLR_COMPARE0_Clear (0x1UL)        /*!< Disable                                                              */
  #define RTC_INTENCLR_COMPARE0_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_COMPARE0_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE1 @Bit 17 : Write '1' to disable interrupt for event COMPARE[1] */
  #define RTC_INTENCLR_COMPARE1_Pos (17UL)           /*!< Position of COMPARE1 field.                                          */
  #define RTC_INTENCLR_COMPARE1_Msk (0x1UL << RTC_INTENCLR_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                      */
  #define RTC_INTENCLR_COMPARE1_Min (0x0UL)          /*!< Min enumerator value of COMPARE1 field.                              */
  #define RTC_INTENCLR_COMPARE1_Max (0x1UL)          /*!< Max enumerator value of COMPARE1 field.                              */
  #define RTC_INTENCLR_COMPARE1_Clear (0x1UL)        /*!< Disable                                                              */
  #define RTC_INTENCLR_COMPARE1_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_COMPARE1_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE2 @Bit 18 : Write '1' to disable interrupt for event COMPARE[2] */
  #define RTC_INTENCLR_COMPARE2_Pos (18UL)           /*!< Position of COMPARE2 field.                                          */
  #define RTC_INTENCLR_COMPARE2_Msk (0x1UL << RTC_INTENCLR_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                      */
  #define RTC_INTENCLR_COMPARE2_Min (0x0UL)          /*!< Min enumerator value of COMPARE2 field.                              */
  #define RTC_INTENCLR_COMPARE2_Max (0x1UL)          /*!< Max enumerator value of COMPARE2 field.                              */
  #define RTC_INTENCLR_COMPARE2_Clear (0x1UL)        /*!< Disable                                                              */
  #define RTC_INTENCLR_COMPARE2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_COMPARE2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* COMPARE3 @Bit 19 : Write '1' to disable interrupt for event COMPARE[3] */
  #define RTC_INTENCLR_COMPARE3_Pos (19UL)           /*!< Position of COMPARE3 field.                                          */
  #define RTC_INTENCLR_COMPARE3_Msk (0x1UL << RTC_INTENCLR_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                      */
  #define RTC_INTENCLR_COMPARE3_Min (0x0UL)          /*!< Min enumerator value of COMPARE3 field.                              */
  #define RTC_INTENCLR_COMPARE3_Max (0x1UL)          /*!< Max enumerator value of COMPARE3 field.                              */
  #define RTC_INTENCLR_COMPARE3_Clear (0x1UL)        /*!< Disable                                                              */
  #define RTC_INTENCLR_COMPARE3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_INTENCLR_COMPARE3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* RTC_EVTEN: Enable or disable event routing */
  #define RTC_EVTEN_ResetValue (0x00000000UL)        /*!< Reset value of EVTEN register.                                       */

/* TICK @Bit 0 : Enable or disable event routing for event TICK */
  #define RTC_EVTEN_TICK_Pos (0UL)                   /*!< Position of TICK field.                                              */
  #define RTC_EVTEN_TICK_Msk (0x1UL << RTC_EVTEN_TICK_Pos) /*!< Bit mask of TICK field.                                        */
  #define RTC_EVTEN_TICK_Min (0x0UL)                 /*!< Min enumerator value of TICK field.                                  */
  #define RTC_EVTEN_TICK_Max (0x1UL)                 /*!< Max enumerator value of TICK field.                                  */
  #define RTC_EVTEN_TICK_Disabled (0x0UL)            /*!< Disable                                                              */
  #define RTC_EVTEN_TICK_Enabled (0x1UL)             /*!< Enable                                                               */

/* OVRFLW @Bit 1 : Enable or disable event routing for event OVRFLW */
  #define RTC_EVTEN_OVRFLW_Pos (1UL)                 /*!< Position of OVRFLW field.                                            */
  #define RTC_EVTEN_OVRFLW_Msk (0x1UL << RTC_EVTEN_OVRFLW_Pos) /*!< Bit mask of OVRFLW field.                                  */
  #define RTC_EVTEN_OVRFLW_Min (0x0UL)               /*!< Min enumerator value of OVRFLW field.                                */
  #define RTC_EVTEN_OVRFLW_Max (0x1UL)               /*!< Max enumerator value of OVRFLW field.                                */
  #define RTC_EVTEN_OVRFLW_Disabled (0x0UL)          /*!< Disable                                                              */
  #define RTC_EVTEN_OVRFLW_Enabled (0x1UL)           /*!< Enable                                                               */

/* COMPARE0 @Bit 16 : Enable or disable event routing for event COMPARE[0] */
  #define RTC_EVTEN_COMPARE0_Pos (16UL)              /*!< Position of COMPARE0 field.                                          */
  #define RTC_EVTEN_COMPARE0_Msk (0x1UL << RTC_EVTEN_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                            */
  #define RTC_EVTEN_COMPARE0_Min (0x0UL)             /*!< Min enumerator value of COMPARE0 field.                              */
  #define RTC_EVTEN_COMPARE0_Max (0x1UL)             /*!< Max enumerator value of COMPARE0 field.                              */
  #define RTC_EVTEN_COMPARE0_Disabled (0x0UL)        /*!< Disable                                                              */
  #define RTC_EVTEN_COMPARE0_Enabled (0x1UL)         /*!< Enable                                                               */

