tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* COMPARE1 @Bit 17 : Write '1' to disable event routing for event COMPARE[1] */
  #define RTC_EVTENCLR_COMPARE1_Pos (17UL)           /*!< Position of COMPARE1 field.                                          */
  #define RTC_EVTENCLR_COMPARE1_Msk (0x1UL << RTC_EVTENCLR_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                      */
  #define RTC_EVTENCLR_COMPARE1_Min (0x0UL)          /*!< Min enumerator value of COMPARE1 field.                              */
  #define RTC_EVTENCLR_COMPARE1_Max (0x1UL)          /*!< Max enumerator value of COMPARE1 field.                              */
  #define RTC_EVTENCLR_COMPARE1_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE1_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE1_Clear (0x1UL)        /*!< Disable                                                              */

/* COMPARE2 @Bit 18 : Write '1' to disable event routing for event COMPARE[2] */
  #define RTC_EVTENCLR_COMPARE2_Pos (18UL)           /*!< Position of COMPARE2 field.                                          */
  #define RTC_EVTENCLR_COMPARE2_Msk (0x1UL << RTC_EVTENCLR_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                      */
  #define RTC_EVTENCLR_COMPARE2_Min (0x0UL)          /*!< Min enumerator value of COMPARE2 field.                              */
  #define RTC_EVTENCLR_COMPARE2_Max (0x1UL)          /*!< Max enumerator value of COMPARE2 field.                              */
  #define RTC_EVTENCLR_COMPARE2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE2_Clear (0x1UL)        /*!< Disable                                                              */

/* COMPARE3 @Bit 19 : Write '1' to disable event routing for event COMPARE[3] */
  #define RTC_EVTENCLR_COMPARE3_Pos (19UL)           /*!< Position of COMPARE3 field.                                          */
  #define RTC_EVTENCLR_COMPARE3_Msk (0x1UL << RTC_EVTENCLR_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                      */
  #define RTC_EVTENCLR_COMPARE3_Min (0x0UL)          /*!< Min enumerator value of COMPARE3 field.                              */
  #define RTC_EVTENCLR_COMPARE3_Max (0x1UL)          /*!< Max enumerator value of COMPARE3 field.                              */
  #define RTC_EVTENCLR_COMPARE3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RTC_EVTENCLR_COMPARE3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */
  #define RTC_EVTENCLR_COMPARE3_Clear (0x1UL)        /*!< Disable                                                              */


/* RTC_COUNTER: Current counter value */
  #define RTC_COUNTER_ResetValue (0x00000000UL)      /*!< Reset value of COUNTER register.                                     */

/* COUNTER @Bits 0..23 : Counter value */
  #define RTC_COUNTER_COUNTER_Pos (0UL)              /*!< Position of COUNTER field.                                           */
  #define RTC_COUNTER_COUNTER_Msk (0xFFFFFFUL << RTC_COUNTER_COUNTER_Pos) /*!< Bit mask of COUNTER field.                      */


/* RTC_PRESCALER: 12-bit prescaler for counter frequency (32768 / (PRESCALER + 1)). Must be written when RTC is stopped. */
  #define RTC_PRESCALER_ResetValue (0x00000000UL)    /*!< Reset value of PRESCALER register.                                   */

/* PRESCALER @Bits 0..11 : Prescaler value */
  #define RTC_PRESCALER_PRESCALER_Pos (0UL)          /*!< Position of PRESCALER field.                                         */
  #define RTC_PRESCALER_PRESCALER_Msk (0xFFFUL << RTC_PRESCALER_PRESCALER_Pos) /*!< Bit mask of PRESCALER field.               */


/* RTC_CC: Compare register n */
  #define RTC_CC_MaxCount (4UL)                      /*!< Max size of CC[4] array.                                             */
  #define RTC_CC_MaxIndex (3UL)                      /*!< Max index of CC[4] array.                                            */
  #define RTC_CC_MinIndex (0UL)                      /*!< Min index of CC[4] array.                                            */
  #define RTC_CC_ResetValue (0x00000000UL)           /*!< Reset value of CC[4] register.                                       */

/* COMPARE @Bits 0..23 : Compare value */
  #define RTC_CC_COMPARE_Pos (0UL)                   /*!< Position of COMPARE field.                                           */
  #define RTC_CC_COMPARE_Msk (0xFFFFFFUL << RTC_CC_COMPARE_Pos) /*!< Bit mask of COMPARE field.                                */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SAADC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct SAADC_EVENTS_CH ================================================== */
/**
  * @brief EVENTS_CH [SAADC_EVENTS_CH] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  LIMITH;                            /*!< (@ 0x00000000) Last results is equal or above CH[n].LIMIT.HIGH       */
  __IOM uint32_t  LIMITL;                            /*!< (@ 0x00000004) Last results is equal or below CH[n].LIMIT.LOW        */
} NRF_SAADC_EVENTS_CH_Type;                          /*!< Size = 8 (0x008)                                                     */
