tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* CH6LIMITL @Bit 19 : Enable or disable interrupt for event CH6LIMITL */
  #define SAADC_INTEN_CH6LIMITL_Pos (19UL)           /*!< Position of CH6LIMITL field.                                         */
  #define SAADC_INTEN_CH6LIMITL_Msk (0x1UL << SAADC_INTEN_CH6LIMITL_Pos) /*!< Bit mask of CH6LIMITL field.                     */
  #define SAADC_INTEN_CH6LIMITL_Min (0x0UL)          /*!< Min enumerator value of CH6LIMITL field.                             */
  #define SAADC_INTEN_CH6LIMITL_Max (0x1UL)          /*!< Max enumerator value of CH6LIMITL field.                             */
  #define SAADC_INTEN_CH6LIMITL_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SAADC_INTEN_CH6LIMITL_Enabled (0x1UL)      /*!< Enable                                                               */

/* CH7LIMITH @Bit 20 : Enable or disable interrupt for event CH7LIMITH */
  #define SAADC_INTEN_CH7LIMITH_Pos (20UL)           /*!< Position of CH7LIMITH field.                                         */
  #define SAADC_INTEN_CH7LIMITH_Msk (0x1UL << SAADC_INTEN_CH7LIMITH_Pos) /*!< Bit mask of CH7LIMITH field.                     */
  #define SAADC_INTEN_CH7LIMITH_Min (0x0UL)          /*!< Min enumerator value of CH7LIMITH field.                             */
  #define SAADC_INTEN_CH7LIMITH_Max (0x1UL)          /*!< Max enumerator value of CH7LIMITH field.                             */
  #define SAADC_INTEN_CH7LIMITH_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SAADC_INTEN_CH7LIMITH_Enabled (0x1UL)      /*!< Enable                                                               */

/* CH7LIMITL @Bit 21 : Enable or disable interrupt for event CH7LIMITL */
  #define SAADC_INTEN_CH7LIMITL_Pos (21UL)           /*!< Position of CH7LIMITL field.                                         */
  #define SAADC_INTEN_CH7LIMITL_Msk (0x1UL << SAADC_INTEN_CH7LIMITL_Pos) /*!< Bit mask of CH7LIMITL field.                     */
  #define SAADC_INTEN_CH7LIMITL_Min (0x0UL)          /*!< Min enumerator value of CH7LIMITL field.                             */
  #define SAADC_INTEN_CH7LIMITL_Max (0x1UL)          /*!< Max enumerator value of CH7LIMITL field.                             */
  #define SAADC_INTEN_CH7LIMITL_Disabled (0x0UL)     /*!< Disable                                                              */
  #define SAADC_INTEN_CH7LIMITL_Enabled (0x1UL)      /*!< Enable                                                               */


/* SAADC_INTENSET: Enable interrupt */
  #define SAADC_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define SAADC_INTENSET_STARTED_Pos (0UL)           /*!< Position of STARTED field.                                           */
  #define SAADC_INTENSET_STARTED_Msk (0x1UL << SAADC_INTENSET_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define SAADC_INTENSET_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define SAADC_INTENSET_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define SAADC_INTENSET_STARTED_Set (0x1UL)         /*!< Enable                                                               */
  #define SAADC_INTENSET_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* END @Bit 1 : Write '1' to enable interrupt for event END */
  #define SAADC_INTENSET_END_Pos (1UL)               /*!< Position of END field.                                               */
  #define SAADC_INTENSET_END_Msk (0x1UL << SAADC_INTENSET_END_Pos) /*!< Bit mask of END field.                                 */
  #define SAADC_INTENSET_END_Min (0x0UL)             /*!< Min enumerator value of END field.                                   */
  #define SAADC_INTENSET_END_Max (0x1UL)             /*!< Max enumerator value of END field.                                   */
  #define SAADC_INTENSET_END_Set (0x1UL)             /*!< Enable                                                               */
  #define SAADC_INTENSET_END_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_END_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* DONE @Bit 2 : Write '1' to enable interrupt for event DONE */
  #define SAADC_INTENSET_DONE_Pos (2UL)              /*!< Position of DONE field.                                              */
  #define SAADC_INTENSET_DONE_Msk (0x1UL << SAADC_INTENSET_DONE_Pos) /*!< Bit mask of DONE field.                              */
  #define SAADC_INTENSET_DONE_Min (0x0UL)            /*!< Min enumerator value of DONE field.                                  */
  #define SAADC_INTENSET_DONE_Max (0x1UL)            /*!< Max enumerator value of DONE field.                                  */
  #define SAADC_INTENSET_DONE_Set (0x1UL)            /*!< Enable                                                               */
  #define SAADC_INTENSET_DONE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_DONE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RESULTDONE @Bit 3 : Write '1' to enable interrupt for event RESULTDONE */
  #define SAADC_INTENSET_RESULTDONE_Pos (3UL)        /*!< Position of RESULTDONE field.                                        */
  #define SAADC_INTENSET_RESULTDONE_Msk (0x1UL << SAADC_INTENSET_RESULTDONE_Pos) /*!< Bit mask of RESULTDONE field.            */
  #define SAADC_INTENSET_RESULTDONE_Min (0x0UL)      /*!< Min enumerator value of RESULTDONE field.                            */
  #define SAADC_INTENSET_RESULTDONE_Max (0x1UL)      /*!< Max enumerator value of RESULTDONE field.                            */
  #define SAADC_INTENSET_RESULTDONE_Set (0x1UL)      /*!< Enable                                                               */
  #define SAADC_INTENSET_RESULTDONE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_RESULTDONE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

