tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* SAADC_NOISESHAPE: Enable noise shaping */
  #define SAADC_NOISESHAPE_ResetValue (0x00000000UL) /*!< Reset value of NOISESHAPE register.                                  */

/* NOISESHAPE @Bits 0..1 : Enable noise shaping */
  #define SAADC_NOISESHAPE_NOISESHAPE_Pos (0UL)      /*!< Position of NOISESHAPE field.                                        */
  #define SAADC_NOISESHAPE_NOISESHAPE_Msk (0x3UL << SAADC_NOISESHAPE_NOISESHAPE_Pos) /*!< Bit mask of NOISESHAPE field.        */
  #define SAADC_NOISESHAPE_NOISESHAPE_Min (0x0UL)    /*!< Min enumerator value of NOISESHAPE field.                            */
  #define SAADC_NOISESHAPE_NOISESHAPE_Max (0x3UL)    /*!< Max enumerator value of NOISESHAPE field.                            */
  #define SAADC_NOISESHAPE_NOISESHAPE_Disable (0x0UL) /*!< Disable noiseshaping. Oversampling based on accumulate and average. */
  #define SAADC_NOISESHAPE_NOISESHAPE_Audio (0x1UL)  /*!< Noiseshaping and decimating. Larger passband. Provides a 50kS/s cut
                                                          off frequency, 8x the oversampling ratio. See design description for
                                                          more information*/
  #define SAADC_NOISESHAPE_NOISESHAPE_Accuracy (0x2UL) /*!< Noiseshaping and decimating. Smaller passband. Recommended
                                                            resolution setting is 14 bits. Provides 1 5kS/s cut off frequency,
                                                            32x the oversampling ratio. See design description for more
                                                            information*/
  #define SAADC_NOISESHAPE_NOISESHAPE_Stage1 (0x3UL) /*!< Result from common 1st stage filter. For debugging only              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct SICR ======================================================= */
/**
  * @brief Factory Information Configuration Registers
  */
  typedef struct {                                   /*!< SICR Structure                                                       */
    __IM uint32_t RESERVED;
  } NRF_SICR_Type;                                   /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct SPI_PSEL ===================================================== */
/**
  * @brief PSEL [SPI_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCK;                               /*!< (@ 0x00000000) Pin select for SCK                                    */
  __IOM uint32_t  MOSI;                              /*!< (@ 0x00000004) Pin select for MOSI signal                            */
  __IOM uint32_t  MISO;                              /*!< (@ 0x00000008) Pin select for MISO signal                            */
} NRF_SPI_PSEL_Type;                                 /*!< Size = 12 (0x00C)                                                    */

/* SPI_PSEL_SCK: Pin select for SCK */
  #define SPI_PSEL_SCK_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of SCK register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define SPI_PSEL_SCK_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define SPI_PSEL_SCK_PIN_Msk (0x1FUL << SPI_PSEL_SCK_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define SPI_PSEL_SCK_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define SPI_PSEL_SCK_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bit 5 : Port number */
  #define SPI_PSEL_SCK_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define SPI_PSEL_SCK_PORT_Msk (0x1UL << SPI_PSEL_SCK_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define SPI_PSEL_SCK_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define SPI_PSEL_SCK_PORT_Max (0x1UL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPI_PSEL_SCK_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define SPI_PSEL_SCK_CONNECT_Msk (0x1UL << SPI_PSEL_SCK_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define SPI_PSEL_SCK_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define SPI_PSEL_SCK_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define SPI_PSEL_SCK_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define SPI_PSEL_SCK_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


