tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* SPI_PSEL_MOSI: Pin select for MOSI signal */
  #define SPI_PSEL_MOSI_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of MOSI register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define SPI_PSEL_MOSI_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define SPI_PSEL_MOSI_PIN_Msk (0x1FUL << SPI_PSEL_MOSI_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define SPI_PSEL_MOSI_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define SPI_PSEL_MOSI_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bit 5 : Port number */
  #define SPI_PSEL_MOSI_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define SPI_PSEL_MOSI_PORT_Msk (0x1UL << SPI_PSEL_MOSI_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define SPI_PSEL_MOSI_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define SPI_PSEL_MOSI_PORT_Max (0x1UL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPI_PSEL_MOSI_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define SPI_PSEL_MOSI_CONNECT_Msk (0x1UL << SPI_PSEL_MOSI_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define SPI_PSEL_MOSI_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define SPI_PSEL_MOSI_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define SPI_PSEL_MOSI_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define SPI_PSEL_MOSI_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* SPI_PSEL_MISO: Pin select for MISO signal */
  #define SPI_PSEL_MISO_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of MISO register.                                        */

/* PIN @Bits 0..4 : Pin number */
  #define SPI_PSEL_MISO_PIN_Pos (0UL)                /*!< Position of PIN field.                                               */
  #define SPI_PSEL_MISO_PIN_Msk (0x1FUL << SPI_PSEL_MISO_PIN_Pos) /*!< Bit mask of PIN field.                                  */
  #define SPI_PSEL_MISO_PIN_Min (0x00UL)             /*!< Min value of PIN field.                                              */
  #define SPI_PSEL_MISO_PIN_Max (0x1FUL)             /*!< Max size of PIN field.                                               */

/* PORT @Bit 5 : Port number */
  #define SPI_PSEL_MISO_PORT_Pos (5UL)               /*!< Position of PORT field.                                              */
  #define SPI_PSEL_MISO_PORT_Msk (0x1UL << SPI_PSEL_MISO_PORT_Pos) /*!< Bit mask of PORT field.                                */
  #define SPI_PSEL_MISO_PORT_Min (0x0UL)             /*!< Min value of PORT field.                                             */
  #define SPI_PSEL_MISO_PORT_Max (0x1UL)             /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define SPI_PSEL_MISO_CONNECT_Pos (31UL)           /*!< Position of CONNECT field.                                           */
  #define SPI_PSEL_MISO_CONNECT_Msk (0x1UL << SPI_PSEL_MISO_CONNECT_Pos) /*!< Bit mask of CONNECT field.                       */
  #define SPI_PSEL_MISO_CONNECT_Min (0x0UL)          /*!< Min enumerator value of CONNECT field.                               */
  #define SPI_PSEL_MISO_CONNECT_Max (0x1UL)          /*!< Max enumerator value of CONNECT field.                               */
  #define SPI_PSEL_MISO_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                           */
  #define SPI_PSEL_MISO_CONNECT_Connected (0x0UL)    /*!< Connect                                                              */


/* ======================================================= Struct SPI ======================================================== */
/**
  * @brief Serial Peripheral Interface
  */
  typedef struct {                                   /*!< SPI Structure                                                        */
    __IM uint32_t RESERVED[66];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000108) TXD byte sent and RXD byte received                   */
    __IM uint32_t RESERVED1[31];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000188) Publish configuration for event READY                 */
    __IM uint32_t RESERVED2[94];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED3[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable SPI                                            */
    __IM uint32_t RESERVED4;
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_SPI_PSEL_Type PSEL;                  /*!< (@ 0x00000508) (unspecified)                                         */
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IM uint32_t RESERVED5;
    __IM uint32_t RXD;                               /*!< (@ 0x00000518) RXD register                                          */
    __IOM uint32_t TXD;                              /*!< (@ 0x0000051C) TXD register                                          */
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t PRESCALER;                        /*!< (@ 0x0000052C) The prescaler is used to set the SPI frequency.       */
    __IM uint32_t RESERVED7[9];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x00000554) Configuration register                                */
  } NRF_SPI_Type;                                    /*!< Size = 1368 (0x558)                                                  */

/* SPI_EVENTS_READY: TXD byte sent and RXD byte received */
  #define SPI_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                                */

