tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* EVENTS_READY @Bit 0 : TXD byte sent and RXD byte received */
  #define SPI_EVENTS_READY_EVENTS_READY_Pos (0UL)    /*!< Position of EVENTS_READY field.                                      */
  #define SPI_EVENTS_READY_EVENTS_READY_Msk (0x1UL << SPI_EVENTS_READY_EVENTS_READY_Pos) /*!< Bit mask of EVENTS_READY field.  */
  #define SPI_EVENTS_READY_EVENTS_READY_Min (0x0UL)  /*!< Min enumerator value of EVENTS_READY field.                          */
  #define SPI_EVENTS_READY_EVENTS_READY_Max (0x1UL)  /*!< Max enumerator value of EVENTS_READY field.                          */
  #define SPI_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define SPI_EVENTS_READY_EVENTS_READY_Generated (0x1UL) /*!< Event generated                                                 */


/* SPI_PUBLISH_READY: Publish configuration for event READY */
  #define SPI_PUBLISH_READY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READY register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define SPI_PUBLISH_READY_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define SPI_PUBLISH_READY_CHIDX_Msk (0xFFUL << SPI_PUBLISH_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define SPI_PUBLISH_READY_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define SPI_PUBLISH_READY_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPI_PUBLISH_READY_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define SPI_PUBLISH_READY_EN_Msk (0x1UL << SPI_PUBLISH_READY_EN_Pos) /*!< Bit mask of EN field.                              */
  #define SPI_PUBLISH_READY_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define SPI_PUBLISH_READY_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define SPI_PUBLISH_READY_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define SPI_PUBLISH_READY_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* SPI_INTENSET: Enable interrupt */
  #define SPI_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 2 : Write '1' to enable interrupt for event READY */
  #define SPI_INTENSET_READY_Pos (2UL)               /*!< Position of READY field.                                             */
  #define SPI_INTENSET_READY_Msk (0x1UL << SPI_INTENSET_READY_Pos) /*!< Bit mask of READY field.                               */
  #define SPI_INTENSET_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define SPI_INTENSET_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define SPI_INTENSET_READY_Set (0x1UL)             /*!< Enable                                                               */
  #define SPI_INTENSET_READY_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define SPI_INTENSET_READY_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* SPI_INTENCLR: Disable interrupt */
  #define SPI_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* READY @Bit 2 : Write '1' to disable interrupt for event READY */
  #define SPI_INTENCLR_READY_Pos (2UL)               /*!< Position of READY field.                                             */
  #define SPI_INTENCLR_READY_Msk (0x1UL << SPI_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                               */
  #define SPI_INTENCLR_READY_Min (0x0UL)             /*!< Min enumerator value of READY field.                                 */
  #define SPI_INTENCLR_READY_Max (0x1UL)             /*!< Max enumerator value of READY field.                                 */
  #define SPI_INTENCLR_READY_Clear (0x1UL)           /*!< Disable                                                              */
  #define SPI_INTENCLR_READY_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define SPI_INTENCLR_READY_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* SPI_ENABLE: Enable SPI */
  #define SPI_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable SPI */
  #define SPI_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define SPI_ENABLE_ENABLE_Msk (0xFUL << SPI_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define SPI_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define SPI_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define SPI_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable SPI                                                          */
  #define SPI_ENABLE_ENABLE_Enabled (0x1UL)          /*!< Enable SPI                                                           */


/* SPI_RXD: RXD register */
  #define SPI_RXD_ResetValue (0x00000000UL)          /*!< Reset value of RXD register.                                         */

/* RXD @Bits 0..7 : RX data received. Double buffered */
  #define SPI_RXD_RXD_Pos (0UL)                      /*!< Position of RXD field.                                               */
  #define SPI_RXD_RXD_Msk (0xFFUL << SPI_RXD_RXD_Pos) /*!< Bit mask of RXD field.                                              */


/* SPI_TXD: TXD register */
  #define SPI_TXD_ResetValue (0x00000000UL)          /*!< Reset value of TXD register.                                         */

/* TXD @Bits 0..7 : TX data to send. Double buffered. */
  #define SPI_TXD_TXD_Pos (0UL)                      /*!< Position of TXD field.                                               */
  #define SPI_TXD_TXD_Msk (0xFFUL << SPI_TXD_TXD_Pos) /*!< Bit mask of TXD field.                                              */


