tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* SPI_PRESCALER: The prescaler is used to set the SPI frequency. */
  #define SPI_PRESCALER_ResetValue (0x00000040UL)    /*!< Reset value of PRESCALER register.                                   */

/* DIVISOR @Bits 0..6 : Core clock to SCK divisor */
  #define SPI_PRESCALER_DIVISOR_Pos (0UL)            /*!< Position of DIVISOR field.                                           */
  #define SPI_PRESCALER_DIVISOR_Msk (0x7FUL << SPI_PRESCALER_DIVISOR_Pos) /*!< Bit mask of DIVISOR field.                      */
  #define SPI_PRESCALER_DIVISOR_Min (0x02UL)         /*!< Min value of DIVISOR field.                                          */
  #define SPI_PRESCALER_DIVISOR_Max (0x7EUL)         /*!< Max size of DIVISOR field.                                           */


/* SPI_CONFIG: Configuration register */
  #define SPI_CONFIG_ResetValue (0x00000000UL)       /*!< Reset value of CONFIG register.                                      */

/* ORDER @Bit 0 : Bit order */
  #define SPI_CONFIG_ORDER_Pos (0UL)                 /*!< Position of ORDER field.                                             */
  #define SPI_CONFIG_ORDER_Msk (0x1UL << SPI_CONFIG_ORDER_Pos) /*!< Bit mask of ORDER field.                                   */
  #define SPI_CONFIG_ORDER_Min (0x0UL)               /*!< Min enumerator value of ORDER field.                                 */
  #define SPI_CONFIG_ORDER_Max (0x1UL)               /*!< Max enumerator value of ORDER field.                                 */
  #define SPI_CONFIG_ORDER_MsbFirst (0x0UL)          /*!< Most significant bit shifted out first                               */
  #define SPI_CONFIG_ORDER_LsbFirst (0x1UL)          /*!< Least significant bit shifted out first                              */

/* CPHA @Bit 1 : Serial clock (SCK) phase */
  #define SPI_CONFIG_CPHA_Pos (1UL)                  /*!< Position of CPHA field.                                              */
  #define SPI_CONFIG_CPHA_Msk (0x1UL << SPI_CONFIG_CPHA_Pos) /*!< Bit mask of CPHA field.                                      */
  #define SPI_CONFIG_CPHA_Min (0x0UL)                /*!< Min enumerator value of CPHA field.                                  */
  #define SPI_CONFIG_CPHA_Max (0x1UL)                /*!< Max enumerator value of CPHA field.                                  */
  #define SPI_CONFIG_CPHA_Leading (0x0UL)            /*!< Sample on leading edge of clock, shift serial data on trailing edge  */
  #define SPI_CONFIG_CPHA_Trailing (0x1UL)           /*!< Sample on trailing edge of clock, shift serial data on leading edge  */

/* CPOL @Bit 2 : Serial clock (SCK) polarity */
  #define SPI_CONFIG_CPOL_Pos (2UL)                  /*!< Position of CPOL field.                                              */
  #define SPI_CONFIG_CPOL_Msk (0x1UL << SPI_CONFIG_CPOL_Pos) /*!< Bit mask of CPOL field.                                      */
  #define SPI_CONFIG_CPOL_Min (0x0UL)                /*!< Min enumerator value of CPOL field.                                  */
  #define SPI_CONFIG_CPOL_Max (0x1UL)                /*!< Max enumerator value of CPOL field.                                  */
  #define SPI_CONFIG_CPOL_ActiveHigh (0x0UL)         /*!< Active high                                                          */
  #define SPI_CONFIG_CPOL_ActiveLow (0x1UL)          /*!< Active low                                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SPIM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct SPIM_TASKS_DMA_RX ================================================= */
/**
  * @brief RX [SPIM_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000000) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000010) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/
} NRF_SPIM_TASKS_DMA_RX_Type;                        /*!< Size = 32 (0x020)                                                    */

/* SPIM_TASKS_DMA_RX_ENABLEMATCH: Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register. */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_MaxCount (4UL) /*!< Max size of ENABLEMATCH[4] array.                                  */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_MaxIndex (3UL) /*!< Max index of ENABLEMATCH[4] array.                                 */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_MinIndex (0UL) /*!< Min index of ENABLEMATCH[4] array.                                 */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ResetValue (0x00000000UL) /*!< Reset value of ENABLEMATCH[4] register.                 */

/* ENABLEMATCH @Bit 0 : Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register. */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Pos (0UL) /*!< Position of ENABLEMATCH field.                              */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Msk (0x1UL << SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Pos) /*!< Bit mask
                                                                            of ENABLEMATCH field.*/
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Min (0x1UL) /*!< Min enumerator value of ENABLEMATCH field.                */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Max (0x1UL) /*!< Max enumerator value of ENABLEMATCH field.                */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Trigger (0x1UL) /*!< Trigger task                                          */


