tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* ================================================ Struct SPU_FEATURE_CRACEN ================================================ */
/**
  * @brief CRACEN [SPU_FEATURE_CRACEN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEED;                              /*!< (@ 0x00000000) Configuration for CRACEN SEED                         */
} NRF_SPU_FEATURE_CRACEN_Type;                       /*!< Size = 4 (0x004)                                                     */

/* SPU_FEATURE_CRACEN_SEED: Configuration for CRACEN SEED */
  #define SPU_FEATURE_CRACEN_SEED_ResetValue (0x00000000UL) /*!< Reset value of SEED register.                                 */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_CRACEN_SEED_SECATTR_Pos (4UL)  /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_CRACEN_SEED_SECATTR_Msk (0x1UL << SPU_FEATURE_CRACEN_SEED_SECATTR_Pos) /*!< Bit mask of SECATTR field.   */
  #define SPU_FEATURE_CRACEN_SEED_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                              */
  #define SPU_FEATURE_CRACEN_SEED_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                              */
  #define SPU_FEATURE_CRACEN_SEED_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                     */
  #define SPU_FEATURE_CRACEN_SEED_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                             */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_CRACEN_SEED_LOCK_Pos (8UL)     /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_CRACEN_SEED_LOCK_Msk (0x1UL << SPU_FEATURE_CRACEN_SEED_LOCK_Pos) /*!< Bit mask of LOCK field.            */
  #define SPU_FEATURE_CRACEN_SEED_LOCK_Min (0x0UL)   /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_CRACEN_SEED_LOCK_Max (0x1UL)   /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_CRACEN_SEED_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                */
  #define SPU_FEATURE_CRACEN_SEED_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset         */



/* ================================================= Struct SPU_FEATURE_GRTC ================================================= */
/**
  * @brief GRTC [SPU_FEATURE_GRTC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CC[24];                            /*!< (@ 0x00000000) Configuration of features for CC n of GRTC            */
  __IM  uint32_t  RESERVED[5];
  __IOM uint32_t  PWMCONFIG;                         /*!< (@ 0x00000074) Configuration of feature for PWMCONFIG of GRTC        */
  __IOM uint32_t  CLK;                               /*!< (@ 0x00000078) Configuration of features for CLKOUT/CLKCFG of GRTC   */
  __IOM uint32_t  SYSCOUNTER;                        /*!< (@ 0x0000007C) Configuration of features for SYSCOUNTERL/SYSCOUNTERH
                                                                         of GRTC*/
  __IOM uint32_t  INTERRUPT[16];                     /*!< (@ 0x00000080) Configuration of features for interrupt n of GRTC     */
} NRF_SPU_FEATURE_GRTC_Type;                         /*!< Size = 192 (0x0C0)                                                   */

/* SPU_FEATURE_GRTC_CC: Configuration of features for CC n of GRTC */
  #define SPU_FEATURE_GRTC_CC_MaxCount (24UL)        /*!< Max size of CC[24] array.                                            */
  #define SPU_FEATURE_GRTC_CC_MaxIndex (23UL)        /*!< Max index of CC[24] array.                                           */
  #define SPU_FEATURE_GRTC_CC_MinIndex (0UL)         /*!< Min index of CC[24] array.                                           */
  #define SPU_FEATURE_GRTC_CC_ResetValue (0x00000000UL) /*!< Reset value of CC[24] register.                                   */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Pos (4UL)      /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_CC_SECATTR_Pos) /*!< Bit mask of SECATTR field.           */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Min (0x0UL)    /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Max (0x1UL)    /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GRTC_CC_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                         */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                 */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_CC_LOCK_Pos (8UL)         /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_CC_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_CC_LOCK_Pos) /*!< Bit mask of LOCK field.                    */
  #define SPU_FEATURE_GRTC_CC_LOCK_Min (0x0UL)       /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CC_LOCK_Max (0x1UL)       /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GRTC_CC_LOCK_Unlocked (0x0UL)  /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_GRTC_CC_LOCK_Locked (0x1UL)    /*!< Feature permissions can not be changed until the next reset          */


/* SPU_FEATURE_GRTC_PWMCONFIG: Configuration of feature for PWMCONFIG of GRTC */
  #define SPU_FEATURE_GRTC_PWMCONFIG_ResetValue (0x00000000UL) /*!< Reset value of PWMCONFIG register.                         */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                         */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                           */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                  */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                          */

