tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos (8UL)  /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos) /*!< Bit mask of LOCK field.      */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                                 */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                             */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset      */



/* =================================================== Struct SPU_FEATURE ==================================================== */
/**
  * @brief FEATURE [SPU_FEATURE] (unspecified)
  */
typedef union {
  struct {
    __IM uint32_t RESERVED[32];
    __IOM NRF_SPU_FEATURE_DPPIC_Type DPPIC;          /*!< (@ 0x00000080) (unspecified)                                         */
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_SPU_FEATURE_GPIOTE_Type GPIOTE[2];   /*!< (@ 0x00000100) (unspecified)                                         */
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IM uint32_t RESERVED1[32];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_SPU_FEATURE_GPIO_Type GPIO[3];       /*!< (@ 0x00000200) (unspecified)                                         */
      struct {
        __IM uint32_t RESERVED2[96];
        __IOM NRF_SPU_FEATURE_CRACEN_Type CRACEN;    /*!< (@ 0x00000380) (unspecified)                                         */
      };
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IM uint32_t RESERVED3[223];
    __IOM NRF_SPU_FEATURE_GRTC_Type GRTC;            /*!< (@ 0x00000700) (unspecified)                                         */
  };
} NRF_SPU_FEATURE_Type;                              /*!< Size = 1984 (0x7C0)                                                  */

/* ======================================================= Struct SPU ======================================================== */
/**
  * @brief System protection unit
  */
  typedef struct {                                   /*!< SPU Structure                                                        */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_PERIPHACCERR;              /*!< (@ 0x00000100) A security violation has been detected on one or
                                                                         several peripherals*/
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[61];
    __IOM NRF_SPU_PERIPHACCERR_Type PERIPHACCERR;    /*!< (@ 0x00000404) (unspecified)                                         */
    __IM uint32_t RESERVED3[61];
    __IOM NRF_SPU_PERIPH_Type PERIPH[64];            /*!< (@ 0x00000500) (unspecified)                                         */
    __IOM NRF_SPU_FEATURE_Type FEATURE;              /*!< (@ 0x00000600) (unspecified)                                         */
  } NRF_SPU_Type;                                    /*!< Size = 3520 (0xDC0)                                                  */

/* SPU_EVENTS_PERIPHACCERR: A security violation has been detected on one or several peripherals */
  #define SPU_EVENTS_PERIPHACCERR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PERIPHACCERR register.                  */

/* EVENTS_PERIPHACCERR @Bit 0 : A security violation has been detected on one or several peripherals */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Pos (0UL) /*!< Position of EVENTS_PERIPHACCERR field.                    */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Msk (0x1UL << SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Pos) /*!< Bit
                                                                            mask of EVENTS_PERIPHACCERR field.*/
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Min (0x0UL) /*!< Min enumerator value of EVENTS_PERIPHACCERR field.      */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Max (0x1UL) /*!< Max enumerator value of EVENTS_PERIPHACCERR field.      */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Generated (0x1UL) /*!< Event generated                                   */


/* SPU_INTEN: Enable or disable interrupt */
  #define SPU_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* PERIPHACCERR @Bit 0 : Enable or disable interrupt for event PERIPHACCERR */
  #define SPU_INTEN_PERIPHACCERR_Pos (0UL)           /*!< Position of PERIPHACCERR field.                                      */
  #define SPU_INTEN_PERIPHACCERR_Msk (0x1UL << SPU_INTEN_PERIPHACCERR_Pos) /*!< Bit mask of PERIPHACCERR field.                */
  #define SPU_INTEN_PERIPHACCERR_Min (0x0UL)         /*!< Min enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTEN_PERIPHACCERR_Max (0x1UL)         /*!< Max enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTEN_PERIPHACCERR_Disabled (0x0UL)    /*!< Disable                                                              */
  #define SPU_INTEN_PERIPHACCERR_Enabled (0x1UL)     /*!< Enable                                                               */


/* SPU_INTENSET: Enable interrupt */
  #define SPU_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* PERIPHACCERR @Bit 0 : Write '1' to enable interrupt for event PERIPHACCERR */
  #define SPU_INTENSET_PERIPHACCERR_Pos (0UL)        /*!< Position of PERIPHACCERR field.                                      */
  #define SPU_INTENSET_PERIPHACCERR_Msk (0x1UL << SPU_INTENSET_PERIPHACCERR_Pos) /*!< Bit mask of PERIPHACCERR field.          */
  #define SPU_INTENSET_PERIPHACCERR_Min (0x0UL)      /*!< Min enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTENSET_PERIPHACCERR_Max (0x1UL)      /*!< Max enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTENSET_PERIPHACCERR_Set (0x1UL)      /*!< Enable                                                               */
  #define SPU_INTENSET_PERIPHACCERR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SPU_INTENSET_PERIPHACCERR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* SPU_INTENCLR: Disable interrupt */
  #define SPU_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* PERIPHACCERR @Bit 0 : Write '1' to disable interrupt for event PERIPHACCERR */
  #define SPU_INTENCLR_PERIPHACCERR_Pos (0UL)        /*!< Position of PERIPHACCERR field.                                      */
  #define SPU_INTENCLR_PERIPHACCERR_Msk (0x1UL << SPU_INTENCLR_PERIPHACCERR_Pos) /*!< Bit mask of PERIPHACCERR field.          */
  #define SPU_INTENCLR_PERIPHACCERR_Min (0x0UL)      /*!< Min enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTENCLR_PERIPHACCERR_Max (0x1UL)      /*!< Max enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTENCLR_PERIPHACCERR_Clear (0x1UL)    /*!< Disable                                                              */
  #define SPU_INTENCLR_PERIPHACCERR_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SPU_INTENCLR_PERIPHACCERR_Enabled (0x1UL)  /*!< Read: Enabled                                                        */


/* SPU_INTPEND: Pending interrupts */
  #define SPU_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* PERIPHACCERR @Bit 0 : Read pending status of interrupt for event PERIPHACCERR */
  #define SPU_INTPEND_PERIPHACCERR_Pos (0UL)         /*!< Position of PERIPHACCERR field.                                      */
  #define SPU_INTPEND_PERIPHACCERR_Msk (0x1UL << SPU_INTPEND_PERIPHACCERR_Pos) /*!< Bit mask of PERIPHACCERR field.            */
  #define SPU_INTPEND_PERIPHACCERR_Min (0x0UL)       /*!< Min enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTPEND_PERIPHACCERR_Max (0x1UL)       /*!< Max enumerator value of PERIPHACCERR field.                          */
  #define SPU_INTPEND_PERIPHACCERR_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define SPU_INTPEND_PERIPHACCERR_Pending (0x1UL)   /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            SWI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct SWI ======================================================== */
/**
  * @brief Software interrupt
  */
  typedef struct {                                   /*!< SWI Structure                                                        */
    __IM uint32_t RESERVED;
  } NRF_SWI_Type;                                    /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            TAD                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TAD ======================================================== */
/**
  * @brief Trace and debug control
  */
  typedef struct {                                   /*!< TAD Structure                                                        */
    __IM uint32_t RESERVED[256];
    __IOM uint32_t SYSPWRUPREQ;                      /*!< (@ 0x00000400) System power-up request                               */
    __IOM uint32_t DBGPWRUPREQ;                      /*!< (@ 0x00000404) Debug power-up request                                */
    __IM uint32_t RESERVED1[62];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable debug domain and aquire selected GPIOs         */
    __IM uint32_t RESERVED2[5];
    __IOM uint32_t TRACEPORTSPEED;                   /*!< (@ 0x00000518) Trace port speed                                      */
    __IM uint32_t RESERVED3;
    __IOM uint32_t TINSTANCE;                        /*!< (@ 0x00000520) SW-DP Target instance                                 */
  } NRF_TAD_Type;                                    /*!< Size = 1316 (0x524)                                                  */

/* TAD_SYSPWRUPREQ: System power-up request */
  #define TAD_SYSPWRUPREQ_ResetValue (0x00000000UL)  /*!< Reset value of SYSPWRUPREQ register.                                 */

/* ACTIVE @Bit 0 : Activate power-up request */
  #define TAD_SYSPWRUPREQ_ACTIVE_Pos (0UL)           /*!< Position of ACTIVE field.                                            */
  #define TAD_SYSPWRUPREQ_ACTIVE_Msk (0x1UL << TAD_SYSPWRUPREQ_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.                      */
  #define TAD_SYSPWRUPREQ_ACTIVE_Min (0x0UL)         /*!< Min enumerator value of ACTIVE field.                                */
  #define TAD_SYSPWRUPREQ_ACTIVE_Max (0x1UL)         /*!< Max enumerator value of ACTIVE field.                                */
  #define TAD_SYSPWRUPREQ_ACTIVE_NotActive (0x0UL)   /*!< Power-up request not active                                          */
  #define TAD_SYSPWRUPREQ_ACTIVE_Active (0x1UL)      /*!< Power-up request active                                              */


/* TAD_DBGPWRUPREQ: Debug power-up request */
  #define TAD_DBGPWRUPREQ_ResetValue (0x00000000UL)  /*!< Reset value of DBGPWRUPREQ register.                                 */

/* ACTIVE @Bit 0 : Activate power-up request */
  #define TAD_DBGPWRUPREQ_ACTIVE_Pos (0UL)           /*!< Position of ACTIVE field.                                            */
  #define TAD_DBGPWRUPREQ_ACTIVE_Msk (0x1UL << TAD_DBGPWRUPREQ_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.                      */
  #define TAD_DBGPWRUPREQ_ACTIVE_Min (0x0UL)         /*!< Min enumerator value of ACTIVE field.                                */
  #define TAD_DBGPWRUPREQ_ACTIVE_Max (0x1UL)         /*!< Max enumerator value of ACTIVE field.                                */
  #define TAD_DBGPWRUPREQ_ACTIVE_NotActive (0x0UL)   /*!< Power-up request not active                                          */
  #define TAD_DBGPWRUPREQ_ACTIVE_Active (0x1UL)      /*!< Power-up request active                                              */


/* TAD_ENABLE: Enable debug domain and aquire selected GPIOs */
  #define TAD_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bit 0 : (unspecified) */
  #define TAD_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define TAD_ENABLE_ENABLE_Msk (0x1UL << TAD_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define TAD_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define TAD_ENABLE_ENABLE_Max (0x1UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define TAD_ENABLE_ENABLE_DISABLED (0x0UL)         /*!< Disable debug domain and release selected GPIOs                      */
  #define TAD_ENABLE_ENABLE_ENABLED (0x1UL)          /*!< Enable debug domain and aquire selected GPIOs                        */


