tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* TAD_TRACEPORTSPEED: Trace port speed */
  #define TAD_TRACEPORTSPEED_ResetValue (0x00000000UL) /*!< Reset value of TRACEPORTSPEED register.                            */

/* TRACEPORTSPEED @Bits 0..1 : Trace port speed is divided from CPU clock. The TRACECLK pin output will be divided again by two
                               from the trace port clock. */

  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Pos (0UL) /*!< Position of TRACEPORTSPEED field.                                   */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Msk (0x3UL << TAD_TRACEPORTSPEED_TRACEPORTSPEED_Pos) /*!< Bit mask of TRACEPORTSPEED
                                                                            field.*/
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Min (0x0UL) /*!< Min enumerator value of TRACEPORTSPEED field.                     */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_Max (0x3UL) /*!< Max enumerator value of TRACEPORTSPEED field.                     */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_DIV1 (0x0UL) /*!< Trace port speed equals CPU clock                                */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_DIV2 (0x1UL) /*!< Trace port speed equals CPU clock divided by 2                   */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_DIV4 (0x2UL) /*!< Trace port speed equals CPU clock divided by 4                   */
  #define TAD_TRACEPORTSPEED_TRACEPORTSPEED_DIV32 (0x3UL) /*!< Trace port speed equals CPU clock divided by 32                 */


/* TAD_TINSTANCE: SW-DP Target instance */
  #define TAD_TINSTANCE_ResetValue (0x00000000UL)    /*!< Reset value of TINSTANCE register.                                   */

/* TINSTANCE @Bits 0..3 : TINSTANCE bits are used in the SW-DP DLPIDR.TINSTANCE field. */
  #define TAD_TINSTANCE_TINSTANCE_Pos (0UL)          /*!< Position of TINSTANCE field.                                         */
  #define TAD_TINSTANCE_TINSTANCE_Msk (0xFUL << TAD_TINSTANCE_TINSTANCE_Pos) /*!< Bit mask of TINSTANCE field.                 */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TAMPC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TAMPC_ACTIVESHIELD ================================================ */
/**
  * @brief ACTIVESHIELD [TAMPC_ACTIVESHIELD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CHEN;                              /*!< (@ 0x00000000) Active shield detector channel enable register.       */
} NRF_TAMPC_ACTIVESHIELD_Type;                       /*!< Size = 4 (0x004)                                                     */

/* TAMPC_ACTIVESHIELD_CHEN: Active shield detector channel enable register. */
  #define TAMPC_ACTIVESHIELD_CHEN_ResetValue (0x00000000UL) /*!< Reset value of CHEN register.                                 */

/* CH0 @Bit 0 : Enable or disable active shield channel 0. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Pos (0UL)      /*!< Position of CH0 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH0_Pos) /*!< Bit mask of CH0 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Min (0x0UL)    /*!< Min enumerator value of CH0 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Max (0x1UL)    /*!< Max enumerator value of CH0 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH0_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH1 @Bit 1 : Enable or disable active shield channel 1. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Pos (1UL)      /*!< Position of CH1 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH1_Pos) /*!< Bit mask of CH1 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Min (0x0UL)    /*!< Min enumerator value of CH1 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Max (0x1UL)    /*!< Max enumerator value of CH1 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH1_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH2 @Bit 2 : Enable or disable active shield channel 2. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Pos (2UL)      /*!< Position of CH2 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH2_Pos) /*!< Bit mask of CH2 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Min (0x0UL)    /*!< Min enumerator value of CH2 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Max (0x1UL)    /*!< Max enumerator value of CH2 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH2_Enabled (0x1UL) /*!< Enable channel.                                                     */

/* CH3 @Bit 3 : Enable or disable active shield channel 3. */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Pos (3UL)      /*!< Position of CH3 field.                                               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Msk (0x1UL << TAMPC_ACTIVESHIELD_CHEN_CH3_Pos) /*!< Bit mask of CH3 field.               */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Min (0x0UL)    /*!< Min enumerator value of CH3 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Max (0x1UL)    /*!< Max enumerator value of CH3 field.                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Disabled (0x0UL) /*!< Disable channel.                                                   */
  #define TAMPC_ACTIVESHIELD_CHEN_CH3_Enabled (0x1UL) /*!< Enable channel.                                                     */



/* ============================================ Struct TAMPC_PROTECT_DOMAIN_DBGEN ============================================ */
/**
  * @brief DBGEN [TAMPC_PROTECT_DOMAIN_DBGEN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRL;                              /*!< (@ 0x00000000) Control register for invasive (halting) debug enable
                                                                         for the local debug components within domain n.*/
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register for invasive (halting) debug enable for
                                                                         domain n.*/
} NRF_TAMPC_PROTECT_DOMAIN_DBGEN_Type;               /*!< Size = 8 (0x008)                                                     */

/* TAMPC_PROTECT_DOMAIN_DBGEN_CTRL: Control register for invasive (halting) debug enable for the local debug components within
                                     domain n. */

  #define TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_ResetValue (0x00000010UL) /*!< Reset value of CTRL register.                         */

