tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
  #define TPIU_TPRCR_ResetValue (0x00000000UL)       /*!< Reset value of TPRCR register.                                       */

/* PATTCOUNT @Bits 0..7 : 8-bit counter value to indicate the number of traceclkin cycles for which a pattern runs before it
                          switches to the next pattern. */

  #define TPIU_TPRCR_PATTCOUNT_Pos (0UL)             /*!< Position of PATTCOUNT field.                                         */
  #define TPIU_TPRCR_PATTCOUNT_Msk (0xFFUL << TPIU_TPRCR_PATTCOUNT_Pos) /*!< Bit mask of PATTCOUNT field.                      */
  #define TPIU_TPRCR_PATTCOUNT_Min (0x00UL)          /*!< Min value of PATTCOUNT field.                                        */
  #define TPIU_TPRCR_PATTCOUNT_Max (0xFFUL)          /*!< Max size of PATTCOUNT field.                                         */


/* TPIU_FFSR: The FFSR register indicates the current status of the formatter and flush features available in the TPIU. */
  #define TPIU_FFSR_ResetValue (0x00000000UL)        /*!< Reset value of FFSR register.                                        */

/* FLINPROG @Bit 0 : Flush in progress. */
  #define TPIU_FFSR_FLINPROG_Pos (0UL)               /*!< Position of FLINPROG field.                                          */
  #define TPIU_FFSR_FLINPROG_Msk (0x1UL << TPIU_FFSR_FLINPROG_Pos) /*!< Bit mask of FLINPROG field.                            */
  #define TPIU_FFSR_FLINPROG_Min (0x0UL)             /*!< Min enumerator value of FLINPROG field.                              */
  #define TPIU_FFSR_FLINPROG_Max (0x1UL)             /*!< Max enumerator value of FLINPROG field.                              */
  #define TPIU_FFSR_FLINPROG_NotInProgress (0x0UL)   /*!< A flush is not in progress.                                          */
  #define TPIU_FFSR_FLINPROG_InProgress (0x1UL)      /*!< A flush is in progress.                                              */

/* FTSTOPPED @Bit 1 : The formatter has received a stop request signal and all trace data and post-amble is sent. Any additional
                      trace data on the ATB interface is ignored and atreadys goes HIGH. */

  #define TPIU_FFSR_FTSTOPPED_Pos (1UL)              /*!< Position of FTSTOPPED field.                                         */
  #define TPIU_FFSR_FTSTOPPED_Msk (0x1UL << TPIU_FFSR_FTSTOPPED_Pos) /*!< Bit mask of FTSTOPPED field.                         */
  #define TPIU_FFSR_FTSTOPPED_Min (0x0UL)            /*!< Min enumerator value of FTSTOPPED field.                             */
  #define TPIU_FFSR_FTSTOPPED_Max (0x1UL)            /*!< Max enumerator value of FTSTOPPED field.                             */
  #define TPIU_FFSR_FTSTOPPED_Running (0x0UL)        /*!< Formatter has not stopped.                                           */
  #define TPIU_FFSR_FTSTOPPED_Stopped (0x1UL)        /*!< Formatter has stopped.                                               */

/* TCPRESENT @Bit 2 : Indicates whether the TRACECTL pin is available for use. */
  #define TPIU_FFSR_TCPRESENT_Pos (2UL)              /*!< Position of TCPRESENT field.                                         */
  #define TPIU_FFSR_TCPRESENT_Msk (0x1UL << TPIU_FFSR_TCPRESENT_Pos) /*!< Bit mask of TCPRESENT field.                         */
  #define TPIU_FFSR_TCPRESENT_Min (0x0UL)            /*!< Min enumerator value of TCPRESENT field.                             */
  #define TPIU_FFSR_TCPRESENT_Max (0x1UL)            /*!< Max enumerator value of TCPRESENT field.                             */
  #define TPIU_FFSR_TCPRESENT_NotPresent (0x0UL)     /*!< TRACECTL pin is not present.                                         */
  #define TPIU_FFSR_TCPRESENT_Present (0x1UL)        /*!< TRACECTL pin is present.                                             */


/* TPIU_FFCR: The FFCR register controls the generation of stop, trigger, and flush events. */
  #define TPIU_FFCR_ResetValue (0x00000000UL)        /*!< Reset value of FFCR register.                                        */

/* ENFTC @Bit 0 : Do not embed triggers into the formatted stream. Trace disable cycles and triggers are indicated by tracectl,
                  where present. */

  #define TPIU_FFCR_ENFTC_Pos (0UL)                  /*!< Position of ENFTC field.                                             */
  #define TPIU_FFCR_ENFTC_Msk (0x1UL << TPIU_FFCR_ENFTC_Pos) /*!< Bit mask of ENFTC field.                                     */
  #define TPIU_FFCR_ENFTC_Min (0x0UL)                /*!< Min enumerator value of ENFTC field.                                 */
  #define TPIU_FFCR_ENFTC_Max (0x1UL)                /*!< Max enumerator value of ENFTC field.                                 */
  #define TPIU_FFCR_ENFTC_Disabled (0x0UL)           /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_ENFTC_Enabled (0x1UL)            /*!< The formatting feature is enabled.                                   */

/* ENFCONT @Bit 1 : Is embedded in trigger packets and indicates that no cycle is using sync packets. */
  #define TPIU_FFCR_ENFCONT_Pos (1UL)                /*!< Position of ENFCONT field.                                           */
  #define TPIU_FFCR_ENFCONT_Msk (0x1UL << TPIU_FFCR_ENFCONT_Pos) /*!< Bit mask of ENFCONT field.                               */
  #define TPIU_FFCR_ENFCONT_Min (0x0UL)              /*!< Min enumerator value of ENFCONT field.                               */
  #define TPIU_FFCR_ENFCONT_Max (0x1UL)              /*!< Max enumerator value of ENFCONT field.                               */
  #define TPIU_FFCR_ENFCONT_Disabled (0x0UL)         /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_ENFCONT_Enabled (0x1UL)          /*!< The formatting feature is enabled.                                   */

/* FONFLIN @Bit 4 : Enables the use of the flushin connection. */
  #define TPIU_FFCR_FONFLIN_Pos (4UL)                /*!< Position of FONFLIN field.                                           */
  #define TPIU_FFCR_FONFLIN_Msk (0x1UL << TPIU_FFCR_FONFLIN_Pos) /*!< Bit mask of FONFLIN field.                               */
  #define TPIU_FFCR_FONFLIN_Min (0x0UL)              /*!< Min enumerator value of FONFLIN field.                               */
  #define TPIU_FFCR_FONFLIN_Max (0x1UL)              /*!< Max enumerator value of FONFLIN field.                               */
  #define TPIU_FFCR_FONFLIN_Disabled (0x0UL)         /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_FONFLIN_Enabled (0x1UL)          /*!< The formatting feature is enabled.                                   */

/* FONTRIG @Bit 5 : Initiates a manual flush of data in the system when a trigger event occurs. */
  #define TPIU_FFCR_FONTRIG_Pos (5UL)                /*!< Position of FONTRIG field.                                           */
  #define TPIU_FFCR_FONTRIG_Msk (0x1UL << TPIU_FFCR_FONTRIG_Pos) /*!< Bit mask of FONTRIG field.                               */
  #define TPIU_FFCR_FONTRIG_Min (0x0UL)              /*!< Min enumerator value of FONTRIG field.                               */
  #define TPIU_FFCR_FONTRIG_Max (0x1UL)              /*!< Max enumerator value of FONTRIG field.                               */
  #define TPIU_FFCR_FONTRIG_Disabled (0x0UL)         /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_FONTRIG_Enabled (0x1UL)          /*!< The formatting feature is enabled.                                   */

/* FONMANR @Bit 6 : Generates a flush. This bit is set to 0 when this flush is serviced. */
  #define TPIU_FFCR_FONMANR_Pos (6UL)                /*!< Position of FONMANR field.                                           */
  #define TPIU_FFCR_FONMANR_Msk (0x1UL << TPIU_FFCR_FONMANR_Pos) /*!< Bit mask of FONMANR field.                               */
  #define TPIU_FFCR_FONMANR_Min (0x0UL)              /*!< Min enumerator value of FONMANR field.                               */
  #define TPIU_FFCR_FONMANR_Max (0x1UL)              /*!< Max enumerator value of FONMANR field.                               */
  #define TPIU_FFCR_FONMANR_Disabled (0x0UL)         /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_FONMANR_Enabled (0x1UL)          /*!< The formatting feature is enabled.                                   */

/* FONMANW @Bit 7 : Generates a flush. This bit is set to 1 when this flush is serviced. */
  #define TPIU_FFCR_FONMANW_Pos (7UL)                /*!< Position of FONMANW field.                                           */
  #define TPIU_FFCR_FONMANW_Msk (0x1UL << TPIU_FFCR_FONMANW_Pos) /*!< Bit mask of FONMANW field.                               */
  #define TPIU_FFCR_FONMANW_Min (0x0UL)              /*!< Min enumerator value of FONMANW field.                               */
  #define TPIU_FFCR_FONMANW_Max (0x1UL)              /*!< Max enumerator value of FONMANW field.                               */
  #define TPIU_FFCR_FONMANW_Disabled (0x0UL)         /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_FONMANW_Enabled (0x1UL)          /*!< The formatting feature is enabled.                                   */

/* TRIGIN @Bit 8 : Indicates a trigger when trigin is asserted. */
  #define TPIU_FFCR_TRIGIN_Pos (8UL)                 /*!< Position of TRIGIN field.                                            */
  #define TPIU_FFCR_TRIGIN_Msk (0x1UL << TPIU_FFCR_TRIGIN_Pos) /*!< Bit mask of TRIGIN field.                                  */
  #define TPIU_FFCR_TRIGIN_Min (0x0UL)               /*!< Min enumerator value of TRIGIN field.                                */
  #define TPIU_FFCR_TRIGIN_Max (0x1UL)               /*!< Max enumerator value of TRIGIN field.                                */
  #define TPIU_FFCR_TRIGIN_Disabled (0x0UL)          /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_TRIGIN_Enabled (0x1UL)           /*!< The formatting feature is enabled.                                   */

