tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* ATDATA2 @Bit 2 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA2_Pos (2UL)          /*!< Position of ATDATA2 field.                                           */
  #define TPIU_ITATBDATA0_ATDATA2_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA2_Pos) /*!< Bit mask of ATDATA2 field.                   */
  #define TPIU_ITATBDATA0_ATDATA2_Min (0x0UL)        /*!< Min enumerator value of ATDATA2 field.                               */
  #define TPIU_ITATBDATA0_ATDATA2_Max (0x1UL)        /*!< Max enumerator value of ATDATA2 field.                               */
  #define TPIU_ITATBDATA0_ATDATA2_Low (0x0UL)        /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBDATA0_ATDATA2_High (0x1UL)       /*!< Pin is logic 1.                                                      */

/* ATDATA3 @Bit 3 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA3_Pos (3UL)          /*!< Position of ATDATA3 field.                                           */
  #define TPIU_ITATBDATA0_ATDATA3_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA3_Pos) /*!< Bit mask of ATDATA3 field.                   */
  #define TPIU_ITATBDATA0_ATDATA3_Min (0x0UL)        /*!< Min enumerator value of ATDATA3 field.                               */
  #define TPIU_ITATBDATA0_ATDATA3_Max (0x1UL)        /*!< Max enumerator value of ATDATA3 field.                               */
  #define TPIU_ITATBDATA0_ATDATA3_Low (0x0UL)        /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBDATA0_ATDATA3_High (0x1UL)       /*!< Pin is logic 1.                                                      */

/* ATDATA4 @Bit 4 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA4_Pos (4UL)          /*!< Position of ATDATA4 field.                                           */
  #define TPIU_ITATBDATA0_ATDATA4_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA4_Pos) /*!< Bit mask of ATDATA4 field.                   */
  #define TPIU_ITATBDATA0_ATDATA4_Min (0x0UL)        /*!< Min enumerator value of ATDATA4 field.                               */
  #define TPIU_ITATBDATA0_ATDATA4_Max (0x1UL)        /*!< Max enumerator value of ATDATA4 field.                               */
  #define TPIU_ITATBDATA0_ATDATA4_Low (0x0UL)        /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBDATA0_ATDATA4_High (0x1UL)       /*!< Pin is logic 1.                                                      */


/* TPIU_ITATBCTR2: Enables control of the atreadys and afvalids outputs of the TPIU. */
  #define TPIU_ITATBCTR2_ResetValue (0x00000000UL)   /*!< Reset value of ITATBCTR2 register.                                   */

/* ATREADY @Bit 0 : Sets the value of afvalid. */
  #define TPIU_ITATBCTR2_ATREADY_Pos (0UL)           /*!< Position of ATREADY field.                                           */
  #define TPIU_ITATBCTR2_ATREADY_Msk (0x1UL << TPIU_ITATBCTR2_ATREADY_Pos) /*!< Bit mask of ATREADY field.                     */
  #define TPIU_ITATBCTR2_ATREADY_Min (0x0UL)         /*!< Min enumerator value of ATREADY field.                               */
  #define TPIU_ITATBCTR2_ATREADY_Max (0x1UL)         /*!< Max enumerator value of ATREADY field.                               */
  #define TPIU_ITATBCTR2_ATREADY_Low (0x0UL)         /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBCTR2_ATREADY_High (0x1UL)        /*!< Pin is logic 1.                                                      */

/* AFVALID @Bit 1 : Sets the value of atready. */
  #define TPIU_ITATBCTR2_AFVALID_Pos (1UL)           /*!< Position of AFVALID field.                                           */
  #define TPIU_ITATBCTR2_AFVALID_Msk (0x1UL << TPIU_ITATBCTR2_AFVALID_Pos) /*!< Bit mask of AFVALID field.                     */
  #define TPIU_ITATBCTR2_AFVALID_Min (0x0UL)         /*!< Min enumerator value of AFVALID field.                               */
  #define TPIU_ITATBCTR2_AFVALID_Max (0x1UL)         /*!< Max enumerator value of AFVALID field.                               */
  #define TPIU_ITATBCTR2_AFVALID_Low (0x0UL)         /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBCTR2_AFVALID_High (0x1UL)        /*!< Pin is logic 1.                                                      */


/* TPIU_ITATBCTR1: The ITATBCTR1 register contains the value of the atids input to the TPIU. This is only valid when atvalids is
                    HIGH. */

  #define TPIU_ITATBCTR1_ResetValue (0x00000000UL)   /*!< Reset value of ITATBCTR1 register.                                   */

/* ATID @Bits 0..6 : Reads the value of atids. */
  #define TPIU_ITATBCTR1_ATID_Pos (0UL)              /*!< Position of ATID field.                                              */
  #define TPIU_ITATBCTR1_ATID_Msk (0x7FUL << TPIU_ITATBCTR1_ATID_Pos) /*!< Bit mask of ATID field.                             */
  #define TPIU_ITATBCTR1_ATID_Min (0x0UL)            /*!< Min enumerator value of ATID field.                                  */
  #define TPIU_ITATBCTR1_ATID_Max (0x1UL)            /*!< Max enumerator value of ATID field.                                  */
  #define TPIU_ITATBCTR1_ATID_Low (0x00UL)           /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBCTR1_ATID_High (0x01UL)          /*!< Pin is logic 1.                                                      */


/* TPIU_ITATBCTR0: The ITATBCTR0 register captures the values of the atvalids, afreadys, and atbytess inputs to the TPIU. To
                    ensure the integration registers work correctly in a system, the value of atbytess is only valid when
                    atvalids, bit[0], is HIGH. */

