tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* TPIU_DEVTYPE: The DEVTYPE register provides a debugger with information about the component when the Part Number field is not
                  recognized. The debugger can then report this information. */

  #define TPIU_DEVTYPE_ResetValue (0x00000000UL)     /*!< Reset value of DEVTYPE register.                                     */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define TPIU_DEVTYPE_MAJOR_Pos (0UL)               /*!< Position of MAJOR field.                                             */
  #define TPIU_DEVTYPE_MAJOR_Msk (0xFUL << TPIU_DEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                               */
  #define TPIU_DEVTYPE_MAJOR_Min (0x1UL)             /*!< Min enumerator value of MAJOR field.                                 */
  #define TPIU_DEVTYPE_MAJOR_Max (0x1UL)             /*!< Max enumerator value of MAJOR field.                                 */
  #define TPIU_DEVTYPE_MAJOR_TraceSource (0x1UL)     /*!< Peripheral is a trace sink.                                          */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define TPIU_DEVTYPE_SUB_Pos (4UL)                 /*!< Position of SUB field.                                               */
  #define TPIU_DEVTYPE_SUB_Msk (0xFUL << TPIU_DEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                     */
  #define TPIU_DEVTYPE_SUB_Min (0x1UL)               /*!< Min enumerator value of SUB field.                                   */
  #define TPIU_DEVTYPE_SUB_Max (0x1UL)               /*!< Max enumerator value of SUB field.                                   */
  #define TPIU_DEVTYPE_SUB_TracePort (0x1UL)         /*!< Indicates that this component is a trace port component.             */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            TWI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct TWI_PSEL ===================================================== */
/**
  * @brief PSEL [TWI_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCL;                               /*!< (@ 0x00000000) Pin select for SCL                                    */
  __IOM uint32_t  SDA;                               /*!< (@ 0x00000004) Pin select for SDA                                    */
} NRF_TWI_PSEL_Type;                                 /*!< Size = 8 (0x008)                                                     */

/* TWI_PSEL_SCL: Pin select for SCL */
  #define TWI_PSEL_SCL_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of SCL register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TWI_PSEL_SCL_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define TWI_PSEL_SCL_PIN_Msk (0x1FUL << TWI_PSEL_SCL_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define TWI_PSEL_SCL_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define TWI_PSEL_SCL_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bit 5 : Port number */
  #define TWI_PSEL_SCL_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define TWI_PSEL_SCL_PORT_Msk (0x1UL << TWI_PSEL_SCL_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define TWI_PSEL_SCL_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define TWI_PSEL_SCL_PORT_Max (0x1UL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TWI_PSEL_SCL_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define TWI_PSEL_SCL_CONNECT_Msk (0x1UL << TWI_PSEL_SCL_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define TWI_PSEL_SCL_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define TWI_PSEL_SCL_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define TWI_PSEL_SCL_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define TWI_PSEL_SCL_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* TWI_PSEL_SDA: Pin select for SDA */
  #define TWI_PSEL_SDA_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of SDA register.                                         */

/* PIN @Bits 0..4 : Pin number */
  #define TWI_PSEL_SDA_PIN_Pos (0UL)                 /*!< Position of PIN field.                                               */
  #define TWI_PSEL_SDA_PIN_Msk (0x1FUL << TWI_PSEL_SDA_PIN_Pos) /*!< Bit mask of PIN field.                                    */
  #define TWI_PSEL_SDA_PIN_Min (0x00UL)              /*!< Min value of PIN field.                                              */
  #define TWI_PSEL_SDA_PIN_Max (0x1FUL)              /*!< Max size of PIN field.                                               */

/* PORT @Bit 5 : Port number */
  #define TWI_PSEL_SDA_PORT_Pos (5UL)                /*!< Position of PORT field.                                              */
  #define TWI_PSEL_SDA_PORT_Msk (0x1UL << TWI_PSEL_SDA_PORT_Pos) /*!< Bit mask of PORT field.                                  */
  #define TWI_PSEL_SDA_PORT_Min (0x0UL)              /*!< Min value of PORT field.                                             */
  #define TWI_PSEL_SDA_PORT_Max (0x1UL)              /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define TWI_PSEL_SDA_CONNECT_Pos (31UL)            /*!< Position of CONNECT field.                                           */
  #define TWI_PSEL_SDA_CONNECT_Msk (0x1UL << TWI_PSEL_SDA_CONNECT_Pos) /*!< Bit mask of CONNECT field.                         */
  #define TWI_PSEL_SDA_CONNECT_Min (0x0UL)           /*!< Min enumerator value of CONNECT field.                               */
  #define TWI_PSEL_SDA_CONNECT_Max (0x1UL)           /*!< Max enumerator value of CONNECT field.                               */
  #define TWI_PSEL_SDA_CONNECT_Disconnected (0x1UL)  /*!< Disconnect                                                           */
  #define TWI_PSEL_SDA_CONNECT_Connected (0x0UL)     /*!< Connect                                                              */


/* ======================================================= Struct TWI ======================================================== */
/**
  * @brief I2C compatible Two-Wire Interface
  */
  typedef struct {                                   /*!< TWI Structure                                                        */
    __OM uint32_t TASKS_STARTRX;                     /*!< (@ 0x00000000) Start TWI receive sequence                            */
    __IM uint32_t RESERVED;
    __OM uint32_t TASKS_STARTTX;                     /*!< (@ 0x00000008) Start TWI transmit sequence                           */
    __IM uint32_t RESERVED1[2];
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000014) Stop TWI transaction                                  */
    __IM uint32_t RESERVED2;
    __OM uint32_t TASKS_SUSPEND;                     /*!< (@ 0x0000001C) Suspend TWI transaction                               */
    __OM uint32_t TASKS_RESUME;                      /*!< (@ 0x00000020) Resume TWI transaction                                */
    __IM uint32_t RESERVED3[23];
    __IOM uint32_t SUBSCRIBE_STARTRX;                /*!< (@ 0x00000080) Subscribe configuration for task STARTRX              */
    __IM uint32_t RESERVED4;
    __IOM uint32_t SUBSCRIBE_STARTTX;                /*!< (@ 0x00000088) Subscribe configuration for task STARTTX              */
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000094) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED6;
    __IOM uint32_t SUBSCRIBE_SUSPEND;                /*!< (@ 0x0000009C) Subscribe configuration for task SUSPEND              */
    __IOM uint32_t SUBSCRIBE_RESUME;                 /*!< (@ 0x000000A0) Subscribe configuration for task RESUME               */
    __IM uint32_t RESERVED7[24];
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) TWI stopped                                           */
    __IOM uint32_t EVENTS_RXDREADY;                  /*!< (@ 0x00000108) TWI RXD byte received                                 */
    __IM uint32_t RESERVED8[4];
    __IOM uint32_t EVENTS_TXDSENT;                   /*!< (@ 0x0000011C) TWI TXD byte sent                                     */
    __IM uint32_t RESERVED9;
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000124) TWI error                                             */
    __IM uint32_t RESERVED10[4];
    __IOM uint32_t EVENTS_BB;                        /*!< (@ 0x00000138) TWI byte boundary, generated before each byte that is
                                                                         sent or received*/
    __IM uint32_t RESERVED11[3];
    __IOM uint32_t EVENTS_SUSPENDED;                 /*!< (@ 0x00000148) TWI entered the suspended state                       */
    __IM uint32_t RESERVED12[14];
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IOM uint32_t PUBLISH_RXDREADY;                 /*!< (@ 0x00000188) Publish configuration for event RXDREADY              */
    __IM uint32_t RESERVED13[4];
    __IOM uint32_t PUBLISH_TXDSENT;                  /*!< (@ 0x0000019C) Publish configuration for event TXDSENT               */
    __IM uint32_t RESERVED14;
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x000001A4) Publish configuration for event ERROR                 */
    __IM uint32_t RESERVED15[4];
    __IOM uint32_t PUBLISH_BB;                       /*!< (@ 0x000001B8) Publish configuration for event BB                    */
    __IM uint32_t RESERVED16[3];
    __IOM uint32_t PUBLISH_SUSPENDED;                /*!< (@ 0x000001C8) Publish configuration for event SUSPENDED             */
    __IM uint32_t RESERVED17[13];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED18[64];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED19[110];
    __IOM uint32_t ERRORSRC;                         /*!< (@ 0x000004C4) Error source                                          */
    __IM uint32_t RESERVED20[14];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable TWI                                            */
    __IM uint32_t RESERVED21;
    __IOM NRF_TWI_PSEL_Type PSEL;                    /*!< (@ 0x00000508) (unspecified)                                         */
    __IM uint32_t RESERVED22[2];
    __IM uint32_t RXD;                               /*!< (@ 0x00000518) RXD register                                          */
    __IOM uint32_t TXD;                              /*!< (@ 0x0000051C) TXD register                                          */
    __IM uint32_t RESERVED23;
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000524) TWI frequency. Accuracy depends on the HFCLK source
                                                                         selected.*/
    __IM uint32_t RESERVED24[24];
    __IOM uint32_t ADDRESS;                          /*!< (@ 0x00000588) Address used in the TWI transfer                      */
  } NRF_TWI_Type;                                    /*!< Size = 1420 (0x58C)                                                  */

/* TWI_TASKS_STARTRX: Start TWI receive sequence */
  #define TWI_TASKS_STARTRX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTRX register.                              */

/* TASKS_STARTRX @Bit 0 : Start TWI receive sequence */
  #define TWI_TASKS_STARTRX_TASKS_STARTRX_Pos (0UL)  /*!< Position of TASKS_STARTRX field.                                     */
  #define TWI_TASKS_STARTRX_TASKS_STARTRX_Msk (0x1UL << TWI_TASKS_STARTRX_TASKS_STARTRX_Pos) /*!< Bit mask of TASKS_STARTRX
                                                                            field.*/
  #define TWI_TASKS_STARTRX_TASKS_STARTRX_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTRX field.                        */
  #define TWI_TASKS_STARTRX_TASKS_STARTRX_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTRX field.                        */
  #define TWI_TASKS_STARTRX_TASKS_STARTRX_Trigger (0x1UL) /*!< Trigger task                                                    */


/* TWI_TASKS_STARTTX: Start TWI transmit sequence */
  #define TWI_TASKS_STARTTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTTX register.                              */

/* TASKS_STARTTX @Bit 0 : Start TWI transmit sequence */
  #define TWI_TASKS_STARTTX_TASKS_STARTTX_Pos (0UL)  /*!< Position of TASKS_STARTTX field.                                     */
  #define TWI_TASKS_STARTTX_TASKS_STARTTX_Msk (0x1UL << TWI_TASKS_STARTTX_TASKS_STARTTX_Pos) /*!< Bit mask of TASKS_STARTTX
                                                                            field.*/
  #define TWI_TASKS_STARTTX_TASKS_STARTTX_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTTX field.                        */
  #define TWI_TASKS_STARTTX_TASKS_STARTTX_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTTX field.                        */
  #define TWI_TASKS_STARTTX_TASKS_STARTTX_Trigger (0x1UL) /*!< Trigger task                                                    */


/* TWI_TASKS_STOP: Stop TWI transaction */
  #define TWI_TASKS_STOP_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop TWI transaction */
  #define TWI_TASKS_STOP_TASKS_STOP_Pos (0UL)        /*!< Position of TASKS_STOP field.                                        */
  #define TWI_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TWI_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.            */
  #define TWI_TASKS_STOP_TASKS_STOP_Min (0x1UL)      /*!< Min enumerator value of TASKS_STOP field.                            */
  #define TWI_TASKS_STOP_TASKS_STOP_Max (0x1UL)      /*!< Max enumerator value of TASKS_STOP field.                            */
  #define TWI_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* TWI_TASKS_SUSPEND: Suspend TWI transaction */
  #define TWI_TASKS_SUSPEND_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SUSPEND register.                              */

/* TASKS_SUSPEND @Bit 0 : Suspend TWI transaction */
  #define TWI_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL)  /*!< Position of TASKS_SUSPEND field.                                     */
  #define TWI_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << TWI_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND
                                                                            field.*/
  #define TWI_TASKS_SUSPEND_TASKS_SUSPEND_Min (0x1UL) /*!< Min enumerator value of TASKS_SUSPEND field.                        */
  #define TWI_TASKS_SUSPEND_TASKS_SUSPEND_Max (0x1UL) /*!< Max enumerator value of TASKS_SUSPEND field.                        */
  #define TWI_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL) /*!< Trigger task                                                    */


/* TWI_TASKS_RESUME: Resume TWI transaction */
  #define TWI_TASKS_RESUME_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESUME register.                                */

/* TASKS_RESUME @Bit 0 : Resume TWI transaction */
  #define TWI_TASKS_RESUME_TASKS_RESUME_Pos (0UL)    /*!< Position of TASKS_RESUME field.                                      */
  #define TWI_TASKS_RESUME_TASKS_RESUME_Msk (0x1UL << TWI_TASKS_RESUME_TASKS_RESUME_Pos) /*!< Bit mask of TASKS_RESUME field.  */
  #define TWI_TASKS_RESUME_TASKS_RESUME_Min (0x1UL)  /*!< Min enumerator value of TASKS_RESUME field.                          */
  #define TWI_TASKS_RESUME_TASKS_RESUME_Max (0x1UL)  /*!< Max enumerator value of TASKS_RESUME field.                          */
  #define TWI_TASKS_RESUME_TASKS_RESUME_Trigger (0x1UL) /*!< Trigger task                                                      */


/* TWI_SUBSCRIBE_STARTRX: Subscribe configuration for task STARTRX */
  #define TWI_SUBSCRIBE_STARTRX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STARTRX register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task STARTRX will subscribe to */
  #define TWI_SUBSCRIBE_STARTRX_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define TWI_SUBSCRIBE_STARTRX_CHIDX_Msk (0xFFUL << TWI_SUBSCRIBE_STARTRX_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define TWI_SUBSCRIBE_STARTRX_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define TWI_SUBSCRIBE_STARTRX_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_SUBSCRIBE_STARTRX_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define TWI_SUBSCRIBE_STARTRX_EN_Msk (0x1UL << TWI_SUBSCRIBE_STARTRX_EN_Pos) /*!< Bit mask of EN field.                      */
  #define TWI_SUBSCRIBE_STARTRX_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_STARTRX_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_STARTRX_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define TWI_SUBSCRIBE_STARTRX_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* TWI_SUBSCRIBE_STARTTX: Subscribe configuration for task STARTTX */
  #define TWI_SUBSCRIBE_STARTTX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STARTTX register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task STARTTX will subscribe to */
  #define TWI_SUBSCRIBE_STARTTX_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define TWI_SUBSCRIBE_STARTTX_CHIDX_Msk (0xFFUL << TWI_SUBSCRIBE_STARTTX_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define TWI_SUBSCRIBE_STARTTX_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define TWI_SUBSCRIBE_STARTTX_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_SUBSCRIBE_STARTTX_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define TWI_SUBSCRIBE_STARTTX_EN_Msk (0x1UL << TWI_SUBSCRIBE_STARTTX_EN_Pos) /*!< Bit mask of EN field.                      */
  #define TWI_SUBSCRIBE_STARTTX_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_STARTTX_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_STARTTX_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define TWI_SUBSCRIBE_STARTTX_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* TWI_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define TWI_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                            */

