tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define TWI_SUBSCRIBE_STOP_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TWI_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << TWI_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TWI_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define TWI_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_SUBSCRIBE_STOP_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TWI_SUBSCRIBE_STOP_EN_Msk (0x1UL << TWI_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TWI_SUBSCRIBE_STOP_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_STOP_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_STOP_EN_Disabled (0x0UL)     /*!< Disable subscription                                                 */
  #define TWI_SUBSCRIBE_STOP_EN_Enabled (0x1UL)      /*!< Enable subscription                                                  */


/* TWI_SUBSCRIBE_SUSPEND: Subscribe configuration for task SUSPEND */
  #define TWI_SUBSCRIBE_SUSPEND_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SUSPEND register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task SUSPEND will subscribe to */
  #define TWI_SUBSCRIBE_SUSPEND_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define TWI_SUBSCRIBE_SUSPEND_CHIDX_Msk (0xFFUL << TWI_SUBSCRIBE_SUSPEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define TWI_SUBSCRIBE_SUSPEND_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define TWI_SUBSCRIBE_SUSPEND_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_SUBSCRIBE_SUSPEND_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define TWI_SUBSCRIBE_SUSPEND_EN_Msk (0x1UL << TWI_SUBSCRIBE_SUSPEND_EN_Pos) /*!< Bit mask of EN field.                      */
  #define TWI_SUBSCRIBE_SUSPEND_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_SUSPEND_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_SUSPEND_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define TWI_SUBSCRIBE_SUSPEND_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* TWI_SUBSCRIBE_RESUME: Subscribe configuration for task RESUME */
  #define TWI_SUBSCRIBE_RESUME_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RESUME register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task RESUME will subscribe to */
  #define TWI_SUBSCRIBE_RESUME_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TWI_SUBSCRIBE_RESUME_CHIDX_Msk (0xFFUL << TWI_SUBSCRIBE_RESUME_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TWI_SUBSCRIBE_RESUME_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TWI_SUBSCRIBE_RESUME_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_SUBSCRIBE_RESUME_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TWI_SUBSCRIBE_RESUME_EN_Msk (0x1UL << TWI_SUBSCRIBE_RESUME_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TWI_SUBSCRIBE_RESUME_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_RESUME_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TWI_SUBSCRIBE_RESUME_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define TWI_SUBSCRIBE_RESUME_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* TWI_EVENTS_STOPPED: TWI stopped */
  #define TWI_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                            */

/* EVENTS_STOPPED @Bit 0 : TWI stopped */
  #define TWI_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                   */
  #define TWI_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << TWI_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/
  #define TWI_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                     */
  #define TWI_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                     */
  #define TWI_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define TWI_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                             */


/* TWI_EVENTS_RXDREADY: TWI RXD byte received */
  #define TWI_EVENTS_RXDREADY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXDREADY register.                          */

/* EVENTS_RXDREADY @Bit 0 : TWI RXD byte received */
  #define TWI_EVENTS_RXDREADY_EVENTS_RXDREADY_Pos (0UL) /*!< Position of EVENTS_RXDREADY field.                                */
  #define TWI_EVENTS_RXDREADY_EVENTS_RXDREADY_Msk (0x1UL << TWI_EVENTS_RXDREADY_EVENTS_RXDREADY_Pos) /*!< Bit mask of
                                                                            EVENTS_RXDREADY field.*/
  #define TWI_EVENTS_RXDREADY_EVENTS_RXDREADY_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXDREADY field.                  */
  #define TWI_EVENTS_RXDREADY_EVENTS_RXDREADY_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXDREADY field.                  */
  #define TWI_EVENTS_RXDREADY_EVENTS_RXDREADY_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TWI_EVENTS_RXDREADY_EVENTS_RXDREADY_Generated (0x1UL) /*!< Event generated                                           */


/* TWI_EVENTS_TXDSENT: TWI TXD byte sent */
  #define TWI_EVENTS_TXDSENT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXDSENT register.                            */

