tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* EVENTS_TXDSENT @Bit 0 : TWI TXD byte sent */
  #define TWI_EVENTS_TXDSENT_EVENTS_TXDSENT_Pos (0UL) /*!< Position of EVENTS_TXDSENT field.                                   */
  #define TWI_EVENTS_TXDSENT_EVENTS_TXDSENT_Msk (0x1UL << TWI_EVENTS_TXDSENT_EVENTS_TXDSENT_Pos) /*!< Bit mask of EVENTS_TXDSENT
                                                                            field.*/
  #define TWI_EVENTS_TXDSENT_EVENTS_TXDSENT_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXDSENT field.                     */
  #define TWI_EVENTS_TXDSENT_EVENTS_TXDSENT_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXDSENT field.                     */
  #define TWI_EVENTS_TXDSENT_EVENTS_TXDSENT_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define TWI_EVENTS_TXDSENT_EVENTS_TXDSENT_Generated (0x1UL) /*!< Event generated                                             */


/* TWI_EVENTS_ERROR: TWI error */
  #define TWI_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                                */

/* EVENTS_ERROR @Bit 0 : TWI error */
  #define TWI_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)    /*!< Position of EVENTS_ERROR field.                                      */
  #define TWI_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << TWI_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field.  */
  #define TWI_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)  /*!< Min enumerator value of EVENTS_ERROR field.                          */
  #define TWI_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)  /*!< Max enumerator value of EVENTS_ERROR field.                          */
  #define TWI_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define TWI_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                                 */


/* TWI_EVENTS_BB: TWI byte boundary, generated before each byte that is sent or received */
  #define TWI_EVENTS_BB_ResetValue (0x00000000UL)    /*!< Reset value of EVENTS_BB register.                                   */

/* EVENTS_BB @Bit 0 : TWI byte boundary, generated before each byte that is sent or received */
  #define TWI_EVENTS_BB_EVENTS_BB_Pos (0UL)          /*!< Position of EVENTS_BB field.                                         */
  #define TWI_EVENTS_BB_EVENTS_BB_Msk (0x1UL << TWI_EVENTS_BB_EVENTS_BB_Pos) /*!< Bit mask of EVENTS_BB field.                 */
  #define TWI_EVENTS_BB_EVENTS_BB_Min (0x0UL)        /*!< Min enumerator value of EVENTS_BB field.                             */
  #define TWI_EVENTS_BB_EVENTS_BB_Max (0x1UL)        /*!< Max enumerator value of EVENTS_BB field.                             */
  #define TWI_EVENTS_BB_EVENTS_BB_NotGenerated (0x0UL) /*!< Event not generated                                                */
  #define TWI_EVENTS_BB_EVENTS_BB_Generated (0x1UL)  /*!< Event generated                                                      */


/* TWI_EVENTS_SUSPENDED: TWI entered the suspended state */
  #define TWI_EVENTS_SUSPENDED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SUSPENDED register.                        */

/* EVENTS_SUSPENDED @Bit 0 : TWI entered the suspended state */
  #define TWI_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Pos (0UL) /*!< Position of EVENTS_SUSPENDED field.                             */
  #define TWI_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Msk (0x1UL << TWI_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Pos) /*!< Bit mask of
                                                                            EVENTS_SUSPENDED field.*/
  #define TWI_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Min (0x0UL) /*!< Min enumerator value of EVENTS_SUSPENDED field.               */
  #define TWI_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Max (0x1UL) /*!< Max enumerator value of EVENTS_SUSPENDED field.               */
  #define TWI_EVENTS_SUSPENDED_EVENTS_SUSPENDED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define TWI_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Generated (0x1UL) /*!< Event generated                                         */


/* TWI_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define TWI_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define TWI_PUBLISH_STOPPED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TWI_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << TWI_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TWI_PUBLISH_STOPPED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TWI_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_PUBLISH_STOPPED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TWI_PUBLISH_STOPPED_EN_Msk (0x1UL << TWI_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TWI_PUBLISH_STOPPED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TWI_PUBLISH_STOPPED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TWI_PUBLISH_STOPPED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TWI_PUBLISH_STOPPED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TWI_PUBLISH_RXDREADY: Publish configuration for event RXDREADY */
  #define TWI_PUBLISH_RXDREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXDREADY register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event RXDREADY will publish to */
  #define TWI_PUBLISH_RXDREADY_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TWI_PUBLISH_RXDREADY_CHIDX_Msk (0xFFUL << TWI_PUBLISH_RXDREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TWI_PUBLISH_RXDREADY_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TWI_PUBLISH_RXDREADY_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_PUBLISH_RXDREADY_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TWI_PUBLISH_RXDREADY_EN_Msk (0x1UL << TWI_PUBLISH_RXDREADY_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TWI_PUBLISH_RXDREADY_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TWI_PUBLISH_RXDREADY_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TWI_PUBLISH_RXDREADY_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TWI_PUBLISH_RXDREADY_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


