tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* TWI_PUBLISH_TXDSENT: Publish configuration for event TXDSENT */
  #define TWI_PUBLISH_TXDSENT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXDSENT register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event TXDSENT will publish to */
  #define TWI_PUBLISH_TXDSENT_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TWI_PUBLISH_TXDSENT_CHIDX_Msk (0xFFUL << TWI_PUBLISH_TXDSENT_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TWI_PUBLISH_TXDSENT_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TWI_PUBLISH_TXDSENT_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_PUBLISH_TXDSENT_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TWI_PUBLISH_TXDSENT_EN_Msk (0x1UL << TWI_PUBLISH_TXDSENT_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TWI_PUBLISH_TXDSENT_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TWI_PUBLISH_TXDSENT_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TWI_PUBLISH_TXDSENT_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TWI_PUBLISH_TXDSENT_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TWI_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define TWI_PUBLISH_ERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ERROR register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define TWI_PUBLISH_ERROR_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define TWI_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << TWI_PUBLISH_ERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define TWI_PUBLISH_ERROR_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define TWI_PUBLISH_ERROR_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_PUBLISH_ERROR_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define TWI_PUBLISH_ERROR_EN_Msk (0x1UL << TWI_PUBLISH_ERROR_EN_Pos) /*!< Bit mask of EN field.                              */
  #define TWI_PUBLISH_ERROR_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define TWI_PUBLISH_ERROR_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define TWI_PUBLISH_ERROR_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define TWI_PUBLISH_ERROR_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* TWI_PUBLISH_BB: Publish configuration for event BB */
  #define TWI_PUBLISH_BB_ResetValue (0x00000000UL)   /*!< Reset value of PUBLISH_BB register.                                  */

/* CHIDX @Bits 0..7 : DPPI channel that event BB will publish to */
  #define TWI_PUBLISH_BB_CHIDX_Pos (0UL)             /*!< Position of CHIDX field.                                             */
  #define TWI_PUBLISH_BB_CHIDX_Msk (0xFFUL << TWI_PUBLISH_BB_CHIDX_Pos) /*!< Bit mask of CHIDX field.                          */
  #define TWI_PUBLISH_BB_CHIDX_Min (0x00UL)          /*!< Min value of CHIDX field.                                            */
  #define TWI_PUBLISH_BB_CHIDX_Max (0xFFUL)          /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_PUBLISH_BB_EN_Pos (31UL)               /*!< Position of EN field.                                                */
  #define TWI_PUBLISH_BB_EN_Msk (0x1UL << TWI_PUBLISH_BB_EN_Pos) /*!< Bit mask of EN field.                                    */
  #define TWI_PUBLISH_BB_EN_Min (0x0UL)              /*!< Min enumerator value of EN field.                                    */
  #define TWI_PUBLISH_BB_EN_Max (0x1UL)              /*!< Max enumerator value of EN field.                                    */
  #define TWI_PUBLISH_BB_EN_Disabled (0x0UL)         /*!< Disable publishing                                                   */
  #define TWI_PUBLISH_BB_EN_Enabled (0x1UL)          /*!< Enable publishing                                                    */


/* TWI_PUBLISH_SUSPENDED: Publish configuration for event SUSPENDED */
  #define TWI_PUBLISH_SUSPENDED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SUSPENDED register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event SUSPENDED will publish to */
  #define TWI_PUBLISH_SUSPENDED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define TWI_PUBLISH_SUSPENDED_CHIDX_Msk (0xFFUL << TWI_PUBLISH_SUSPENDED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define TWI_PUBLISH_SUSPENDED_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define TWI_PUBLISH_SUSPENDED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TWI_PUBLISH_SUSPENDED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define TWI_PUBLISH_SUSPENDED_EN_Msk (0x1UL << TWI_PUBLISH_SUSPENDED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define TWI_PUBLISH_SUSPENDED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define TWI_PUBLISH_SUSPENDED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define TWI_PUBLISH_SUSPENDED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define TWI_PUBLISH_SUSPENDED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* TWI_SHORTS: Shortcuts between local events and tasks */
  #define TWI_SHORTS_ResetValue (0x00000000UL)       /*!< Reset value of SHORTS register.                                      */

/* BB_SUSPEND @Bit 0 : Shortcut between event BB and task SUSPEND */
  #define TWI_SHORTS_BB_SUSPEND_Pos (0UL)            /*!< Position of BB_SUSPEND field.                                        */
  #define TWI_SHORTS_BB_SUSPEND_Msk (0x1UL << TWI_SHORTS_BB_SUSPEND_Pos) /*!< Bit mask of BB_SUSPEND field.                    */
  #define TWI_SHORTS_BB_SUSPEND_Min (0x0UL)          /*!< Min enumerator value of BB_SUSPEND field.                            */
  #define TWI_SHORTS_BB_SUSPEND_Max (0x1UL)          /*!< Max enumerator value of BB_SUSPEND field.                            */
  #define TWI_SHORTS_BB_SUSPEND_Disabled (0x0UL)     /*!< Disable shortcut                                                     */
  #define TWI_SHORTS_BB_SUSPEND_Enabled (0x1UL)      /*!< Enable shortcut                                                      */

/* BB_STOP @Bit 1 : Shortcut between event BB and task STOP */
  #define TWI_SHORTS_BB_STOP_Pos (1UL)               /*!< Position of BB_STOP field.                                           */
  #define TWI_SHORTS_BB_STOP_Msk (0x1UL << TWI_SHORTS_BB_STOP_Pos) /*!< Bit mask of BB_STOP field.                             */
  #define TWI_SHORTS_BB_STOP_Min (0x0UL)             /*!< Min enumerator value of BB_STOP field.                               */
  #define TWI_SHORTS_BB_STOP_Max (0x1UL)             /*!< Max enumerator value of BB_STOP field.                               */
  #define TWI_SHORTS_BB_STOP_Disabled (0x0UL)        /*!< Disable shortcut                                                     */
  #define TWI_SHORTS_BB_STOP_Enabled (0x1UL)         /*!< Enable shortcut                                                      */


/* TWI_INTENSET: Enable interrupt */
  #define TWI_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define TWI_INTENSET_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define TWI_INTENSET_STOPPED_Msk (0x1UL << TWI_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define TWI_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define TWI_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define TWI_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define TWI_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWI_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* RXDREADY @Bit 2 : Write '1' to enable interrupt for event RXDREADY */
  #define TWI_INTENSET_RXDREADY_Pos (2UL)            /*!< Position of RXDREADY field.                                          */
  #define TWI_INTENSET_RXDREADY_Msk (0x1UL << TWI_INTENSET_RXDREADY_Pos) /*!< Bit mask of RXDREADY field.                      */
  #define TWI_INTENSET_RXDREADY_Min (0x0UL)          /*!< Min enumerator value of RXDREADY field.                              */
  #define TWI_INTENSET_RXDREADY_Max (0x1UL)          /*!< Max enumerator value of RXDREADY field.                              */
  #define TWI_INTENSET_RXDREADY_Set (0x1UL)          /*!< Enable                                                               */
  #define TWI_INTENSET_RXDREADY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWI_INTENSET_RXDREADY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

