tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* TXDSENT @Bit 7 : Write '1' to enable interrupt for event TXDSENT */
  #define TWI_INTENSET_TXDSENT_Pos (7UL)             /*!< Position of TXDSENT field.                                           */
  #define TWI_INTENSET_TXDSENT_Msk (0x1UL << TWI_INTENSET_TXDSENT_Pos) /*!< Bit mask of TXDSENT field.                         */
  #define TWI_INTENSET_TXDSENT_Min (0x0UL)           /*!< Min enumerator value of TXDSENT field.                               */
  #define TWI_INTENSET_TXDSENT_Max (0x1UL)           /*!< Max enumerator value of TXDSENT field.                               */
  #define TWI_INTENSET_TXDSENT_Set (0x1UL)           /*!< Enable                                                               */
  #define TWI_INTENSET_TXDSENT_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWI_INTENSET_TXDSENT_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR @Bit 9 : Write '1' to enable interrupt for event ERROR */
  #define TWI_INTENSET_ERROR_Pos (9UL)               /*!< Position of ERROR field.                                             */
  #define TWI_INTENSET_ERROR_Msk (0x1UL << TWI_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                               */
  #define TWI_INTENSET_ERROR_Min (0x0UL)             /*!< Min enumerator value of ERROR field.                                 */
  #define TWI_INTENSET_ERROR_Max (0x1UL)             /*!< Max enumerator value of ERROR field.                                 */
  #define TWI_INTENSET_ERROR_Set (0x1UL)             /*!< Enable                                                               */
  #define TWI_INTENSET_ERROR_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define TWI_INTENSET_ERROR_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* BB @Bit 14 : Write '1' to enable interrupt for event BB */
  #define TWI_INTENSET_BB_Pos (14UL)                 /*!< Position of BB field.                                                */
  #define TWI_INTENSET_BB_Msk (0x1UL << TWI_INTENSET_BB_Pos) /*!< Bit mask of BB field.                                        */
  #define TWI_INTENSET_BB_Min (0x0UL)                /*!< Min enumerator value of BB field.                                    */
  #define TWI_INTENSET_BB_Max (0x1UL)                /*!< Max enumerator value of BB field.                                    */
  #define TWI_INTENSET_BB_Set (0x1UL)                /*!< Enable                                                               */
  #define TWI_INTENSET_BB_Disabled (0x0UL)           /*!< Read: Disabled                                                       */
  #define TWI_INTENSET_BB_Enabled (0x1UL)            /*!< Read: Enabled                                                        */

/* SUSPENDED @Bit 18 : Write '1' to enable interrupt for event SUSPENDED */
  #define TWI_INTENSET_SUSPENDED_Pos (18UL)          /*!< Position of SUSPENDED field.                                         */
  #define TWI_INTENSET_SUSPENDED_Msk (0x1UL << TWI_INTENSET_SUSPENDED_Pos) /*!< Bit mask of SUSPENDED field.                   */
  #define TWI_INTENSET_SUSPENDED_Min (0x0UL)         /*!< Min enumerator value of SUSPENDED field.                             */
  #define TWI_INTENSET_SUSPENDED_Max (0x1UL)         /*!< Max enumerator value of SUSPENDED field.                             */
  #define TWI_INTENSET_SUSPENDED_Set (0x1UL)         /*!< Enable                                                               */
  #define TWI_INTENSET_SUSPENDED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define TWI_INTENSET_SUSPENDED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* TWI_INTENCLR: Disable interrupt */
  #define TWI_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define TWI_INTENCLR_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define TWI_INTENCLR_STOPPED_Msk (0x1UL << TWI_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define TWI_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define TWI_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define TWI_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define TWI_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWI_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* RXDREADY @Bit 2 : Write '1' to disable interrupt for event RXDREADY */
  #define TWI_INTENCLR_RXDREADY_Pos (2UL)            /*!< Position of RXDREADY field.                                          */
  #define TWI_INTENCLR_RXDREADY_Msk (0x1UL << TWI_INTENCLR_RXDREADY_Pos) /*!< Bit mask of RXDREADY field.                      */
  #define TWI_INTENCLR_RXDREADY_Min (0x0UL)          /*!< Min enumerator value of RXDREADY field.                              */
  #define TWI_INTENCLR_RXDREADY_Max (0x1UL)          /*!< Max enumerator value of RXDREADY field.                              */
  #define TWI_INTENCLR_RXDREADY_Clear (0x1UL)        /*!< Disable                                                              */
  #define TWI_INTENCLR_RXDREADY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWI_INTENCLR_RXDREADY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* TXDSENT @Bit 7 : Write '1' to disable interrupt for event TXDSENT */
  #define TWI_INTENCLR_TXDSENT_Pos (7UL)             /*!< Position of TXDSENT field.                                           */
  #define TWI_INTENCLR_TXDSENT_Msk (0x1UL << TWI_INTENCLR_TXDSENT_Pos) /*!< Bit mask of TXDSENT field.                         */
  #define TWI_INTENCLR_TXDSENT_Min (0x0UL)           /*!< Min enumerator value of TXDSENT field.                               */
  #define TWI_INTENCLR_TXDSENT_Max (0x1UL)           /*!< Max enumerator value of TXDSENT field.                               */
  #define TWI_INTENCLR_TXDSENT_Clear (0x1UL)         /*!< Disable                                                              */
  #define TWI_INTENCLR_TXDSENT_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TWI_INTENCLR_TXDSENT_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ERROR @Bit 9 : Write '1' to disable interrupt for event ERROR */
  #define TWI_INTENCLR_ERROR_Pos (9UL)               /*!< Position of ERROR field.                                             */
  #define TWI_INTENCLR_ERROR_Msk (0x1UL << TWI_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                               */
  #define TWI_INTENCLR_ERROR_Min (0x0UL)             /*!< Min enumerator value of ERROR field.                                 */
  #define TWI_INTENCLR_ERROR_Max (0x1UL)             /*!< Max enumerator value of ERROR field.                                 */
  #define TWI_INTENCLR_ERROR_Clear (0x1UL)           /*!< Disable                                                              */
  #define TWI_INTENCLR_ERROR_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define TWI_INTENCLR_ERROR_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* BB @Bit 14 : Write '1' to disable interrupt for event BB */
  #define TWI_INTENCLR_BB_Pos (14UL)                 /*!< Position of BB field.                                                */
  #define TWI_INTENCLR_BB_Msk (0x1UL << TWI_INTENCLR_BB_Pos) /*!< Bit mask of BB field.                                        */
  #define TWI_INTENCLR_BB_Min (0x0UL)                /*!< Min enumerator value of BB field.                                    */
  #define TWI_INTENCLR_BB_Max (0x1UL)                /*!< Max enumerator value of BB field.                                    */
  #define TWI_INTENCLR_BB_Clear (0x1UL)              /*!< Disable                                                              */
  #define TWI_INTENCLR_BB_Disabled (0x0UL)           /*!< Read: Disabled                                                       */
  #define TWI_INTENCLR_BB_Enabled (0x1UL)            /*!< Read: Enabled                                                        */

