tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* SUSPENDED @Bit 18 : Write '1' to disable interrupt for event SUSPENDED */
  #define TWI_INTENCLR_SUSPENDED_Pos (18UL)          /*!< Position of SUSPENDED field.                                         */
  #define TWI_INTENCLR_SUSPENDED_Msk (0x1UL << TWI_INTENCLR_SUSPENDED_Pos) /*!< Bit mask of SUSPENDED field.                   */
  #define TWI_INTENCLR_SUSPENDED_Min (0x0UL)         /*!< Min enumerator value of SUSPENDED field.                             */
  #define TWI_INTENCLR_SUSPENDED_Max (0x1UL)         /*!< Max enumerator value of SUSPENDED field.                             */
  #define TWI_INTENCLR_SUSPENDED_Clear (0x1UL)       /*!< Disable                                                              */
  #define TWI_INTENCLR_SUSPENDED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define TWI_INTENCLR_SUSPENDED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* TWI_ERRORSRC: Error source */
  #define TWI_ERRORSRC_ResetValue (0x00000000UL)     /*!< Reset value of ERRORSRC register.                                    */

/* OVERRUN @Bit 0 : Overrun error */
  #define TWI_ERRORSRC_OVERRUN_Pos (0UL)             /*!< Position of OVERRUN field.                                           */
  #define TWI_ERRORSRC_OVERRUN_Msk (0x1UL << TWI_ERRORSRC_OVERRUN_Pos) /*!< Bit mask of OVERRUN field.                         */
  #define TWI_ERRORSRC_OVERRUN_Min (0x0UL)           /*!< Min enumerator value of OVERRUN field.                               */
  #define TWI_ERRORSRC_OVERRUN_Max (0x1UL)           /*!< Max enumerator value of OVERRUN field.                               */
  #define TWI_ERRORSRC_OVERRUN_NotPresent (0x0UL)    /*!< Read: no overrun occured                                             */
  #define TWI_ERRORSRC_OVERRUN_Present (0x1UL)       /*!< Read: overrun occured                                                */

/* ANACK @Bit 1 : NACK received after sending the address (write '1' to clear) */
  #define TWI_ERRORSRC_ANACK_Pos (1UL)               /*!< Position of ANACK field.                                             */
  #define TWI_ERRORSRC_ANACK_Msk (0x1UL << TWI_ERRORSRC_ANACK_Pos) /*!< Bit mask of ANACK field.                               */
  #define TWI_ERRORSRC_ANACK_Min (0x0UL)             /*!< Min enumerator value of ANACK field.                                 */
  #define TWI_ERRORSRC_ANACK_Max (0x1UL)             /*!< Max enumerator value of ANACK field.                                 */
  #define TWI_ERRORSRC_ANACK_NotPresent (0x0UL)      /*!< Read: error not present                                              */
  #define TWI_ERRORSRC_ANACK_Present (0x1UL)         /*!< Read: error present                                                  */

/* DNACK @Bit 2 : NACK received after sending a data byte (write '1' to clear) */
  #define TWI_ERRORSRC_DNACK_Pos (2UL)               /*!< Position of DNACK field.                                             */
  #define TWI_ERRORSRC_DNACK_Msk (0x1UL << TWI_ERRORSRC_DNACK_Pos) /*!< Bit mask of DNACK field.                               */
  #define TWI_ERRORSRC_DNACK_Min (0x0UL)             /*!< Min enumerator value of DNACK field.                                 */
  #define TWI_ERRORSRC_DNACK_Max (0x1UL)             /*!< Max enumerator value of DNACK field.                                 */
  #define TWI_ERRORSRC_DNACK_NotPresent (0x0UL)      /*!< Read: error not present                                              */
  #define TWI_ERRORSRC_DNACK_Present (0x1UL)         /*!< Read: error present                                                  */


/* TWI_ENABLE: Enable TWI */
  #define TWI_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable TWI */
  #define TWI_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define TWI_ENABLE_ENABLE_Msk (0xFUL << TWI_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define TWI_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define TWI_ENABLE_ENABLE_Max (0x5UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define TWI_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable TWI                                                          */
  #define TWI_ENABLE_ENABLE_Enabled (0x5UL)          /*!< Enable TWI                                                           */


/* TWI_RXD: RXD register */
  #define TWI_RXD_ResetValue (0x00000000UL)          /*!< Reset value of RXD register.                                         */

/* RXD @Bits 0..7 : RXD register */
  #define TWI_RXD_RXD_Pos (0UL)                      /*!< Position of RXD field.                                               */
  #define TWI_RXD_RXD_Msk (0xFFUL << TWI_RXD_RXD_Pos) /*!< Bit mask of RXD field.                                              */


/* TWI_TXD: TXD register */
  #define TWI_TXD_ResetValue (0x00000000UL)          /*!< Reset value of TXD register.                                         */

/* TXD @Bits 0..7 : TXD register */
  #define TWI_TXD_TXD_Pos (0UL)                      /*!< Position of TXD field.                                               */
  #define TWI_TXD_TXD_Msk (0xFFUL << TWI_TXD_TXD_Pos) /*!< Bit mask of TXD field.                                              */


/* TWI_FREQUENCY: TWI frequency. Accuracy depends on the HFCLK source selected. */
  #define TWI_FREQUENCY_ResetValue (0x04000000UL)    /*!< Reset value of FREQUENCY register.                                   */

/* FREQUENCY @Bits 0..31 : TWI master clock frequency */
  #define TWI_FREQUENCY_FREQUENCY_Pos (0UL)          /*!< Position of FREQUENCY field.                                         */
  #define TWI_FREQUENCY_FREQUENCY_Msk (0xFFFFFFFFUL << TWI_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field.          */
  #define TWI_FREQUENCY_FREQUENCY_Min (0x1980000UL)  /*!< Min enumerator value of FREQUENCY field.                             */
  #define TWI_FREQUENCY_FREQUENCY_Max (0x6680000UL)  /*!< Max enumerator value of FREQUENCY field.                             */
  #define TWI_FREQUENCY_FREQUENCY_K100 (0x01980000UL) /*!< 100 kbps                                                            */
  #define TWI_FREQUENCY_FREQUENCY_K250 (0x04000000UL) /*!< 250 kbps                                                            */
  #define TWI_FREQUENCY_FREQUENCY_K400 (0x06680000UL) /*!< 400 kbps (actual rate 410.256 kbps)                                 */


