tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* OTP @Bits 0..31 : OTP word */
  #define UICR_OTP_OTP_Pos (0UL)                     /*!< Position of OTP field.                                               */
  #define UICR_OTP_OTP_Msk (0xFFFFFFFFUL << UICR_OTP_OTP_Pos) /*!< Bit mask of OTP field.                                      */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            VPR                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct VPR_DEBUGIF ==================================================== */
/**
  * @brief DEBUGIF [VPR_DEBUGIF] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  DATA0;                             /*!< (@ 0x00000010) Abstract Data 0. Read/write data for argument 0       */
  __IOM uint32_t  DATA1;                             /*!< (@ 0x00000014) Abstract Data 1. Read/write data for argument 1       */
  __IM  uint32_t  RESERVED1[10];
  __IOM uint32_t  DMCONTROL;                         /*!< (@ 0x00000040) Debug Module Control                                  */
  __IM  uint32_t  DMSTATUS;                          /*!< (@ 0x00000044) Debug Module Status                                   */
  __IOM uint32_t  HARTINFO;                          /*!< (@ 0x00000048) Hart Information                                      */
  __IOM uint32_t  HALTSUM1;                          /*!< (@ 0x0000004C) Halt Summary 1                                        */
  __IOM uint32_t  HAWINDOWSEL;                       /*!< (@ 0x00000050) Hart Array Window Select                              */
  __IOM uint32_t  HAWINDOW;                          /*!< (@ 0x00000054) Hart Array Window                                     */
  __IOM uint32_t  ABSTRACTCS;                        /*!< (@ 0x00000058) Abstract Control and Status                           */
  __OM  uint32_t  ABSTRACTCMD;                       /*!< (@ 0x0000005C) Abstract command                                      */
  __IOM uint32_t  ABSTRACTAUTO;                      /*!< (@ 0x00000060) Abstract Command Autoexec                             */
  __IOM uint32_t  CONFSTRPTR[4];                     /*!< (@ 0x00000064) Configuration String Pointer [n]                      */
  __IOM uint32_t  NEXTDM;                            /*!< (@ 0x00000074) Next Debug Module                                     */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  PROGBUF[16];                       /*!< (@ 0x00000080) Program Buffer [n]                                    */
  __IOM uint32_t  AUTHDATA;                          /*!< (@ 0x000000C0) Authentication Data                                   */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  HALTSUM2;                          /*!< (@ 0x000000D0) Halt Summary 2                                        */
  __IOM uint32_t  HALTSUM3;                          /*!< (@ 0x000000D4) Halt Summary 3                                        */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SBADDRESS3;                        /*!< (@ 0x000000DC) System Bus Addres 127:96                              */
  __IOM uint32_t  SBCS;                              /*!< (@ 0x000000E0) System Bus Access Control and Status                  */
  __IOM uint32_t  SBADDRESS0;                        /*!< (@ 0x000000E4) System Bus Addres 31:0                                */
  __IOM uint32_t  SBADDRESS1;                        /*!< (@ 0x000000E8) System Bus Addres 63:32                               */
  __IOM uint32_t  SBADDRESS2;                        /*!< (@ 0x000000EC) System Bus Addres 95:64                               */
  __IOM uint32_t  SBDATA0;                           /*!< (@ 0x000000F0) System Bus Data 31:0                                  */
  __IOM uint32_t  SBDATA1;                           /*!< (@ 0x000000F4) System Bus Data 63:32                                 */
  __IOM uint32_t  SBDATA2;                           /*!< (@ 0x000000F8) System Bus Data 95:64                                 */
  __IOM uint32_t  SBDATA3;                           /*!< (@ 0x000000FC) System Bus Data 127:96                                */
  __IOM uint32_t  HALTSUM0;                          /*!< (@ 0x00000100) Halt summary 0                                        */
} NRF_VPR_DEBUGIF_Type;                              /*!< Size = 260 (0x104)                                                   */

/* VPR_DEBUGIF_DATA0: Abstract Data 0. Read/write data for argument 0 */
  #define VPR_DEBUGIF_DATA0_ResetValue (0x00000000UL) /*!< Reset value of DATA0 register.                                      */

/* DATA0 @Bits 0..31 : Abstract Data 0 */
  #define VPR_DEBUGIF_DATA0_DATA0_Pos (0UL)          /*!< Position of DATA0 field.                                             */
  #define VPR_DEBUGIF_DATA0_DATA0_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_DATA0_DATA0_Pos) /*!< Bit mask of DATA0 field.              */


/* VPR_DEBUGIF_DATA1: Abstract Data 1. Read/write data for argument 1 */
  #define VPR_DEBUGIF_DATA1_ResetValue (0x00000000UL) /*!< Reset value of DATA1 register.                                      */

/* DATA1 @Bits 0..31 : Abstract Data 1 */
  #define VPR_DEBUGIF_DATA1_DATA1_Pos (0UL)          /*!< Position of DATA1 field.                                             */
  #define VPR_DEBUGIF_DATA1_DATA1_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_DATA1_DATA1_Pos) /*!< Bit mask of DATA1 field.              */


/* VPR_DEBUGIF_DMCONTROL: Debug Module Control */
  #define VPR_DEBUGIF_DMCONTROL_ResetValue (0x00000000UL) /*!< Reset value of DMCONTROL register.                              */

/* DMACTIVE @Bit 0 : Reset signal for the debug module. */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos (0UL)   /*!< Position of DMACTIVE field.                                          */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos) /*!< Bit mask of DMACTIVE field.    */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Min (0x0UL) /*!< Min enumerator value of DMACTIVE field.                              */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Max (0x1UL) /*!< Max enumerator value of DMACTIVE field.                              */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Disabled (0x0UL) /*!< Reset the debug module itself                                   */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled (0x1UL) /*!< Normal operation                                                 */

/* NDMRESET @Bit 1 : Reset signal output from the debug module to the system. */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos (1UL)   /*!< Position of NDMRESET field.                                          */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos) /*!< Bit mask of NDMRESET field.    */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Min (0x0UL) /*!< Min enumerator value of NDMRESET field.                              */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Max (0x1UL) /*!< Max enumerator value of NDMRESET field.                              */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Inactive (0x0UL) /*!< Reset inactive                                                  */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Active (0x1UL) /*!< Reset active                                                      */

/* CLRRESETHALTREQ @Bit 2 : Clear the halt on reset request. */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos (2UL) /*!< Position of CLRRESETHALTREQ field.                              */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos) /*!< Bit mask of
                                                                            CLRRESETHALTREQ field.*/
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Min (0x0UL) /*!< Min enumerator value of CLRRESETHALTREQ field.                */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Max (0x1UL) /*!< Max enumerator value of CLRRESETHALTREQ field.                */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_NoOperation (0x0UL) /*!< No operation when written 0.                          */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Clear (0x1UL) /*!< Clears the halt on reset request                            */

