tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* SUBSCRIBE17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Pos (17UL) /*!< Position of SUBSCRIBE17 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE17 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE17 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE17 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Disabled (0x0UL) /*!< Subscribe disabled for TASK[17]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Enabled (0x1UL) /*!< Subscribe enabled for TASK[17]                              */

/* SUBSCRIBE18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Pos (18UL) /*!< Position of SUBSCRIBE18 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE18 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE18 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE18 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Disabled (0x0UL) /*!< Subscribe disabled for TASK[18]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Enabled (0x1UL) /*!< Subscribe enabled for TASK[18]                              */

/* SUBSCRIBE19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Pos (19UL) /*!< Position of SUBSCRIBE19 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE19 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE19 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE19 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Disabled (0x0UL) /*!< Subscribe disabled for TASK[19]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Enabled (0x1UL) /*!< Subscribe enabled for TASK[19]                              */

/* SUBSCRIBE20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Pos (20UL) /*!< Position of SUBSCRIBE20 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE20 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE20 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE20 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Disabled (0x0UL) /*!< Subscribe disabled for TASK[20]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Enabled (0x1UL) /*!< Subscribe enabled for TASK[20]                              */

/* SUBSCRIBE21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Pos (21UL) /*!< Position of SUBSCRIBE21 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE21 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE21 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE21 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Disabled (0x0UL) /*!< Subscribe disabled for TASK[21]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Enabled (0x1UL) /*!< Subscribe enabled for TASK[21]                              */

/* SUBSCRIBE22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Pos (22UL) /*!< Position of SUBSCRIBE22 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE22 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE22 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE22 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Disabled (0x0UL) /*!< Subscribe disabled for TASK[22]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Enabled (0x1UL) /*!< Subscribe enabled for TASK[22]                              */

/* SUBSCRIBE23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Pos (23UL) /*!< Position of SUBSCRIBE23 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE23 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE23 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE23 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Disabled (0x0UL) /*!< Subscribe disabled for TASK[23]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Enabled (0x1UL) /*!< Subscribe enabled for TASK[23]                              */

/* SUBSCRIBE24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Pos (24UL) /*!< Position of SUBSCRIBE24 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE24 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE24 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE24 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Disabled (0x0UL) /*!< Subscribe disabled for TASK[24]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Enabled (0x1UL) /*!< Subscribe enabled for TASK[24]                              */

/* SUBSCRIBE25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Pos (25UL) /*!< Position of SUBSCRIBE25 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE25 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE25 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE25 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Disabled (0x0UL) /*!< Subscribe disabled for TASK[25]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Enabled (0x1UL) /*!< Subscribe enabled for TASK[25]                              */

