tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* SUBSCRIBE26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Pos (26UL) /*!< Position of SUBSCRIBE26 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE26 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE26 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE26 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Disabled (0x0UL) /*!< Subscribe disabled for TASK[26]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Enabled (0x1UL) /*!< Subscribe enabled for TASK[26]                              */

/* SUBSCRIBE27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Pos (27UL) /*!< Position of SUBSCRIBE27 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE27 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE27 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE27 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Disabled (0x0UL) /*!< Subscribe disabled for TASK[27]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Enabled (0x1UL) /*!< Subscribe enabled for TASK[27]                              */

/* SUBSCRIBE28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Pos (28UL) /*!< Position of SUBSCRIBE28 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE28 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE28 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE28 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Disabled (0x0UL) /*!< Subscribe disabled for TASK[28]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Enabled (0x1UL) /*!< Subscribe enabled for TASK[28]                              */

/* SUBSCRIBE29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Pos (29UL) /*!< Position of SUBSCRIBE29 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE29 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE29 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE29 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Disabled (0x0UL) /*!< Subscribe disabled for TASK[29]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Enabled (0x1UL) /*!< Subscribe enabled for TASK[29]                              */

/* SUBSCRIBE30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Pos (30UL) /*!< Position of SUBSCRIBE30 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE30 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE30 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE30 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Disabled (0x0UL) /*!< Subscribe disabled for TASK[30]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Enabled (0x1UL) /*!< Subscribe enabled for TASK[30]                              */

/* SUBSCRIBE31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Pos (31UL) /*!< Position of SUBSCRIBE31 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE31 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE31 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE31 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Disabled (0x0UL) /*!< Subscribe disabled for TASK[31]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Enabled (0x1UL) /*!< Subscribe enabled for TASK[31]                              */


/**
  * @brief EVENTS [VPRCSR_NORDIC_EVENTS] DPPI Events
  */
  #define VPRCSR_NORDIC_EVENTS (0x000007E2ul)
  #define VPRCSR_NORDIC_EVENTS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS register.                                  */

/* EVENTS0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Pos (0UL)     /*!< Position of EVENTS0 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS0_Pos) /*!< Bit mask of EVENTS0 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Min (0x0UL)   /*!< Min enumerator value of EVENTS0 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Max (0x1UL)   /*!< Max enumerator value of EVENTS0 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Disabled (0x0UL) /*!< EVENTS[0] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Enabled (0x1UL) /*!< EVENTS[0] enabled                                                  */

/* EVENTS1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Pos (1UL)     /*!< Position of EVENTS1 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS1_Pos) /*!< Bit mask of EVENTS1 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Min (0x0UL)   /*!< Min enumerator value of EVENTS1 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Max (0x1UL)   /*!< Max enumerator value of EVENTS1 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Disabled (0x0UL) /*!< EVENTS[1] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Enabled (0x1UL) /*!< EVENTS[1] enabled                                                  */

/* EVENTS2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Pos (2UL)     /*!< Position of EVENTS2 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS2_Pos) /*!< Bit mask of EVENTS2 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Min (0x0UL)   /*!< Min enumerator value of EVENTS2 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Max (0x1UL)   /*!< Max enumerator value of EVENTS2 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Disabled (0x0UL) /*!< EVENTS[2] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Enabled (0x1UL) /*!< EVENTS[2] enabled                                                  */

