tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN4_Pos (4UL)           /*!< Position of PIN4 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN4_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN4_Pos) /*!< Bit mask of PIN4 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN4_Min (0x0UL)         /*!< Min enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN4_Max (0x1UL)         /*!< Max enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN4_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN4_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN5_Pos (5UL)           /*!< Position of PIN5 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN5_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN5_Pos) /*!< Bit mask of PIN5 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN5_Min (0x0UL)         /*!< Min enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN5_Max (0x1UL)         /*!< Max enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN5_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN5_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN6_Pos (6UL)           /*!< Position of PIN6 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN6_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN6_Pos) /*!< Bit mask of PIN6 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN6_Min (0x0UL)         /*!< Min enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN6_Max (0x1UL)         /*!< Max enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN6_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN6_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN7_Pos (7UL)           /*!< Position of PIN7 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN7_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN7_Pos) /*!< Bit mask of PIN7 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN7_Min (0x0UL)         /*!< Min enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN7_Max (0x1UL)         /*!< Max enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN7_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN7_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN8_Pos (8UL)           /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN8_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN8_Pos) /*!< Bit mask of PIN8 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN8_Min (0x0UL)         /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN8_Max (0x1UL)         /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN8_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN8_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN9_Pos (9UL)           /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_OUT_PIN9_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN9_Pos) /*!< Bit mask of PIN9 field.                        */
  #define VPRCSR_NORDIC_OUT_PIN9_Min (0x0UL)         /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN9_Max (0x1UL)         /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_OUT_PIN9_LOW (0x0UL)         /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN9_HIGH (0x1UL)        /*!< Pin driver is high                                                   */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN10_Pos (10UL)         /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_OUT_PIN10_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN10_Pos) /*!< Bit mask of PIN10 field.                     */
  #define VPRCSR_NORDIC_OUT_PIN10_Min (0x0UL)        /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN10_Max (0x1UL)        /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN10_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN10_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN11_Pos (11UL)         /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_OUT_PIN11_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN11_Pos) /*!< Bit mask of PIN11 field.                     */
  #define VPRCSR_NORDIC_OUT_PIN11_Min (0x0UL)        /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN11_Max (0x1UL)        /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN11_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN11_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN12_Pos (12UL)         /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_OUT_PIN12_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN12_Pos) /*!< Bit mask of PIN12 field.                     */
  #define VPRCSR_NORDIC_OUT_PIN12_Min (0x0UL)        /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN12_Max (0x1UL)        /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN12_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN12_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN13_Pos (13UL)         /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_OUT_PIN13_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN13_Pos) /*!< Bit mask of PIN13 field.                     */
  #define VPRCSR_NORDIC_OUT_PIN13_Min (0x0UL)        /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN13_Max (0x1UL)        /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN13_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN13_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN14_Pos (14UL)         /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_OUT_PIN14_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN14_Pos) /*!< Bit mask of PIN14 field.                     */
  #define VPRCSR_NORDIC_OUT_PIN14_Min (0x0UL)        /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN14_Max (0x1UL)        /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN14_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN14_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN15_Pos (15UL)         /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_OUT_PIN15_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN15_Pos) /*!< Bit mask of PIN15 field.                     */
  #define VPRCSR_NORDIC_OUT_PIN15_Min (0x0UL)        /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN15_Max (0x1UL)        /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_OUT_PIN15_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUT_PIN15_HIGH (0x1UL)       /*!< Pin driver is high                                                   */


/**
  * @brief DIR [VPRCSR_NORDIC_DIR] GPIO pin Direction. Real Time Peripherals VIO.
  */
  #define VPRCSR_NORDIC_DIR (0x00000BC1ul)
  #define VPRCSR_NORDIC_DIR_ResetValue (0x00000000UL) /*!< Reset value of DIR register.                                        */

