tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* OUT9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_Pos (9UL)     /*!< Position of OUT9 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT9_Pos) /*!< Bit mask of OUT9 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_Min (0x0UL)   /*!< Min enumerator value of OUT9 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_Max (0x1UL)   /*!< Max enumerator value of OUT9 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

/* OUT10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_Pos (10UL)   /*!< Position of OUT10 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT10_Pos) /*!< Bit mask of OUT10 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_Min (0x0UL)  /*!< Min enumerator value of OUT10 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_Max (0x1UL)  /*!< Max enumerator value of OUT10 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* OUT11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_Pos (11UL)   /*!< Position of OUT11 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT11_Pos) /*!< Bit mask of OUT11 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_Min (0x0UL)  /*!< Min enumerator value of OUT11 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_Max (0x1UL)  /*!< Max enumerator value of OUT11 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* OUT12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_Pos (12UL)   /*!< Position of OUT12 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT12_Pos) /*!< Bit mask of OUT12 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_Min (0x0UL)  /*!< Min enumerator value of OUT12 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_Max (0x1UL)  /*!< Max enumerator value of OUT12 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* OUT13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_Pos (13UL)   /*!< Position of OUT13 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT13_Pos) /*!< Bit mask of OUT13 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_Min (0x0UL)  /*!< Min enumerator value of OUT13 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_Max (0x1UL)  /*!< Max enumerator value of OUT13 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* OUT14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_Pos (14UL)   /*!< Position of OUT14 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT14_Pos) /*!< Bit mask of OUT14 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_Min (0x0UL)  /*!< Min enumerator value of OUT14 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_Max (0x1UL)  /*!< Max enumerator value of OUT14 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* OUT15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_Pos (15UL)   /*!< Position of OUT15 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT15_Pos) /*!< Bit mask of OUT15 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_Min (0x0UL)  /*!< Min enumerator value of OUT15 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_Max (0x1UL)  /*!< Max enumerator value of OUT15 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* DIR0 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_Pos (16UL)    /*!< Position of DIR0 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR0_Pos) /*!< Bit mask of DIR0 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_Min (0x0UL)   /*!< Min enumerator value of DIR0 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_Max (0x1UL)   /*!< Max enumerator value of DIR0 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

