tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN8_Pos (8UL)           /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN8_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN8_Pos) /*!< Bit mask of PIN8 field.                        */
  #define VPRCSR_NORDIC_INB_PIN8_Min (0x0UL)         /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN8_Max (0x1UL)         /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN8_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN8_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN9_Pos (9UL)           /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_INB_PIN9_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN9_Pos) /*!< Bit mask of PIN9 field.                        */
  #define VPRCSR_NORDIC_INB_PIN9_Min (0x0UL)         /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN9_Max (0x1UL)         /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_INB_PIN9_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN9_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN10_Pos (10UL)         /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN10_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN10_Pos) /*!< Bit mask of PIN10 field.                     */
  #define VPRCSR_NORDIC_INB_PIN10_Min (0x0UL)        /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN10_Max (0x1UL)        /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN10_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN10_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN11_Pos (11UL)         /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN11_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN11_Pos) /*!< Bit mask of PIN11 field.                     */
  #define VPRCSR_NORDIC_INB_PIN11_Min (0x0UL)        /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN11_Max (0x1UL)        /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN11_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN11_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN12_Pos (12UL)         /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN12_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN12_Pos) /*!< Bit mask of PIN12 field.                     */
  #define VPRCSR_NORDIC_INB_PIN12_Min (0x0UL)        /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN12_Max (0x1UL)        /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN12_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN12_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN13_Pos (13UL)         /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN13_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN13_Pos) /*!< Bit mask of PIN13 field.                     */
  #define VPRCSR_NORDIC_INB_PIN13_Min (0x0UL)        /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN13_Max (0x1UL)        /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN13_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN13_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN14_Pos (14UL)         /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN14_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN14_Pos) /*!< Bit mask of PIN14 field.                     */
  #define VPRCSR_NORDIC_INB_PIN14_Min (0x0UL)        /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN14_Max (0x1UL)        /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN14_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN14_HIGH (0x1UL)       /*!< Pin is High                                                          */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN15_Pos (15UL)         /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_INB_PIN15_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN15_Pos) /*!< Bit mask of PIN15 field.                     */
  #define VPRCSR_NORDIC_INB_PIN15_Min (0x0UL)        /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN15_Max (0x1UL)        /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_INB_PIN15_LOW (0x0UL)        /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_INB_PIN15_HIGH (0x1UL)       /*!< Pin is High                                                          */




/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct WDT ======================================================== */
/**
  * @brief Watchdog Timer
  */
  typedef struct {                                   /*!< WDT Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start WDT                                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop WDT                                              */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_TIMEOUT;                   /*!< (@ 0x00000100) Watchdog timeout                                      */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) Watchdog stopped                                      */
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_TIMEOUT;                  /*!< (@ 0x00000180) Publish configuration for event TIMEOUT               */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[6];
    __IOM uint32_t NMIENSET;                         /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t NMIENCLR;                         /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t RESERVED5[53];
    __IM uint32_t RUNSTATUS;                         /*!< (@ 0x00000400) Run status                                            */
    __IM uint32_t REQSTATUS;                         /*!< (@ 0x00000404) Request status                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t CRV;                              /*!< (@ 0x00000504) Counter reload value                                  */
    __IOM uint32_t RREN;                             /*!< (@ 0x00000508) Enable register for reload request registers          */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000050C) Configuration register                                */
    __IM uint32_t RESERVED7[4];
    __OM uint32_t TSEN;                              /*!< (@ 0x00000520) Task stop enable                                      */
    __IM uint32_t RESERVED8[55];
    __OM uint32_t RR[8];                             /*!< (@ 0x00000600) Reload request n                                      */
  } NRF_WDT_Type;                                    /*!< Size = 1568 (0x620)                                                  */

