tim-carlo/Unified-MCU-BIST-Framework/tagets/nrf52/Include/nrf54l15_enga_types.h
/* TIMEOUT @Bit 0 : Write '1' to enable interrupt for event TIMEOUT */
  #define WDT_INTENSET_TIMEOUT_Pos (0UL)             /*!< Position of TIMEOUT field.                                           */
  #define WDT_INTENSET_TIMEOUT_Msk (0x1UL << WDT_INTENSET_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.                         */
  #define WDT_INTENSET_TIMEOUT_Min (0x0UL)           /*!< Min enumerator value of TIMEOUT field.                               */
  #define WDT_INTENSET_TIMEOUT_Max (0x1UL)           /*!< Max enumerator value of TIMEOUT field.                               */
  #define WDT_INTENSET_TIMEOUT_Set (0x1UL)           /*!< Enable                                                               */
  #define WDT_INTENSET_TIMEOUT_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_INTENSET_TIMEOUT_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define WDT_INTENSET_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define WDT_INTENSET_STOPPED_Msk (0x1UL << WDT_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define WDT_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define WDT_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define WDT_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define WDT_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */


/* WDT_INTENCLR: Disable interrupt */
  #define WDT_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* TIMEOUT @Bit 0 : Write '1' to disable interrupt for event TIMEOUT */
  #define WDT_INTENCLR_TIMEOUT_Pos (0UL)             /*!< Position of TIMEOUT field.                                           */
  #define WDT_INTENCLR_TIMEOUT_Msk (0x1UL << WDT_INTENCLR_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.                         */
  #define WDT_INTENCLR_TIMEOUT_Min (0x0UL)           /*!< Min enumerator value of TIMEOUT field.                               */
  #define WDT_INTENCLR_TIMEOUT_Max (0x1UL)           /*!< Max enumerator value of TIMEOUT field.                               */
  #define WDT_INTENCLR_TIMEOUT_Clear (0x1UL)         /*!< Disable                                                              */
  #define WDT_INTENCLR_TIMEOUT_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_INTENCLR_TIMEOUT_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define WDT_INTENCLR_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define WDT_INTENCLR_STOPPED_Msk (0x1UL << WDT_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define WDT_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define WDT_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define WDT_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define WDT_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */


/* WDT_NMIENSET: Enable interrupt */
  #define WDT_NMIENSET_ResetValue (0x00000000UL)     /*!< Reset value of NMIENSET register.                                    */

/* TIMEOUT @Bit 0 : Write '1' to enable interrupt for event TIMEOUT */
  #define WDT_NMIENSET_TIMEOUT_Pos (0UL)             /*!< Position of TIMEOUT field.                                           */
  #define WDT_NMIENSET_TIMEOUT_Msk (0x1UL << WDT_NMIENSET_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.                         */
  #define WDT_NMIENSET_TIMEOUT_Min (0x0UL)           /*!< Min enumerator value of TIMEOUT field.                               */
  #define WDT_NMIENSET_TIMEOUT_Max (0x1UL)           /*!< Max enumerator value of TIMEOUT field.                               */
  #define WDT_NMIENSET_TIMEOUT_Set (0x1UL)           /*!< Enable                                                               */
  #define WDT_NMIENSET_TIMEOUT_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_NMIENSET_TIMEOUT_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define WDT_NMIENSET_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define WDT_NMIENSET_STOPPED_Msk (0x1UL << WDT_NMIENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define WDT_NMIENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define WDT_NMIENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define WDT_NMIENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define WDT_NMIENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_NMIENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */


/* WDT_NMIENCLR: Disable interrupt */
  #define WDT_NMIENCLR_ResetValue (0x00000000UL)     /*!< Reset value of NMIENCLR register.                                    */

/* TIMEOUT @Bit 0 : Write '1' to disable interrupt for event TIMEOUT */
  #define WDT_NMIENCLR_TIMEOUT_Pos (0UL)             /*!< Position of TIMEOUT field.                                           */
  #define WDT_NMIENCLR_TIMEOUT_Msk (0x1UL << WDT_NMIENCLR_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.                         */
  #define WDT_NMIENCLR_TIMEOUT_Min (0x0UL)           /*!< Min enumerator value of TIMEOUT field.                               */
  #define WDT_NMIENCLR_TIMEOUT_Max (0x1UL)           /*!< Max enumerator value of TIMEOUT field.                               */
  #define WDT_NMIENCLR_TIMEOUT_Clear (0x1UL)         /*!< Disable                                                              */
  #define WDT_NMIENCLR_TIMEOUT_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_NMIENCLR_TIMEOUT_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define WDT_NMIENCLR_STOPPED_Pos (1UL)             /*!< Position of STOPPED field.                                           */
  #define WDT_NMIENCLR_STOPPED_Msk (0x1UL << WDT_NMIENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define WDT_NMIENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define WDT_NMIENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define WDT_NMIENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define WDT_NMIENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define WDT_NMIENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */


/* WDT_RUNSTATUS: Run status */
  #define WDT_RUNSTATUS_ResetValue (0x00000000UL)    /*!< Reset value of RUNSTATUS register.                                   */

/* RUNSTATUSWDT @Bit 0 : Indicates whether or not WDT is running */
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Pos (0UL)       /*!< Position of RUNSTATUSWDT field.                                      */
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Msk (0x1UL << WDT_RUNSTATUS_RUNSTATUSWDT_Pos) /*!< Bit mask of RUNSTATUSWDT field.        */
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Min (0x0UL)     /*!< Min enumerator value of RUNSTATUSWDT field.                          */
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Max (0x1UL)     /*!< Max enumerator value of RUNSTATUSWDT field.                          */
  #define WDT_RUNSTATUS_RUNSTATUSWDT_NotRunning (0x0UL) /*!< Watchdog is not running                                           */
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Running (0x1UL) /*!< Watchdog is running                                                  */


/* WDT_REQSTATUS: Request status */
  #define WDT_REQSTATUS_ResetValue (0x00000001UL)    /*!< Reset value of REQSTATUS register.                                   */

